{
  "topics": {
    "data": {
      "0": {
        "name": "0_magnetic_spin_field_temperature",
        "keywords": [
          [
            "magnetic",
            0.024034800644096924
          ],
          [
            "spin",
            0.02303381229583919
          ],
          [
            "field",
            0.014741990962385121
          ],
          [
            "temperature",
            0.014132648366983363
          ],
          [
            "electron",
            0.013286658924959506
          ],
          [
            "energy",
            0.012384377965036546
          ],
          [
            "high",
            0.012380755471915129
          ],
          [
            "properties",
            0.012153531896595793
          ],
          [
            "phase",
            0.012112819824560708
          ],
          [
            "materials",
            0.011777984282621194
          ]
        ],
        "count": 1437
      },
      "1": {
        "name": "1_topological_non_Hermitian_states",
        "keywords": [
          [
            "topological",
            0.052006653421851116
          ],
          [
            "non",
            0.03857806114661728
          ],
          [
            "Hermitian",
            0.03291547037718847
          ],
          [
            "states",
            0.026375487816333223
          ],
          [
            "phase",
            0.020853399906892563
          ],
          [
            "systems",
            0.0207575188290738
          ],
          [
            "symmetry",
            0.02003039654612289
          ],
          [
            "edge",
            0.01847639199461295
          ],
          [
            "model",
            0.017211318891077507
          ],
          [
            "modes",
            0.017207134856835886
          ]
        ],
        "count": 402
      },
      "2": {
        "name": "2_quantum_systems_state_time",
        "keywords": [
          [
            "quantum",
            0.07327203358343132
          ],
          [
            "systems",
            0.02380680318129561
          ],
          [
            "state",
            0.0235738569674665
          ],
          [
            "time",
            0.022996101225932992
          ],
          [
            "states",
            0.02135425347690915
          ],
          [
            "dynamics",
            0.021337948365621796
          ],
          [
            "classical",
            0.016237237636307918
          ],
          [
            "Quantum",
            0.015901577097089534
          ],
          [
            "phase",
            0.015413722194553376
          ],
          [
            "algorithm",
            0.015010622827410678
          ]
        ],
        "count": 291
      },
      "3": {
        "name": "3_quantum_field_non_theory",
        "keywords": [
          [
            "quantum",
            0.0255620311771539
          ],
          [
            "field",
            0.025299354496151463
          ],
          [
            "non",
            0.02446851318235099
          ],
          [
            "theory",
            0.02351999483447291
          ],
          [
            "black",
            0.021256099673141498
          ],
          [
            "gravity",
            0.02012357008428239
          ],
          [
            "energy",
            0.019956087173024734
          ],
          [
            "scalar",
            0.017822005236878078
          ],
          [
            "hole",
            0.01729487372719776
          ],
          [
            "black hole",
            0.01710096942608323
          ]
        ],
        "count": 193
      },
      "4": {
        "name": "4_vortex_superfluid_He_turbulence",
        "keywords": [
          [
            "vortex",
            0.0654556948050503
          ],
          [
            "superfluid",
            0.06153374485883335
          ],
          [
            "He",
            0.05628606581438666
          ],
          [
            "turbulence",
            0.040837505984879695
          ],
          [
            "fluid",
            0.03208958879748177
          ],
          [
            "vortices",
            0.030788843224574123
          ],
          [
            "quantum",
            0.02581002622076216
          ],
          [
            "velocity",
            0.024481375227937696
          ],
          [
            "helium",
            0.024259980329319062
          ],
          [
            "flow",
            0.020893909697481974
          ]
        ],
        "count": 159
      }
    },
    "correlations": [
      [
        1.0,
        -0.6475546785213407,
        -0.6371143862311355,
        -0.4164628434830414,
        -0.7118266323171041
      ],
      [
        -0.6475546785213407,
        1.0,
        -0.6155018952114744,
        -0.5762531697181722,
        -0.7283271438734392
      ],
      [
        -0.6371143862311355,
        -0.6155018952114744,
        1.0,
        -0.3088918493242784,
        -0.6876886758610966
      ],
      [
        -0.4164628434830414,
        -0.5762531697181722,
        -0.3088918493242784,
        1.0,
        -0.6784857913633703
      ],
      [
        -0.7118266323171041,
        -0.7283271438734392,
        -0.6876886758610966,
        -0.6784857913633703,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        13,
        6,
        6,
        9,
        1
      ],
      "2020-02": [
        6,
        6,
        8,
        4,
        8
      ],
      "2020-03": [
        21,
        6,
        7,
        7,
        10
      ],
      "2020-04": [
        14,
        5,
        11,
        10,
        4
      ],
      "2020-05": [
        28,
        9,
        10,
        10,
        11
      ],
      "2020-06": [
        14,
        12,
        8,
        8,
        5
      ],
      "2020-07": [
        28,
        11,
        9,
        5,
        3
      ],
      "2020-08": [
        19,
        8,
        5,
        8,
        1
      ],
      "2020-09": [
        21,
        8,
        10,
        12,
        4
      ],
      "2020-10": [
        15,
        8,
        11,
        6,
        5
      ],
      "2020-11": [
        17,
        4,
        11,
        8,
        10
      ],
      "2020-12": [
        18,
        10,
        17,
        8,
        7
      ],
      "2021-01": [
        16,
        9,
        6,
        5,
        4
      ],
      "2021-02": [
        17,
        4,
        7,
        4,
        1
      ],
      "2021-03": [
        27,
        6,
        12,
        7,
        4
      ],
      "2021-04": [
        28,
        8,
        16,
        10,
        2
      ],
      "2021-05": [
        28,
        4,
        14,
        12,
        5
      ],
      "2021-06": [
        11,
        5,
        9,
        9,
        5
      ],
      "2021-07": [
        35,
        7,
        14,
        8,
        5
      ],
      "2021-08": [
        22,
        5,
        12,
        10,
        4
      ],
      "2021-09": [
        18,
        12,
        12,
        10,
        4
      ],
      "2021-10": [
        27,
        6,
        7,
        12,
        3
      ],
      "2021-11": [
        30,
        10,
        6,
        13,
        1
      ],
      "2021-12": [
        22,
        9,
        14,
        8,
        2
      ],
      "2022-01": [
        25,
        5,
        8,
        5,
        5
      ],
      "2022-02": [
        24,
        8,
        8,
        5,
        3
      ],
      "2022-03": [
        30,
        9,
        9,
        10,
        5
      ],
      "2022-04": [
        22,
        5,
        8,
        7,
        7
      ],
      "2022-05": [
        26,
        10,
        12,
        7,
        4
      ],
      "2022-06": [
        25,
        7,
        12,
        8,
        2
      ],
      "2022-07": [
        19,
        11,
        9,
        8,
        3
      ],
      "2022-08": [
        24,
        8,
        4,
        8,
        4
      ],
      "2022-09": [
        20,
        5,
        12,
        5,
        3
      ],
      "2022-10": [
        20,
        8,
        12,
        9,
        3
      ],
      "2022-11": [
        14,
        10,
        11,
        12,
        6
      ],
      "2022-12": [
        16,
        8,
        7,
        3,
        7
      ],
      "2023-01": [
        23,
        2,
        11,
        7,
        4
      ],
      "2023-02": [
        17,
        6,
        8,
        6,
        3
      ],
      "2023-03": [
        24,
        6,
        13,
        5,
        6
      ],
      "2023-04": [
        25,
        9,
        10,
        7,
        3
      ],
      "2023-05": [
        15,
        6,
        12,
        3,
        6
      ],
      "2023-06": [
        20,
        5,
        10,
        11,
        2
      ],
      "2023-07": [
        11,
        11,
        12,
        12,
        1
      ],
      "2023-08": [
        10,
        7,
        8,
        4,
        2
      ],
      "2023-09": [
        19,
        5,
        13,
        3,
        5
      ],
      "2023-10": [
        21,
        5,
        13,
        12,
        7
      ],
      "2023-11": [
        23,
        13,
        9,
        8,
        1
      ],
      "2023-12": [
        13,
        6,
        2,
        12,
        6
      ],
      "2024-01": [
        21,
        13,
        10,
        3,
        2
      ],
      "2024-02": [
        13,
        4,
        13,
        4,
        3
      ],
      "2024-03": [
        20,
        11,
        18,
        8,
        6
      ],
      "2024-04": [
        17,
        8,
        10,
        5,
        1
      ],
      "2024-05": [
        18,
        10,
        12,
        13,
        1
      ],
      "2024-06": [
        18,
        12,
        11,
        6,
        3
      ],
      "2024-07": [
        25,
        7,
        11,
        3,
        4
      ],
      "2024-08": [
        9,
        5,
        13,
        3,
        1
      ],
      "2024-09": [
        12,
        9,
        15,
        6,
        3
      ],
      "2024-10": [
        27,
        11,
        21,
        1,
        6
      ],
      "2024-11": [
        17,
        11,
        15,
        6,
        4
      ],
      "2024-12": [
        20,
        11,
        12,
        11,
        3
      ],
      "2025-01": [
        22,
        9,
        13,
        4,
        4
      ],
      "2025-02": [
        22,
        5,
        14,
        5,
        4
      ],
      "2025-03": [
        28,
        13,
        19,
        6,
        2
      ],
      "2025-04": [
        26,
        9,
        10,
        7,
        2
      ],
      "2025-05": [
        25,
        15,
        15,
        9,
        3
      ],
      "2025-06": [
        30,
        12,
        13,
        7,
        2
      ],
      "2025-07": [
        31,
        13,
        18,
        9,
        6
      ],
      "2025-08": [
        40,
        10,
        14,
        11,
        3
      ],
      "2025-09": [
        24,
        8,
        5,
        4,
        1
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Electronic states and magnetic response of MnBi2Te4 by scanning tunneling microscopy and spectroscopy",
          "year": "2020-01",
          "abstract": "Exotic quantum phenomena have been demonstrated in recently discovered\nintrinsic magnetic topological insulator MnBi2Te4. At its two-dimensional\nlimit, quantum anomalous Hall (QAH) effect and axion insulator state are\nobserved in odd and even layers of MnBi2Te4, respectively. The measured band\nstructures exhibit intriguing and complex properties. Here we employ\nlow-temperature scanning tunneling microscopy to study its surface states and\nmagnetic response. The quasiparticle interference patterns indicate that the\nelectronic structures on the topmost layer of MnBi2Te4 is different from that\nof the expected out-of-plane A-type antiferromagnetic phase. The topological\nsurface states may be embedded in deeper layers beneath the topmost surface.\nSuch novel electronic structure presumably related to the modification of\ncrystalline structure during sample cleaving and re-orientation of magnetic\nmoment of Mn atoms near the surface. Mn dopants substituted at the Bi site on\nthe second atomic layer are observed. The ratio of Mn/Bi substitutions is 5%.\nThe electronic structures are fluctuating at atomic scale on the surface, which\ncan affect the magnetism of MnBi2Te4. Our findings shed new lights on the\nmagnetic property of MnBi2Te4 and thus the design of magnetic topological\ninsulators.",
          "arxiv_id": "2001.00462v1"
        },
        {
          "title": "Evidence of magnetoelastic coupling and magnetic phase coexistence in Mn$_{1.7}$Fe$_{1.3}$Si Heusler Alloy",
          "year": "2025-02",
          "abstract": "Noncollinear metallic antiferromagnets, with their rapid spin dynamics,\nefficient spin transport, and distinctive spin textures, play a pivotal role in\nadvancing the field of spintronics. In this study, we report a comprehensive\ninvestigation of the structural, magnetic, and transport properties of cubic\nMn$_{1.7}$Fe$_{1.3}$Si Heusler compound. Temperature-dependent magnetization\nmeasurement reveals a paramagnetic to ferromagnetic transition at $T_C$ = 85 K,\nfollowed by a spin reorientation transition. Neutron diffraction data, analyzed\nas a function of temperature, demonstrates that the occurrence of a\nspin-reorientation transition is accompanied by magnetoelastic coupling, as\nevidenced by a change in unit cell volume below $T_C$. Magnetic structure\nrefinement of the low-temperature neutron powder diffraction data confirms the\ncanted antiferromagnetic ordering below 55 K. The metallic nature of the sample\nis confirmed by the gradual decrease in the $\\rho$(T) with decreasing\ntemperature. At low temperatures, a field-induced metamgnetic transition is\nobserved in both, magnetization and magneto-transport measurements. The $H-T$\nphase diagram shows a phase-coexistence region emerging at low temperatures for\nH $<$ 2.5 T. These findings provide valuable insights into the magnetic and\ntransport behavior of the Heusler compounds, underscoring their potential for\nspintronic applications.",
          "arxiv_id": "2502.09910v1"
        },
        {
          "title": "Generation of third-harmonic spin oscillation from strong spin precession induced by terahertz magnetic near fields",
          "year": "2023-03",
          "abstract": "The ability to drive a spin system to state far from the equilibrium is\nindispensable for investigating spin structures of antiferromagnets and their\nfunctional nonlinearities for spintronics. While optical methods have been\nconsidered for spin excitation, terahertz (THz) pulses appear to be a more\nconvenient means of direct spin excitation without requiring coupling between\nspins and orbitals or phonons. However, room-temperature responses are usually\nlimited to small deviations from the equilibrium state because of the\nrelatively weak THz magnetic fields in common approaches. Here, we studied the\nmagnetization dynamics in a HoFeO3 crystal at room temperature. A custom-made\nspiral-shaped microstructure was used to locally generate a strong multicycle\nTHz magnetic near field perpendicular to the crystal surface; the maximum\nmagnetic field amplitude of about 2 T was achieved. The observed time-resolved\nchange in the Faraday ellipticity clearly showed second- and third-order\nharmonics of the magnetization oscillation and an asymmetric oscillation\nbehaviour. Not only the ferromagnetic vector M but also the antiferromagnetic\nvector L plays an important role in the nonlinear dynamics of spin systems far\nfrom equilibrium.",
          "arxiv_id": "2303.16016v1"
        }
      ],
      "1": [
        {
          "title": "Non-Hermitian Chiral Skin Effect",
          "year": "2023-04",
          "abstract": "The interplay between non-Hermitian effects and topological insulators has\nbecome a frontier of research in non-Hermitian physics. However, the existence\nof a non-Hermitian skin effect for topological-protected edge states remains\ncontroversial. In this paper, we discover an alternative form of the\nnon-Hermitian skin effect called the non-Hermitian chiral skin effect (NHCSE).\nNHCSE is a non-Hermitian skin effect under periodic boundary condition rather\nthan open boundary condition. Specifically, the chiral modes of the NHCSE\nlocalize around \\textquotedblleft topological defects\\textquotedblright\ncharacterized by global dissipation rather than being confined to the system\nboundaries. We show its detailed physical properties by taking the\nnon-Hermitian Haldane model as an example. As a result, the intrinsic mechanism\nof the hybrid skin-topological effect in Chern insulators is fully understood\nvia NHCSE. Therefore, this progress will be helpful for solving the\ncontroversial topic of hybrid skin-topological effect and thus benefit the\nresearch on both non-Hermitian physics and topological quantum states.",
          "arxiv_id": "2304.01422v2"
        },
        {
          "title": "Hybrid skin-topological modes without asymmetric couplings",
          "year": "2022-03",
          "abstract": "Non-Hermitian skin effect (NHSE) in non-Hermitian lattice systems, associated\nwith a point gap on the complex energy plane, has attracted great theoretical\nand experimental interest. Much less is studied on the so-called second-order\nnon-Hermitian skin effect, where the bulk does not support a point gap but\nlocalization at the corner still occurs. This work discovers a class of hybrid\nskin-topological modes as the second-order non-Hermitian skin effect without\nasymmetric couplings. Specifically, by only adding gain/loss to two-dimensional\nChern insulators and so long as the gain/loss strength does not close the line\ngap, all the topological edge states are localized at one corner under the open\nboundary condition, with the bulk states extended. The resultant non-Hermitian\nChern bands can be still topologically characterized by Chern numbers, whereas\nthe hybrid skin-topological modes are understood via some auxiliary Hermitian\nsystems that belong to either intrinsic or extrinsic second-order topological\ninsulator phases. By proposing an innovative construction of auxiliary\nHamiltonian, our generic route to hybrid skin-topological modes is further\nsuccessfully extended to nonequilibrium topological systems with gain and loss,\nwhere the anomalous Floquet band topology is no longer captured by band Chern\nnumbers. The extension thus leads to the intriguing finding of nonequilibrium\nhybrid skin-topological modes. In addition to offering a straightforward route\nto experimental realization of hybrid topological-skin effects, this study also\nopens up a promising perspective for the understanding of corner localization\nby revealing the synergy of three important concepts, namely, non-Hermitian\ntopological insulator, second-order non-Hermitian skin effect, and second-order\ntopological insulator.",
          "arxiv_id": "2203.03284v1"
        },
        {
          "title": "Exact Solutions Disentangle Higher-Order Topology in 2D Non-Hermitian Lattices",
          "year": "2024-10",
          "abstract": "We report the exact closed-form solutions for higher-order topological states\nas well as explicit energy-spectrum relationships in two-dimensional (2D)\nnon-Hermitian multi-orbital lattices with generalized boundary conditions.\nThese analytical solutions unequivocally confirm that topological edge states\nin a 2D non-Hermitian system which feature point-gap topology must undergo the\nnon-Hermitian skin effect along the edge. Under double open boundary\nconditions, the occurrence of the non-Hermitian skin effect for either\ntopological edge states or bulk states can be accurately predicted by our\nproposed winding numbers. We unveil that the zero-energy topological corner\nstate only manifests itself on a corner where two nearby gapped edge states\nintersect, and thus can either disappear completely or strengthen drastically\ndue to the non-Hermitian skin effect of gapped topological edge states. Our\nanalytical results offer direct insight into the non-Bloch band topology in two\nor higher dimensions and trigger experimental investigations into related\nphenomena such as quadrupole topological insulators and topological lasing.",
          "arxiv_id": "2410.15763v1"
        }
      ],
      "2": [
        {
          "title": "Variational dynamics as a ground-state problem on a quantum computer",
          "year": "2022-04",
          "abstract": "We propose a variational quantum algorithm to study the real time dynamics of\nquantum systems as a ground-state problem. The method is based on the original\nproposal of Feynman and Kitaev to encode time into a register of auxiliary\nqubits. We prepare the Feynman-Kitaev Hamiltonian acting on the composed system\nas a qubit operator and find an approximate ground state using the Variational\nQuantum Eigensolver. We apply the algorithm to the study of the dynamics of a\ntransverse field Ising chain with an increasing number of spins and time steps,\nproving a favorable scaling in terms of the number of two qubit gates. Through\nnumerical experiments, we investigate its robustness against noise, showing\nthat the method can be use to evaluate dynamical properties of quantum systems\nand detect the presence of dynamical quantum phase transitions by measuring\nLoschmidt echoes.",
          "arxiv_id": "2204.03454v2"
        },
        {
          "title": "Quantum algorithms for quantum chemistry and quantum materials science",
          "year": "2020-01",
          "abstract": "As we begin to reach the limits of classical computing, quantum computing has\nemerged as a technology that has captured the imagination of the scientific\nworld. While for many years, the ability to execute quantum algorithms was only\na theoretical possibility, recent advances in hardware mean that quantum\ncomputing devices now exist that can carry out quantum computation on a limited\nscale. Thus it is now a real possibility, and of central importance at this\ntime, to assess the potential impact of quantum computers on real problems of\ninterest. One of the earliest and most compelling applications for quantum\ncomputers is Feynman's idea of simulating quantum systems with many degrees of\nfreedom. Such systems are found across chemistry, physics, and materials\nscience. The particular way in which quantum computing extends classical\ncomputing means that one cannot expect arbitrary simulations to be sped up by a\nquantum computer, thus one must carefully identify areas where quantum\nadvantage may be achieved. In this review, we briefly describe central problems\nin chemistry and materials science, in areas of electronic structure, quantum\nstatistical mechanics, and quantum dynamics, that are of potential interest for\nsolution on a quantum computer. We then take a detailed snapshot of current\nprogress in quantum algorithms for ground-state, dynamics, and thermal state\nsimulation, and analyze their strengths and weaknesses for future developments.",
          "arxiv_id": "2001.03685v2"
        },
        {
          "title": "Quantum-Centric Algorithm for Sample-Based Krylov Diagonalization",
          "year": "2025-01",
          "abstract": "Approximating the ground state of many-body systems is a key computational\nbottleneck underlying important applications in physics and chemistry. It has\nlong been viewed as a promising application for quantum computers. The most\nwidely known quantum algorithm for ground state approximation, quantum phase\nestimation, is out of reach of current quantum processors due to its high\ncircuit-depths. Quantum diagonalization algorithms based on subspaces represent\nalternatives to phase estimation, which are feasible for pre-fault-tolerant and\nearly-fault-tolerant quantum computers. Here, we introduce a quantum\ndiagonalization algorithm which combines two key ideas on quantum subspaces: a\nclassical diagonalization based on quantum samples, and subspaces constructed\nwith quantum Krylov states. We prove that our algorithm converges in polynomial\ntime under the working assumptions of Krylov quantum diagonalization and\nsparseness of the ground state. We then show numerical investigations of\nlattice Hamiltonians, which indicate that our method can outperform existing\nKrylov quantum diagonalization in the presence of shot noise, making our\napproach well-suited for near-term quantum devices. Finally, we carry out the\nlargest ground-state quantum simulation of the single-impurity Anderson model\non a system with $41$ bath sites, using $85$ qubits and up to $6 \\cdot 10^3$\ntwo-qubit gates on a Heron quantum processor, showing excellent agreement with\ndensity matrix renormalization group calculations.",
          "arxiv_id": "2501.09702v2"
        }
      ],
      "3": [
        {
          "title": "Analog Sommerfeld law in quantum vacuum",
          "year": "2023-07",
          "abstract": "The activation temperature $T$ in the de Sitter environment is twice larger\nthan the Gibbons-Hawking temperature, related to the cosmological horizon. We\nconsider the activation temperature as the local temperature of the de Sitter\nvacuum, and construct the local thermodynamics of the de Sitter state. This\nthermodynamics includes also the gravitational coupling $K$ and the scalar\nRiemann curvature ${\\cal R}$ as the thermodynamically conjugate variables.\nThese variables modify the thermodynamics of the Gibbs-Duhem relation in the de\nSitter state. The free energy density is proportional to $-T^2$, which is\nsimilar to that in the non-relativistic Fermi liquids and in relativistic\nmatter with equation of state $w=1$. The local entropy is proportional to the\nlocal temperature, while the total entropy inside the cosmological horizon is\n$A/4G$, where $A$ is the area of the horizon. This entropy is usually\ninterpreted as the entropy of the cosmological horizon. We also consider the\npossible application of the de Sitter thermodynamics to the Schwarzschild-de\nSitter black hole and to black and white holes with the de Sitter cores.",
          "arxiv_id": "2307.00860v4"
        },
        {
          "title": "Thermodynamics and decay of de Sitter vacuum",
          "year": "2023-12",
          "abstract": "We discuss the consequences of unique symmetry of de Sitter spacetime, which\nis invariant under the modified translations, ${\\bf r}\\rightarrow {\\bf r}\n-e^{Ht}{\\bf a}$, where $H$ is the Hubble parameter. Due to this symmetry, all\nthe comoving observers at any point of the de Sitter space perceive the de\nSitter environment as the thermal bath with temperature $T=H/\\pi$, which is\ntwice larger than the Gibbons-Hawking temperature of the cosmological horizon.\nThis leads to the heat exchange between gravity and matter, and to instability\nof de Sitter state towards the creation of matter, its further heating, and\nfinally to the decay of the de Sitter state. The temperature $T=H/\\pi$\ndetermines different processes in the de Sitter environment, which are not\npossible in Minkowski vacuum, such as the process of ionization of an atom.\nThis temperature also determines the local entropy of the de Sitter vacuum\nstate, and this allows us to calculate the total entropy inside the\ncosmological horizon. The result reproduces the Gibbons-Hawking area law, which\nis related to the cosmological horizon, $S_{\\rm hor}=4\\pi KA$, where\n$K=1/(16\\pi G)$. This supports the holographic properties of the cosmological\nevent horizon. We extend the consideration of the local thermodynamics of the\nde Sitter state using the $f({\\cal R})$ gravity. In this thermodynamics, the\nRicci scalar curvature ${\\cal R}$ and the effective gravitational coupling $K$\nare thermodynamically conjugate variables. The holographic connection between\nthe bulk entropy of the Hubble volume and the surface entropy of the\ncosmological horizon remains the same. Such connection takes place only in the\n$3+1$ spacetime, where there is the special symmetry due to which the variables\n$K$ and ${\\cal R}$ have the same dimensionality. We also consider the lessons\nfrom the de Sitter symmetry for the thermodynamics of black and white holes.",
          "arxiv_id": "2312.02292v16"
        },
        {
          "title": "Double Hawking temperature in de Sitter Universe and cosmological constant problem",
          "year": "2020-07",
          "abstract": "As distinct from the black hole physics, the de Sitter thermodynamics is not\ndetermined by the cosmological horizon, the effective temperature differs from\nthe Hawking temperature. In particular, the atom in the de Sitter universe\nexperiences thermal activation corresponding to the local temperature, which is\ntwice larger than the Hawking temperature, $T_{\\rm loc}=2T_{\\rm Hawking}$. The\nsame double Hawking temperature describes the decay of massive scalar field in\nthe de Sitter universe. The reason, why the local temperature is exactly twice\nthe Hawking temperature, follows from the geometry of the de Sitter spacetime.\nThe weakening of the role of the cosmological horizon in de Sitter universe is\nconfirmed by considering Hawking radiation. We discuss the difference between\nthe radiation of particles in the de Sitter spacetime and the Schwinger pair\ncreation in the electric field. We use the stationary Painleve-Gullstrand\nmetric for the de Sitter spacetime, where the particles are created by Hawking\nradiation from the cosmological horizon, and time independent gauge for the\nelectric field. In these stationary frames the Hamiltonians and the energy\nspectra of massive particles look rather similar. However, the final results\nare essentially different. In case of Schwinger pair production the number\ndensity of the created pairs grows with time, while in the de Sitter vacuum the\nnumber density of the created pairs is finite. The latter suggests that Hawking\nradiation from the cosmological horizon does not lead to instability of the de\nSitter vacuum. The other mechanisms of instability are required for the\ndynamical solution of the cosmological constant problem. We consider the\npossible role of the local temperature $T_{\\rm loc}=2T_{\\rm H}$ in the decay of\nthe de Sitter space-time due to the energy exchange between the vacuum energy\nand relativistic matter with this temperature.",
          "arxiv_id": "2007.05988v7"
        }
      ],
      "4": [
        {
          "title": "Imaging the decay of quantized vortex rings to decipher quantum dissipation",
          "year": "2022-11",
          "abstract": "Like many quantum fluids, superfluid helium-4 (He II) can be considered as a\nmixture of two miscible fluid components: an inviscid superfluid and a viscous\nnormal fluid consisting of thermal quasiparticles [1]. A mutual friction\nbetween the two fluids can emerge due to quasiparticles scattering off\nquantized vortex lines in the superfluid [2]. This quantum dissipation\nmechanism is the key for understanding various fascinating behaviors of the\ntwo-fluid system [3,4]. However, due to the lack of experimental data for\nguidance, modeling the mutual friction between individual vortices and the\nnormal fluid remains an unsettled topic despite decades of research [5-10].\nHere we report an experiment where we visualize the motion of quantized vortex\nrings in He II by decorating them with solidified deuterium tracer particles.\nBy examining how the rings spontaneously shrink and accelerate, we provide\nunequivocal evidences showing that only a recent theory [9] which accounts for\nthe coupled motion of the two fluids with a self-consistent local friction can\nreproduce the observed ring dynamics. Our work eliminates long-standing\nambiguities in our theoretical description of the vortex dynamics in He II,\nwhich will have a far-reaching impact since similar mutual friction concept has\nbeen adopted for a wide variety of quantum two-fluid systems, including atomic\nBose-Einstein condensates (BECs) [11,12], superfluid neutron stars [13-15], and\ngravity-mapped holographic superfluid [16,17].",
          "arxiv_id": "2211.01560v1"
        },
        {
          "title": "Sound emission and annihilations in a programmable quantum vortex collider",
          "year": "2021-05",
          "abstract": "In quantum fluids, the quantisation of circulation forbids the diffusion of a\nvortex swirling flow seen in classical viscous fluids. Yet, a quantum vortex\naccelerating in a superfluid may lose its energy into acoustic radiation, in a\nsimilar way an electric charge decelerates upon emitting photons. The\ndissipation of vortex energy underlies central problems in quantum\nhydrodynamics, such as the decay of quantum turbulence, highly relevant to\nsystems as varied as neutron stars, superfluid helium and atomic condensates. A\ndeep understanding of the elementary mechanisms behind irreversible vortex\ndynamics has been a goal for decades, but it is complicated by the shortage of\nconclusive experimental signatures. Here, we address this challenge by\nrealising a programmable quantum vortex collider in a planar, homogeneous\natomic Fermi superfluid with tunable inter-particle interactions. We create\non-demand vortex configurations and monitor their evolution, taking advantage\nof the accessible time and length scales of our ultracold Fermi gas.\nEngineering collisions within and between vortex-antivortex pairs allows us to\ndecouple relaxation of the vortex energy due to sound emission and interactions\nwith normal fluid, i.e. mutual friction. We directly visualise how the\nannihilation of vortex dipoles radiates a sound pulse in the superfluid.\nFurther, our few-vortex experiments extending across different superfluid\nregimes suggest that fermionic quasiparticles localised inside the vortex core\ncontribute significantly to dissipation, opening the route to exploring new\npathways for quantum turbulence decay, vortex by vortex.",
          "arxiv_id": "2105.15180v2"
        },
        {
          "title": "Bathtub vortex in superfluid $^4$He",
          "year": "2020-10",
          "abstract": "We have investigated the structure of macroscopic suction flows in superfluid\n$^4$He. In this study, we primarily analyze the structure of the quantized\nvortex bundle that appears to play an important role in such systems. Our study\nis motivated by a series of recent experiments conducted by a research group in\nOsaka City University [Yano $\\textit{et. al.}$, J. Phys. Conf. Ser.\n$\\textbf{969}$, 012002 (2018)]; they created a suction vortex using a rotor in\nsuperfluid $^4$He. They also reported that up to $10^4$ quantized vortices\naccumulated in the central region of the rotating flow. The quantized vortices\nin such macroscopic flows are assumed to form a bundle structure; however, the\nmechanism has not yet been fully investigated. Therefore, we prescribe a\nmacroscopic suction flow to the normal fluid and discuss the evolution of a\ngiant vortex ($\\textit{i.e.}$, one with a circulation quantum number exceeding\nunity) and a bundle of singly quantized vortices from a small number of seed\nvortices. Then, using numerical simulations, we discuss several possible\ncharacteristic structures of the bundle in such a flow, and we suggest that the\nactual steady-state bundle structure in the experiment can be verified by\nmeasuring the diffusion constant of the vortex bundle after the macroscopic\nnormal flow has been switched off. By applying extensive knowledge of the\nsuperfluid $^4$He system, we elucidate a new type of macroscopic superfluid\nflow and identify a novel structure of quantized vortices.",
          "arxiv_id": "2010.13398v2"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T21:14:01Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}