{
  "topics": {
    "data": {
      "0": {
        "name": "0_computer_Turing_research_AI",
        "keywords": [
          [
            "computer",
            0.053728341449812096
          ],
          [
            "Turing",
            0.04809352239366963
          ],
          [
            "research",
            0.04537258727374473
          ],
          [
            "AI",
            0.03394245286231851
          ],
          [
            "science",
            0.030879654006204786
          ],
          [
            "machine",
            0.030759883600848786
          ],
          [
            "learning",
            0.030454676854069003
          ],
          [
            "human",
            0.029802548647673545
          ],
          [
            "work",
            0.027963530546226172
          ],
          [
            "paper",
            0.027933233212557782
          ]
        ],
        "count": 30
      },
      "1": {
        "name": "1_data_software_research_Data",
        "keywords": [
          [
            "data",
            0.11019334113383697
          ],
          [
            "software",
            0.0817825998264039
          ],
          [
            "research",
            0.06550641873921437
          ],
          [
            "Data",
            0.06143867628817568
          ],
          [
            "systems",
            0.05056633419280445
          ],
          [
            "science",
            0.04882826346425939
          ],
          [
            "Science",
            0.0445648272075221
          ],
          [
            "review",
            0.036173570615547074
          ],
          [
            "Research",
            0.029988698233230526
          ],
          [
            "field",
            0.026222326693157775
          ]
        ],
        "count": 19
      }
    },
    "correlations": [
      [
        1.0,
        -0.29523498514744784
      ],
      [
        -0.29523498514744784,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        1,
        0
      ],
      "2020-03": [
        0,
        1
      ],
      "2020-04": [
        2,
        2
      ],
      "2020-06": [
        1,
        0
      ],
      "2020-07": [
        2,
        0
      ],
      "2020-08": [
        0,
        1
      ],
      "2020-10": [
        2,
        1
      ],
      "2020-12": [
        1,
        0
      ],
      "2021-01": [
        1,
        0
      ],
      "2021-03": [
        0,
        1
      ],
      "2021-04": [
        3,
        0
      ],
      "2021-05": [
        1,
        0
      ],
      "2021-07": [
        3,
        1
      ],
      "2021-08": [
        1,
        0
      ],
      "2021-09": [
        2,
        0
      ],
      "2021-11": [
        0,
        1
      ],
      "2021-12": [
        1,
        0
      ],
      "2022-01": [
        0,
        3
      ],
      "2022-02": [
        0,
        1
      ],
      "2022-03": [
        0,
        1
      ],
      "2022-04": [
        4,
        1
      ],
      "2022-05": [
        2,
        1
      ],
      "2022-06": [
        4,
        0
      ],
      "2022-07": [
        2,
        2
      ],
      "2022-08": [
        2,
        0
      ],
      "2022-09": [
        2,
        4
      ],
      "2022-10": [
        1,
        2
      ],
      "2022-11": [
        0,
        1
      ],
      "2022-12": [
        1,
        1
      ],
      "2023-01": [
        2,
        0
      ],
      "2023-02": [
        1,
        0
      ],
      "2023-03": [
        2,
        0
      ],
      "2023-07": [
        0,
        1
      ],
      "2023-09": [
        2,
        0
      ],
      "2023-11": [
        0,
        2
      ],
      "2024-02": [
        2,
        0
      ],
      "2024-03": [
        1,
        1
      ],
      "2024-07": [
        1,
        0
      ],
      "2025-01": [
        1,
        0
      ],
      "2025-02": [
        1,
        0
      ],
      "2025-04": [
        0,
        1
      ],
      "2025-08": [
        0,
        1
      ],
      "2025-09": [
        1,
        0
      ]
    },
    "papers": {
      "0": [
        {
          "title": "A guideline for the methodology chapter in computer science dissertations",
          "year": "2024-03",
          "abstract": "Rather than simply offering suggestions, this guideline for the methodology\nchapter in computer science dissertations provides thorough insights on how to\ndevelop a strong research methodology within the area of computer science. The\nmethod is structured into several parts starting with an overview of research\nstrategies which include experiments, surveys, interviews and case studies. The\nguide highlights the significance of defining a research philosophy and\nreasoning by talking about paradigms such as positivism, constructivism and\npragmatism. Besides, it reveals the importance of types of research including\ndeductive and inductive methodologies; basic versus applied research\napproaches. Moreover, this guideline discusses data collection and analysis\nintricacies that divide data into quantitative and qualitative typologies. It\nexplains different ways in which data can be collected from observation to\nexperimentation, interviews or surveys. It also mentions ethical considerations\nin research emphasizing ethical behavior like following academic principles. In\ngeneral, this guideline is an essential tool for undertaking computer science\ndissertations that help researchers structure their work while maintaining\nethical standards in their study design.",
          "arxiv_id": "2405.00040v1"
        },
        {
          "title": "What Kind of Person Wins the Turing Award?",
          "year": "2021-04",
          "abstract": "Computer science has grown rapidly since its inception in the 1950s and the\npioneers in the field are celebrated annually by the A.M. Turing Award. In this\npaper, we attempt to shed light on the path to influential computer scientists\nby examining the characteristics of the 72 Turing Award laureates. To achieve\nthis goal, we build a comprehensive dataset of the Turing Award laureates and\nanalyze their characteristics, including their personal information, family\nbackground, academic background, and industry experience. The FP-Growth\nalgorithm is used for frequent feature mining. Logistic regression plot, pie\nchart, word cloud and map are generated accordingly for each of the interesting\nfeatures to uncover insights regarding personal factors that drive influential\nwork in the field of computer science. In particular, we show that the Turing\nAward laureates are most commonly white, male, married, United States citizen,\nand received a PhD degree. Our results also show that the age at which the\nlaureate won the award increases over the years; most of the Turing Award\nlaureates did not major in computer science; birth order is strongly related to\nthe winners' success; and the number of citations is not as important as one\nwould expect.",
          "arxiv_id": "2104.05636v1"
        },
        {
          "title": "History of generative Artificial Intelligence (AI) chatbots: past, present, and future development",
          "year": "2024-02",
          "abstract": "This research provides an in-depth comprehensive review of the progress of\nchatbot technology over time, from the initial basic systems relying on rules\nto today's advanced conversational bots powered by artificial intelligence.\nSpanning many decades, the paper explores the major milestones, innovations,\nand paradigm shifts that have driven the evolution of chatbots. Looking back at\nthe very basic statistical model in 1906 via the early chatbots, such as ELIZA\nand ALICE in the 1960s and 1970s, the study traces key innovations leading to\ntoday's advanced conversational agents, such as ChatGPT and Google Bard. The\nstudy synthesizes insights from academic literature and industry sources to\nhighlight crucial milestones, including the introduction of Turing tests,\ninfluential projects such as CALO, and recent transformer-based models. Tracing\nthe path forward, the paper highlights how natural language processing and\nmachine learning have been integrated into modern chatbots for more\nsophisticated capabilities. This chronological survey of the chatbot landscape\nprovides a holistic reference to understand the technological and historical\nfactors propelling conversational AI. By synthesizing learnings from this\nhistorical analysis, the research offers important context about the\ndevelopmental trajectory of chatbots and their immense future potential across\nvarious field of application which could be the potential take ways for the\nrespective research community and stakeholders.",
          "arxiv_id": "2402.05122v1"
        }
      ],
      "1": [
        {
          "title": "An Environment for Sustainable Research Software in Germany and Beyond: Current State, Open Challenges, and Call for Action",
          "year": "2020-04",
          "abstract": "Research software has become a central asset in academic research. It\noptimizes existing and enables new research methods, implements and embeds\nresearch knowledge, and constitutes an essential research product in itself.\nResearch software must be sustainable in order to understand, replicate,\nreproduce, and build upon existing research or conduct new research\neffectively. In other words, software must be available, discoverable, usable,\nand adaptable to new needs, both now and in the future. Research software\ntherefore requires an environment that supports sustainability. Hence, a change\nis needed in the way research software development and maintenance are\ncurrently motivated, incentivized, funded, structurally and infrastructurally\nsupported, and legally treated. Failing to do so will threaten the quality and\nvalidity of research. In this paper, we identify challenges for research\nsoftware sustainability in Germany and beyond, in terms of motivation,\nselection, research software engineering personnel, funding, infrastructure,\nand legal aspects. Besides researchers, we specifically address political and\nacademic decision-makers to increase awareness of the importance and needs of\nsustainable research software practices. In particular, we recommend strategies\nand measures to create an environment for sustainable research software, with\nthe ultimate goal to ensure that software-driven research is valid,\nreproducible and sustainable, and that software is recognized as a first class\ncitizen in research. This paper is the outcome of two workshops run in Germany\nin 2019, at deRSE19 - the first International Conference of Research Software\nEngineers in Germany - and a dedicated DFG-supported follow-up workshop in\nBerlin.",
          "arxiv_id": "2005.01469v2"
        },
        {
          "title": "Advancing Data Justice Research and Practice: An Integrated Literature Review",
          "year": "2022-04",
          "abstract": "The Advancing Data Justice Research and Practice (ADJRP) project aims to\nwiden the lens of current thinking around data justice and to provide\nactionable resources that will help policymakers, practitioners, and impacted\ncommunities gain a broader understanding of what equitable, freedom-promoting,\nand rights-sustaining data collection, governance, and use should look like in\nincreasingly dynamic and global data innovation ecosystems. In this integrated\nliterature review we hope to lay the conceptual groundwork needed to support\nthis aspiration. The introduction motivates the broadening of data justice that\nis undertaken by the literature review which follows. First, we address how\ncertain limitations of the current study of data justice drive the need for a\nre-location of data justice research and practice. We map out the strengths and\nshortcomings of the contemporary state of the art and then elaborate on the\nchallenges faced by our own effort to broaden the data justice perspective in\nthe decolonial context. The body of the literature review covers seven thematic\nareas. For each theme, the ADJRP team has systematically collected and analysed\nkey texts in order to tell the critical empirical story of how existing social\nstructures and power dynamics present challenges to data justice and related\njustice fields. In each case, this critical empirical story is also\nsupplemented by the transformational story of how activists, policymakers, and\nacademics are challenging longstanding structures of inequity to advance social\njustice in data innovation ecosystems and adjacent areas of technological\npractice.",
          "arxiv_id": "2204.03090v1"
        },
        {
          "title": "Data Science from 1963 to 2012",
          "year": "2023-11",
          "abstract": "Consensus on the definition of data science remains low despite the\nwidespread establishment of academic programs in the field and continued demand\nfor data scientists in industry. Definitions range from rebranded statistics to\ndata-driven science to the science of data to simply the application of machine\nlearning to so-called big data to solve real-world problems. Current efforts to\ntrace the history of the field in order to clarify its definition, such as\nDonoho's \"50 Years of Data Science\" (Donoho 2017), tend to focus on a short\nperiod when a small group of statisticians adopted the term in an unsuccessful\nattempt to rebrand their field in the face of the overshadowing effects of\ncomputational statistics and data mining. Using textual evidence from primary\nsources, this essay traces the history of the term to the 1960s, when it was\nfirst used by the US Air Force in a surprisingly similar way to its current\nusage, to 2012, the year that Harvard Business Review published the enormously\ninfluential article \"Data Scientist: The Sexiest Job of the 21st Century\"\n(Davenport and Patil 2012) and the American Statistical Association\nacknowledged a profound disconnect between statistics and data science\n(Rodriguez 2012). Among the themes that emerge from this review are (1) the\nlong-standing opposition between data analysts and data miners that continues\nto animate the field, (2) an established definition of the term as the practice\nof managing and processing scientific data that has been occluded by recent\nusage, and (3) the phenomenon of data impedance -- the disproportion between\nsurplus data, indexed by phrases like data deluge and big data, and the\nlimitations of computational machinery and methods to process them. This\npersistent condition appears to have motivated the use of the term and the\nfield itself since its beginnings.",
          "arxiv_id": "2311.03292v4"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T21:41:25Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}