{
  "topics": {
    "data": {
      "0": {
        "name": "0_network_data_In_networks",
        "keywords": [
          [
            "network",
            0.04291576161197229
          ],
          [
            "data",
            0.030088809392292
          ],
          [
            "In",
            0.027410582307461823
          ],
          [
            "networks",
            0.026811505921001438
          ],
          [
            "performance",
            0.02316803205508507
          ],
          [
            "paper",
            0.022390624034431313
          ],
          [
            "time",
            0.020444225424045392
          ],
          [
            "communication",
            0.020267634864843998
          ],
          [
            "model",
            0.018642033079386392
          ],
          [
            "learning",
            0.01816381029011123
          ]
        ],
        "count": 11938
      },
      "1": {
        "name": "1_quantum_Quantum_entanglement_network",
        "keywords": [
          [
            "quantum",
            0.16435165082747225
          ],
          [
            "Quantum",
            0.059020885212499166
          ],
          [
            "entanglement",
            0.05578281373686896
          ],
          [
            "network",
            0.03585198851857576
          ],
          [
            "networks",
            0.03250155300923373
          ],
          [
            "quantum networks",
            0.026547660641879665
          ],
          [
            "QKD",
            0.0251536727404448
          ],
          [
            "classical",
            0.022054459783286295
          ],
          [
            "communication",
            0.020616966577032964
          ],
          [
            "distribution",
            0.020543043929963537
          ]
        ],
        "count": 311
      }
    },
    "correlations": [
      [
        1.0,
        -0.4668518147265247
      ],
      [
        -0.4668518147265247,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        155,
        1
      ],
      "2020-02": [
        177,
        1
      ],
      "2020-03": [
        161,
        6
      ],
      "2020-04": [
        198,
        1
      ],
      "2020-05": [
        176,
        2
      ],
      "2020-06": [
        174,
        1
      ],
      "2020-07": [
        181,
        3
      ],
      "2020-08": [
        167,
        0
      ],
      "2020-09": [
        133,
        1
      ],
      "2020-10": [
        168,
        3
      ],
      "2020-11": [
        148,
        1
      ],
      "2020-12": [
        165,
        6
      ],
      "2021-01": [
        184,
        1
      ],
      "2021-02": [
        172,
        0
      ],
      "2021-03": [
        147,
        0
      ],
      "2021-04": [
        169,
        1
      ],
      "2021-05": [
        195,
        5
      ],
      "2021-06": [
        164,
        3
      ],
      "2021-07": [
        144,
        1
      ],
      "2021-08": [
        138,
        1
      ],
      "2021-09": [
        169,
        2
      ],
      "2021-10": [
        159,
        2
      ],
      "2021-11": [
        152,
        7
      ],
      "2021-12": [
        148,
        8
      ],
      "2022-01": [
        211,
        1
      ],
      "2022-02": [
        161,
        2
      ],
      "2022-03": [
        161,
        2
      ],
      "2022-04": [
        142,
        4
      ],
      "2022-05": [
        176,
        10
      ],
      "2022-06": [
        115,
        1
      ],
      "2022-07": [
        136,
        5
      ],
      "2022-08": [
        153,
        1
      ],
      "2022-09": [
        167,
        3
      ],
      "2022-10": [
        159,
        4
      ],
      "2022-11": [
        173,
        4
      ],
      "2022-12": [
        139,
        6
      ],
      "2023-01": [
        154,
        5
      ],
      "2023-02": [
        137,
        0
      ],
      "2023-03": [
        152,
        3
      ],
      "2023-04": [
        140,
        6
      ],
      "2023-05": [
        163,
        11
      ],
      "2023-06": [
        156,
        8
      ],
      "2023-07": [
        173,
        7
      ],
      "2023-08": [
        161,
        7
      ],
      "2023-09": [
        181,
        1
      ],
      "2023-10": [
        187,
        5
      ],
      "2023-11": [
        165,
        5
      ],
      "2023-12": [
        200,
        7
      ],
      "2024-01": [
        204,
        8
      ],
      "2024-02": [
        213,
        6
      ],
      "2024-03": [
        194,
        2
      ],
      "2024-04": [
        196,
        7
      ],
      "2024-05": [
        215,
        15
      ],
      "2024-06": [
        161,
        6
      ],
      "2024-07": [
        204,
        13
      ],
      "2024-08": [
        166,
        8
      ],
      "2024-09": [
        169,
        10
      ],
      "2024-10": [
        199,
        9
      ],
      "2024-11": [
        192,
        5
      ],
      "2024-12": [
        185,
        6
      ],
      "2025-01": [
        237,
        11
      ],
      "2025-02": [
        192,
        7
      ],
      "2025-03": [
        201,
        6
      ],
      "2025-04": [
        177,
        8
      ],
      "2025-05": [
        215,
        10
      ],
      "2025-06": [
        184,
        6
      ],
      "2025-07": [
        236,
        8
      ],
      "2025-08": [
        249,
        9
      ],
      "2025-09": [
        120,
        9
      ]
    },
    "papers": {
      "0": [
        {
          "title": "A Deep Reinforcement Learning based Scheduler for IoT Devices in Co-existence with 5G-NR",
          "year": "2025-01",
          "abstract": "Co-existence of 5G New Radio (5G-NR) with IoT devices is considered as a\npromising technique to enhance the spectral usage and efficiency of future\ncellular networks. In this paper, a unified framework has been proposed for\nallocating in-band resource blocks (RBs), i.e., within a multi-cell network, to\n5G-NR users in co-existence with NB-IoT and LTE-M devices. First, a benchmark\n(upper-bound) scheduler has been designed for joint sub-carrier (SC) and\nmodulation and coding scheme (MCS) allocation that maximizes instantaneous\nthroughput and fairness among users/devices, while considering synchronous RB\nallocation in the neighboring cells. A series of numerical simulations with\nrealistic ICI in an urban scenario have been used to compute benchmark\nupper-bound solutions for characterizing performance in terms of throughput,\nfairness, and delay. Next, an edge learning based multi-agent deep\nreinforcement learning (DRL) framework has been developed for different DRL\nalgorithms, specifically, a policy-based gradient network (PGN), a deep\nQ-learning based network (DQN), and an actor-critic based deep deterministic\npolicy gradient network (DDPGN). The proposed DRL framework depends on\ninterference allocation, where the actions are based on inter-cell-interference\n(ICI) instead of power, which can bypass the need for raw data sharing and/or\ninter-agent communication. The numerical results reveal that the interference\nallocation based DRL schedulers can significantly outperform their\ncounterparts, where the actions are based on power allocation. Further, the\nperformance of the proposed policy-based edge learning algorithms is close to\nthe centralized ones.",
          "arxiv_id": "2501.11574v1"
        },
        {
          "title": "An Efficient Internet Traffic Classification System Using Deep Learning for IoT",
          "year": "2021-07",
          "abstract": "Internet of Things (IoT) defines a network of devices connected to the\ninternet and sharing a massive amount of data between each other and a central\nlocation. These IoT devices are connected to a network therefore prone to\nattacks. Various management tasks and network operations such as security,\nintrusion detection, Quality-of-Service provisioning, performance monitoring,\nresource provisioning, and traffic engineering require traffic classification.\nDue to the ineffectiveness of traditional classification schemes, such as\nport-based and payload-based methods, researchers proposed machine\nlearning-based traffic classification systems based on shallow neural networks.\nFurthermore, machine learning-based models incline to misclassify internet\ntraffic due to improper feature selection. In this research, an efficient\nmultilayer deep learning based classification system is presented to overcome\nthese challenges that can classify internet traffic. To examine the performance\nof the proposed technique, Moore-dataset is used for training the classifier.\nThe proposed scheme takes the pre-processed data and extracts the flow features\nusing a deep neural network (DNN). In particular, the maximum entropy\nclassifier is used to classify the internet traffic. The experimental results\nshow that the proposed hybrid deep learning algorithm is effective and achieved\nhigh accuracy for internet traffic classification, i.e., 99.23%. Furthermore,\nthe proposed algorithm achieved the highest accuracy compared to the support\nvector machine (SVM) based classification technique and k-nearest neighbours\n(KNNs) based classification technique.",
          "arxiv_id": "2107.12193v1"
        },
        {
          "title": "LUCID: Receiver-aware Model-based Data Communication for Low-power Wireless Networks",
          "year": "2021-07",
          "abstract": "In the last decade, the advancement of the Internet of Things (IoT) has\ncaused unlicensed radio spectrum, especially the 2.4 GHz ISM band, to be\nimmensely crowded with smart wireless devices that are used in a wide range of\napplication domains. Due to their diversity in radio resource use and channel\naccess techniques, when collocated, these wireless devices create interference\nwith each other, known as Cross-Technology Interference (CTI), which can lead\nto increased packet losses and energy consumption. CTI is a significant problem\nfor low-power wireless networks, such as IEEE 802.15.4, as it decreases the\noverall dependability of the wireless network.\n  To improve the performance of low-power wireless networks under CTI\nconditions, we propose a data-driven proactive receiver-aware MAC protocol,\nLUCID, based on interference estimation and white space prediction. We leverage\nstatistical analysis of real-world traces from two indoor environments\ncharacterised by varying channel conditions to develop CTI prediction methods.\nThe CTI models that generate accurate predictions of interference behaviour are\nan intrinsic part of our solution. LUCID is thoroughly evaluated in realistic\nsimulations and we show that depending on the application data rate and the\nnetwork size, our solution achieves higher dependability, 1.2% increase in\npacket delivery ratio and 0.02% decrease in duty-cycle under bursty indoor\ninterference than state of the art alternative methods.",
          "arxiv_id": "2107.02271v1"
        }
      ],
      "1": [
        {
          "title": "Optimizing High-Efficiency Quantum Memory with Quantum Machine Learning for Near-Term Quantum Devices",
          "year": "2020-03",
          "abstract": "Quantum memories are a fundamental of any global-scale quantum Internet,\nhigh-performance quantum networking and near-term quantum computers. A main\nproblem of quantum memories is the low retrieval efficiency of the quantum\nsystems from the quantum registers of the quantum memory. Here, we define a\nnovel quantum memory called high-retrieval-efficiency (HRE) quantum memory for\nnear-term quantum devices. An HRE quantum memory unit integrates local unitary\noperations on its hardware level for the optimization of the readout procedure\nand utilizes the advanced techniques of quantum machine learning. We define the\nintegrated unitary operations of an HRE quantum memory, prove the learning\nprocedure, and evaluate the achievable output signal-to-noise ratio values. We\nprove that the local unitaries of an HRE quantum memory achieve the\noptimization of the readout procedure in an unsupervised manner without the use\nof any labeled data or training sequences. We show that the readout procedure\nof an HRE quantum memory is realized in a completely blind manner without any\ninformation about the input quantum system or about the unknown quantum\noperation of the quantum register. We evaluate the retrieval efficiency of an\nHRE quantum memory and the output SNR (signal-to-noise ratio). The results are\nparticularly convenient for gate-model quantum computers and the near-term\nquantum devices of the quantum Internet.",
          "arxiv_id": "2003.05244v1"
        },
        {
          "title": "Practical limitations on robustness and scalability of quantum Internet",
          "year": "2023-08",
          "abstract": "As quantum theory allows for information processing and computing tasks that\notherwise are not possible with classical systems, there is a need and use of\nquantum Internet beyond existing network systems. At the same time, the\nrealization of a desirably functional quantum Internet is hindered by\nfundamental and practical challenges such as high loss during transmission of\nquantum systems, decoherence due to interaction with the environment, fragility\nof quantum states, etc. We study the implications of these constraints by\nanalyzing the limitations on the scaling and robustness of quantum Internet.\nConsidering quantum networks, we present practical bottlenecks for secure\ncommunication, delegated computing, and resource distribution among end nodes.\nMotivated by the power of abstraction in graph theory (in association with\nquantum information theory), we consider graph-theoretic quantifiers to assess\nnetwork robustness and provide critical values of communication lines for\nviable communication over quantum Internet.\n  In particular, we begin by discussing limitations on usefulness of isotropic\nstates as device-independent quantum key repeaters which otherwise could be\nuseful for device-independent quantum key distribution. We consider some\nquantum networks of practical interest, ranging from satellite-based networks\nconnecting far-off spatial locations to currently available quantum processor\narchitectures within computers, and analyze their robustness to perform quantum\ninformation processing tasks. Some of these tasks form primitives for delegated\nquantum computing, e.g., entanglement distribution and quantum teleportation.\nFor some examples of quantum networks, we present algorithms to perform\ndifferent quantum network tasks of interest such as constructing the network\nstructure, finding the shortest path between a pair of end nodes, and\noptimizing the flow of resources at a node.",
          "arxiv_id": "2308.12739v3"
        },
        {
          "title": "Harnessing Quantum Entanglement: Comprehensive Strategies for Enhanced Communication and Beyond in Quantum Networks",
          "year": "2024-06",
          "abstract": "Quantum communication represents a revolutionary advancement over classical\ninformation theory, which leverages unique quantum mechanics properties like\nentanglement to achieve unprecedented capabilities in secure and efficient\ninformation transmission. Unlike bits in classical communication, quantum\ncommunication utilizes qubits in superposition states, allowing for novel\ninformation storage and processing. Entanglement, a key quantum phenomenon,\nenables advanced protocols with enhanced security and processing power. This\npaper provides a comprehensive overview of quantum communication, emphasizing\nthe role of entanglement in theoretical foundations, practical protocols,\nexperimental progress, and security implications. It contrasts quantum\ncommunications potential applications with classical networks, identifying\nareas where entanglement offers significant advantages. The paper explores the\nfundamentals of quantum mechanics in communication, the physical realization of\nquantum information, and the formation of secure quantum networks through\nentanglement-based strategies like Quantum Key Distribution (QKD) and\nteleportation. It addresses the challenges of long-distance quantum\ncommunication, the role of quantum repeaters in scaling networks, and the\nconceptualization of interconnected quantum networks. Additionally, it\ndiscusses strides towards the Quantum Internet, Quantum Error-Correcting codes,\nand quantum cryptographys role in ensuring secure communication. By\nhighlighting the role of entanglement, this paper aims to inspire further\nresearch and innovation in secure and efficient information exchange within\nquantum networks.",
          "arxiv_id": "2406.08833v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:19:50Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}