{
  "topics": {
    "data": {
      "0": {
        "name": "0_function_paper_functions_number",
        "keywords": [
          [
            "function",
            0.0283549341622381
          ],
          [
            "paper",
            0.02646675089634846
          ],
          [
            "functions",
            0.025908112994379336
          ],
          [
            "number",
            0.02332172480253378
          ],
          [
            "numbers",
            0.023220504989707676
          ],
          [
            "new",
            0.02019409868170436
          ],
          [
            "equation",
            0.017391336088272712
          ],
          [
            "equations",
            0.016175235607049587
          ],
          [
            "prime",
            0.015522062863077222
          ],
          [
            "results",
            0.015310968186879362
          ]
        ],
        "count": 1277
      },
      "1": {
        "name": "1_fuzzy_spaces_metric_sets",
        "keywords": [
          [
            "fuzzy",
            0.13741422842699563
          ],
          [
            "spaces",
            0.05790907970385379
          ],
          [
            "metric",
            0.0463120673904638
          ],
          [
            "sets",
            0.03437354197821272
          ],
          [
            "space",
            0.031182617943333234
          ],
          [
            "set",
            0.02804433260314773
          ],
          [
            "paper",
            0.027042429785023896
          ],
          [
            "results",
            0.026181631820123178
          ],
          [
            "Fuzzy",
            0.025614095450267275
          ],
          [
            "intuitionistic",
            0.02417963342202957
          ]
        ],
        "count": 140
      },
      "2": {
        "name": "2_Riemann_zeta_zeros_function",
        "keywords": [
          [
            "Riemann",
            0.1392632921426358
          ],
          [
            "zeta",
            0.08758493891249046
          ],
          [
            "zeros",
            0.0863163080811828
          ],
          [
            "function",
            0.06243206109652154
          ],
          [
            "Hypothesis",
            0.061376579934054584
          ],
          [
            "critical",
            0.05721094218109343
          ],
          [
            "zeta function",
            0.046329216846391005
          ],
          [
            "critical line",
            0.04372707039367932
          ],
          [
            "line",
            0.04303994223054139
          ],
          [
            "hypothesis",
            0.03864888270358078
          ]
        ],
        "count": 48
      }
    },
    "correlations": [
      [
        1.0,
        -0.39860632010015634,
        -0.5610921339778466
      ],
      [
        -0.39860632010015634,
        1.0,
        -0.7125654956800387
      ],
      [
        -0.5610921339778466,
        -0.7125654956800387,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        14,
        1,
        2
      ],
      "2020-02": [
        24,
        2,
        3
      ],
      "2020-03": [
        28,
        3,
        4
      ],
      "2020-04": [
        18,
        2,
        1
      ],
      "2020-05": [
        16,
        1,
        6
      ],
      "2020-06": [
        24,
        3,
        4
      ],
      "2020-07": [
        17,
        2,
        3
      ],
      "2020-08": [
        16,
        0,
        0
      ],
      "2020-09": [
        19,
        1,
        2
      ],
      "2020-10": [
        20,
        3,
        2
      ],
      "2020-11": [
        9,
        2,
        4
      ],
      "2020-12": [
        21,
        3,
        3
      ],
      "2021-01": [
        24,
        4,
        5
      ],
      "2021-02": [
        22,
        1,
        1
      ],
      "2021-03": [
        24,
        2,
        6
      ],
      "2021-04": [
        25,
        3,
        0
      ],
      "2021-05": [
        24,
        1,
        0
      ],
      "2021-06": [
        20,
        0,
        3
      ],
      "2021-07": [
        13,
        1,
        2
      ],
      "2021-08": [
        19,
        1,
        2
      ],
      "2021-09": [
        22,
        2,
        1
      ],
      "2021-10": [
        22,
        1,
        1
      ],
      "2021-11": [
        19,
        2,
        0
      ],
      "2021-12": [
        20,
        2,
        4
      ],
      "2022-01": [
        18,
        4,
        5
      ],
      "2022-02": [
        11,
        3,
        0
      ],
      "2022-03": [
        13,
        1,
        2
      ],
      "2022-04": [
        16,
        3,
        5
      ],
      "2022-05": [
        19,
        5,
        2
      ],
      "2022-06": [
        19,
        9,
        0
      ],
      "2022-07": [
        13,
        5,
        1
      ],
      "2022-08": [
        17,
        6,
        0
      ],
      "2022-09": [
        18,
        5,
        2
      ],
      "2022-10": [
        16,
        0,
        1
      ],
      "2022-11": [
        20,
        0,
        2
      ],
      "2022-12": [
        16,
        2,
        1
      ],
      "2023-01": [
        23,
        3,
        1
      ],
      "2023-02": [
        15,
        3,
        2
      ],
      "2023-03": [
        16,
        4,
        5
      ],
      "2023-04": [
        23,
        4,
        1
      ],
      "2023-05": [
        28,
        2,
        3
      ],
      "2023-06": [
        23,
        2,
        3
      ],
      "2023-07": [
        21,
        2,
        1
      ],
      "2023-08": [
        20,
        3,
        3
      ],
      "2023-09": [
        11,
        2,
        1
      ],
      "2023-10": [
        34,
        6,
        2
      ],
      "2023-11": [
        22,
        1,
        3
      ],
      "2023-12": [
        22,
        3,
        2
      ],
      "2024-01": [
        15,
        0,
        2
      ],
      "2024-02": [
        24,
        1,
        0
      ],
      "2024-03": [
        32,
        1,
        5
      ],
      "2024-04": [
        21,
        4,
        3
      ],
      "2024-05": [
        32,
        0,
        7
      ],
      "2024-06": [
        17,
        3,
        2
      ],
      "2024-07": [
        14,
        3,
        5
      ],
      "2024-08": [
        18,
        1,
        2
      ],
      "2024-09": [
        17,
        3,
        0
      ],
      "2024-10": [
        17,
        2,
        1
      ],
      "2024-11": [
        25,
        4,
        2
      ],
      "2024-12": [
        21,
        1,
        3
      ],
      "2025-01": [
        16,
        1,
        2
      ],
      "2025-02": [
        22,
        4,
        3
      ],
      "2025-03": [
        28,
        1,
        4
      ],
      "2025-04": [
        25,
        2,
        5
      ],
      "2025-05": [
        27,
        6,
        2
      ],
      "2025-06": [
        31,
        4,
        4
      ],
      "2025-07": [
        14,
        5,
        4
      ],
      "2025-08": [
        24,
        2,
        1
      ],
      "2025-09": [
        8,
        0,
        3
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Further Generalization of Ramanujan Sums with Regular A-Functions",
          "year": "2025-02",
          "abstract": "In the study of Ramanujan sums, the so-called regular $A$-function is a\nset-valued multiplicative function that tracks certain subsets of the divisor\nsets of natural numbers. McCarthy provided a generalization of the Ramanujan\nsum using these regular $A$-function based arithmetic convolutions. This\napproach has recently attracted considerable interest from several researchers.\nIn this paper, we extend McCarthy's generalization by introducing two regular\n$A$-functions corresponding to both parameters in the Ramanujan sum.\nFortunately, these sums exhibit several properties of the Ramanujan sums. We\nalso generalize the greatest common divisor (GCD) function and the Von Sterneck\nformula. Our introduction of two regular $A$-functions into these expressions\nenables us to explore a novel perspective on the connection between these\nexpressions and the order relation between the two regular $A$-functions. In\nparticular, we establish the necessary and sufficient conditions for\northogonality and Dedekind-H\\\"older's identity (i.e., Ramanujan sum = Von\nSterneck function) to hold. Our primary motivation for this further\ngeneralization proposed in this paper is expansions of arithmetic functions\nbased on arbitrary regular $A$-functions. To the best of our knowledge, the\nexpansions of arbitrary $A$-functions discussed here are new in the literature.",
          "arxiv_id": "2503.11671v2"
        },
        {
          "title": "On a solution of a fractional hyper-Bessel differential equation by means of a multi-index special function",
          "year": "2021-02",
          "abstract": "In this paper, we introduce a new multiple-parameters (multi-index) extension\nof the Wright function that arises from an eigenvalue problem for a case of\nhyper-Bessel operator involving Caputo fractional derivatives. We show that by\ngiving particular values to the parameters involved in this special function,\nthis leads to some known special functions (as the classical Wright function,\nthe $\\alpha$-Mittag-Leffer function, the Tricomi function, etc.) that on their\nturn appear as cases of the so-called multi-index Mittag-Leffer functions. As\nan application, we mention that this new generalization Wright function is an\nisochronous solution of a nonlinear fractional partial differential equation.",
          "arxiv_id": "2102.04347v2"
        },
        {
          "title": "Lemniscate of Leaf Function",
          "year": "2020-06",
          "abstract": "A lemniscate is a curve defined by two foci, F1 and F2. If the distance\nbetween the focal points of F1 - F2 is 2a (a: constant), then any point P on\nthe lemniscate curve satisfy the equation PF1 PF2 = a^2. Jacob Bernoulli first\ndescribed the lemniscate in 1694. The Fagnano discovered the double angle\nformula of the lemniscate(1718). The Euler extended the Fagnano's formula to a\nmore general addition theorem(1751). The lemniscate function was subsequently\nproposed by Gauss around the year 1800. These insights are summarized by Jacobi\nas the theory of elliptic functions. A leaf function is an extended lemniscate\nfunction. Some formulas of leaf functions have been presented in previous\npapers; these included the addition theorem of this function and its\napplication to nonlinear equations. In this paper, the geometrical properties\nof leaf functions at n = 2 and the geometric relation between the angle theta\nand lemniscate arc length l are presented using the lemniscate curve. The\nrelationship between the leaf functions sleaf2(l) and cleaf2(l) is derived\nusing the geometrical properties of the lemniscate, similarity of triangles,\nand the Pythagorean theorem. In the literature, the relation equation for\nsleaf2(l) and cleaf2(l) (or the lemniscate functions, sl(l) and cl(l)) has been\nderived analytically; however, it is not derived geometrically.",
          "arxiv_id": "2006.15529v2"
        }
      ],
      "1": [
        {
          "title": "Fuzzy Riesz homomorphism on fuzzy Riesz space",
          "year": "2021-04",
          "abstract": "In this paper, we give some properties of fuzzy Riesz homomorphism on fuzzy\nRiesz space. We give definitions of fuzzy quotient spaces, and some\ncharacterizations of fuzzy Archimedean quotient spaces. We prove the properties\nwhich fuzzy Riesz homomorphism is fuzzy order continuous, and study the\nextension of fuzzy lattice homomorphism and the extension of fuzzy order\ncontinuous lattice homomorphism. Finally, we investigate the factorization by\nfuzzy Riesz homomorphisms.",
          "arxiv_id": "2104.07498v1"
        },
        {
          "title": "Study of Bipolar Fuzzy Soft Hypervector Spaces",
          "year": "2023-10",
          "abstract": "In this paper, three topics in bipolar fuzzy soft hypervector spaces are\ninvestigated. At first, four equivalent conditions to definition of a bipolar\nfuzzy soft hypervector space are presented, from different point of views. Then\nsome new bipolar fuzzy soft hypervector spaces are constructed, using the\nnotions of subhyperspace, level subset, generated subhyperspace and previous\nbipolar fuzzy soft hypervector spaces. Finally, normal bipolar fuzzy soft\nhypervector spaces is studied, as an especial kind of bipolar fuzzy soft\nhypervector spaces. All concepts are supported by interesting examples.",
          "arxiv_id": "2310.06944v1"
        },
        {
          "title": "Fuzzy ample spectrum contractions in (more general than) non-Archimedean fuzzy metric spaces",
          "year": "2021-04",
          "abstract": "Taking into account that Rold\\'an et al.'s ample spectrum contractions have\nmanaged to extend and unify more than ten distinct families of contractive\nmappings in the setting of metric spaces, in this manuscript we present a first\nstudy on how such concept can be implemented in the more general framework of\nfuzzy metric spaces in the sense of Kramosil and Mich\\'alek. We introduce two\ndistinct approaches to the concept of fuzzy ample spectrum contractions and we\nprove general results about existence and uniqueness of fixed points. The\nproposed notions enjoys the following advantages with respect to previous\napproaches: (1) they permit to develop fixed point theory in a very general\nfuzzy framework (for instance, the underlying fuzzy space is not necessarily\ncomplete); (2) the procedures that we employ are able to overcome the technical\ndrawbacks raising in fuzzy metric spaces in the sense of Kramosil and\nMich\\'alek (that do not appear in fuzzy metric spaces in the sense of George\nand Veeramani); (3) we introduce a novel property about sequences that are not\nCauchy in a fuzzy space in order to consider a more general context than\nnon-Archimedean fuzzy metric spaces; (4) the contractivity condition associated\nto fuzzy ample spectrum contractions does not have to be expressed in separate\nvariables; (5) such fuzzy contractions generalize some well-known families of\nfuzzy contractive operators such that the class of all Mihet's fuzzy\n$\\psi$-contractions. As a consequence of these properties, this study gives a\npositive partial answer to a question posed by this author some years ago.",
          "arxiv_id": "2104.09155v1"
        }
      ],
      "2": [
        {
          "title": "Attempting to Prove the Riemann Hypothesis through the Reflection Formula",
          "year": "2024-03",
          "abstract": "The Riemann Hypothesis, originally proposed by the eminent mathematician\nBernard Riemann in 1859, remains one of the most profound challenges in number\ntheory. It posits that all non-trivial zeros of the Riemann zeta function\n{\\zeta}(s) are concentrated precisely along the critical line where the real\npart equals 1/2. In this paper, our aim is to present an attempt to prove this\nconjecture. Our approach relies on the use of the reflection formula. By\napplying this tool with precision and insight, we can conclusively establish\nthat {\\xi}(s)^2 (Riemann's {\\xi}-function) is valid only when Re(s)=1/2. As a\ndirect consequence of this determination, we can assert that every zero of both\n{\\xi}(s)^2 and {\\xi}(s) has a real part equal to 1/2. This, in turn, leads us\nto the tentative conclusion that the real part of all non-trivial zeros of the\nzeta function is consistently 1/2.",
          "arxiv_id": "2403.05347v2"
        },
        {
          "title": "Disproof of the Riemann Hypothesis",
          "year": "2024-04",
          "abstract": "The Riemann Hypothesis is a conjecture that all non-trivial zeros of Riemann\nZeta function are located on the critical line in the complex plane. Hundreds\nof propositions in function theory and analytic number theory rely on this\nhypothesis. However, the problem has been unresolved for over a century. Here\nwe show that at least one set of quadruplet-zeros exists outside the critical\nline through expanding the infinite product of the Riemann Xi zero function. We\nfound that assuming there are no zeros outside the critical line will result in\na contradiction with the known result that the reciprocal sum of all zeros of\nthe xi-function is a constant, thereby refuting the Riemann Hypothesis.\nFurthermore, we give a lower bound estimation of a kind of summation formula\nfor the zero points outside the critical line.",
          "arxiv_id": "2404.06306v3"
        },
        {
          "title": "A Simple Proof of the Riemann Hypothesis",
          "year": "2022-09",
          "abstract": "In this article, it is proved that the non-trivial zeros of the Riemann zeta\nfunction must lie on the critical line, known as the Riemann hypothesis.",
          "arxiv_id": "2209.01890v36"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:32:18Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}