{
  "topics": {
    "data": {
      "0": {
        "name": "0_theory_paper_mathematical_problem",
        "keywords": [
          [
            "theory",
            0.02547284980855282
          ],
          [
            "paper",
            0.0241215572466138
          ],
          [
            "mathematical",
            0.019201922924387025
          ],
          [
            "problem",
            0.018749967664104198
          ],
          [
            "theorem",
            0.018283319511975163
          ],
          [
            "proof",
            0.01790117802848436
          ],
          [
            "number",
            0.017720583993673503
          ],
          [
            "geometry",
            0.01653756440606262
          ],
          [
            "results",
            0.01649056874894877
          ],
          [
            "article",
            0.01615449166092696
          ]
        ],
        "count": 905
      },
      "1": {
        "name": "1_mathematics_mathematical_students_Mathematics",
        "keywords": [
          [
            "mathematics",
            0.05904933448365435
          ],
          [
            "mathematical",
            0.04506129932306598
          ],
          [
            "students",
            0.034817902737857405
          ],
          [
            "Mathematics",
            0.025489597625770844
          ],
          [
            "research",
            0.02145576270929345
          ],
          [
            "paper",
            0.01907561312541714
          ],
          [
            "education",
            0.01868224107002171
          ],
          [
            "teaching",
            0.017176046916003766
          ],
          [
            "theory",
            0.0162780827529166
          ],
          [
            "use",
            0.015201170042269624
          ]
        ],
        "count": 384
      }
    },
    "correlations": [
      [
        1.0,
        0.011753581476843576
      ],
      [
        0.011753581476843576,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        22,
        1
      ],
      "2020-02": [
        21,
        4
      ],
      "2020-03": [
        18,
        6
      ],
      "2020-04": [
        23,
        4
      ],
      "2020-05": [
        19,
        3
      ],
      "2020-06": [
        16,
        1
      ],
      "2020-07": [
        9,
        2
      ],
      "2020-08": [
        22,
        11
      ],
      "2020-09": [
        18,
        2
      ],
      "2020-10": [
        14,
        5
      ],
      "2020-11": [
        15,
        7
      ],
      "2020-12": [
        24,
        4
      ],
      "2021-01": [
        15,
        5
      ],
      "2021-02": [
        13,
        6
      ],
      "2021-03": [
        13,
        7
      ],
      "2021-04": [
        13,
        3
      ],
      "2021-05": [
        24,
        8
      ],
      "2021-06": [
        19,
        4
      ],
      "2021-07": [
        14,
        7
      ],
      "2021-08": [
        14,
        6
      ],
      "2021-09": [
        9,
        8
      ],
      "2021-10": [
        13,
        2
      ],
      "2021-11": [
        13,
        4
      ],
      "2021-12": [
        13,
        13
      ],
      "2022-01": [
        22,
        5
      ],
      "2022-02": [
        10,
        6
      ],
      "2022-03": [
        11,
        2
      ],
      "2022-04": [
        17,
        5
      ],
      "2022-05": [
        14,
        3
      ],
      "2022-06": [
        19,
        4
      ],
      "2022-07": [
        17,
        7
      ],
      "2022-08": [
        22,
        5
      ],
      "2022-09": [
        18,
        1
      ],
      "2022-10": [
        15,
        7
      ],
      "2022-11": [
        21,
        3
      ],
      "2022-12": [
        13,
        12
      ],
      "2023-01": [
        15,
        3
      ],
      "2023-02": [
        14,
        5
      ],
      "2023-03": [
        19,
        6
      ],
      "2023-04": [
        10,
        3
      ],
      "2023-05": [
        13,
        10
      ],
      "2023-06": [
        18,
        5
      ],
      "2023-07": [
        16,
        14
      ],
      "2023-08": [
        31,
        7
      ],
      "2023-09": [
        21,
        6
      ],
      "2023-10": [
        23,
        9
      ],
      "2023-11": [
        16,
        4
      ],
      "2023-12": [
        19,
        2
      ],
      "2024-01": [
        16,
        4
      ],
      "2024-02": [
        19,
        8
      ],
      "2024-03": [
        18,
        2
      ],
      "2024-04": [
        23,
        10
      ],
      "2024-05": [
        13,
        6
      ],
      "2024-06": [
        13,
        9
      ],
      "2024-07": [
        7,
        3
      ],
      "2024-08": [
        11,
        6
      ],
      "2024-09": [
        10,
        2
      ],
      "2024-10": [
        17,
        6
      ],
      "2024-11": [
        9,
        6
      ],
      "2024-12": [
        21,
        5
      ],
      "2025-01": [
        26,
        6
      ],
      "2025-02": [
        18,
        12
      ],
      "2025-03": [
        20,
        7
      ],
      "2025-04": [
        13,
        7
      ],
      "2025-05": [
        14,
        3
      ],
      "2025-06": [
        15,
        8
      ],
      "2025-07": [
        22,
        3
      ],
      "2025-08": [
        18,
        15
      ],
      "2025-09": [
        8,
        2
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Irracionalidade recíproca",
          "year": "2023-07",
          "abstract": "Prime numbers play a key role in number theory and have applications beyond\nMathematics. In particular, in the Theory of Codes and also in Cryptography,\nthe properties of prime numbers are relevant, because, from them, it is\npossible to guarantee the storage of data and the sending of messages in a\nsecure way. And this is evident in e-commerce when personal data must be kept\nconfidential. The proof that $\\sqrt{p}$ is an irrational number, for every\npositive prime $p$, is known, if not by everyone, at least by the majority of\nMathematics students, and such a proof is, in general, given by means of a\nbasic property of numbers primes: if $p$ divides the product of two integers,\nthen it divides at least one of them. This result forms the basis of other\nequally important results, such as, for example, what is given by the\nFundamental Theorem of Arithmetic, which is the basic result of the Theory of\nNumbers. In this article, we present a proof of the irrationality of\n$\\sqrt[2n]{p}$ using results from Quadratic Residue Theory, especially, by\nGauss's Law of Quadratic Reciprocity.",
          "arxiv_id": "2307.10338v2"
        },
        {
          "title": "Abel-Ruffini's Theorem: Complex but Not Complicated!",
          "year": "2020-11",
          "abstract": "In this article, using only elementary knowledge of complex numbers, we\nsketch a proof of the celebrated Abel--Ruffini theorem, which states that the\ngeneral solution to an algebraic equation of degree five or more cannot be\nwritten using radicals, that is, using its coefficients and arithmetic\noperations $+,-,\\times,\\div,$ and $\\sqrt{\\ }$. The present article is written\npurposely with concise and pedagogical terms and dedicated to students and\nresearchers not familiar with Galois theory, or even group theory in general,\nwhich are the usual tools used to prove this remarkable theorem. In particular,\nthe proof is self-contained and gives some insight as to why formulae exist for\nequations of degree four or less (and how they are constructed), and why they\ndo not for degree five or more.",
          "arxiv_id": "2011.05162v1"
        },
        {
          "title": "A tour d'horizon of de Casteljau's work",
          "year": "2024-08",
          "abstract": "Whilst Paul de Casteljau is now famous for his fundamental algorithm of curve\nand surface approximation, little is known about his other findings. This\narticle offers an insight into his results in geometry, algebra and number\ntheory.\n  Related to geometry, his classical algorithm is reviewed as an index\nreduction of a polar form. This idea is used to show de Casteljau's algebraic\nway of smoothing, which long went unnoticed. We will also see an analytic polar\nform and its use in finding the intersection of two curves. The article\nsummarises unpublished material on metric geometry. It includes theoretical\nadvances, e.g., the 14-point strophoid or a way to link Apollonian circles with\nconfocal conics, and also practical applications such as a recurrence for\nconjugate mirrors in geometric optics. A view on regular polygons leads to an\napproximation of their diagonals by golden matrices, a generalisation of the\ngolden ratio.\n  Relevant algebraic findings include matrix quaternions (and anti-quaternions)\nand their link with Lorentz' equations. De Casteljau generalised the Euclidean\nalgorithm and developed an automated method for approximating the roots of a\nclass of polynomial equations. His contributions to number theory not only\ninclude aspects on the sum of four squares as in quaternions, but also a view\non a particular sum of three cubes. After a review of a complete quadrilateral\nin a heptagon and its angles, the paper concludes with a summary of de\nCasteljau's key achievements.\n  The article contains a comprehensive bibliography of de Casteljau's works,\nincluding previously unpublished material.",
          "arxiv_id": "2408.13125v1"
        }
      ],
      "1": [
        {
          "title": "Applications of Teaching Secondary Mathematics in Undergraduate Mathematics Courses",
          "year": "2021-02",
          "abstract": "Robust preparation of future secondary mathematics teachers requires\nattention to the acquisition of mathematical knowledge for teaching. Many\nfuture teachers learn mathematics content primarily through mathematics major\ncourses that are taught by mathematicians who do not specialize in teacher\npreparation. How can mathematics education researchers assist mathematicians in\nmaking explicit connections between the content of undergraduate mathematics\ncourses and the content of secondary mathematics? We present an articulation of\nfive types of connections that can be used in secondary mathematics teacher\npreparation and give examples of question prompts that mathematicians can use\nas applications of teaching secondary mathematics in undergraduate mathematics\ncourses.",
          "arxiv_id": "2102.04537v1"
        },
        {
          "title": "On humanization of mathematics: aesthetic mathematics",
          "year": "2023-02",
          "abstract": "This paper examines various methods and ideas for humanizing mathematics. The\nterm 'humanizing mathematics' which includes elements of 'aesthetic\nmathematics' refers to approaches that emphasize the aesthetic, philosophical,\nand subjective dimensions of mathematics. These approaches aim to make\nmathematics humanize. It proposes novel directions in mathematics, stressing\nthat the ideas presented here are provisional. Furthermore, it argues that\nmathematics can take multiple humanized forms. Even traditional mathematics can\nbe interpreted as a form of humanized mathematics. To support this perspective,\nseveral mathematical observations are provided. Additionally, a general\napproach to addressing the Riemann Hypothesis, focusing on proof by\ncontradiction and mathematical logic, particularly model theory, is outlined.\nThe paper also briefly reflects on my prior research through this idea on\nhumanization and concludes with general remarks and future directions.",
          "arxiv_id": "2302.02449v2"
        },
        {
          "title": "Inquiry-Based Mathematics Education: a call for reform in tertiary education seems unjustified",
          "year": "2022-06",
          "abstract": "In the last decade, major efforts have been made to promote inquiry-based\nmathematics learning at the tertiary level. The Inquiry-Based Mathematics\nEducation (IBME) movement has gained strong momentum among some mathematicians,\nattracting substantial funding, including from some US government agencies.\nThis resulted in the successful mobilization of regional consortia in many\nstates, uniting over 800 mathematics education practitioners working to reform\nundergraduate education. Inquiry-based learning is characterized by the\nfundamental premise that learners should be allowed to learn 'new to them'\nmathematics without being taught. This progressive idea is based on the\nassumption that it is best to advance learners to the level of experts by\nengaging learners in mathematical practices similar to those of practising\nmathematicians: creating new definitions, conjectures and proofs - that way\nlearners are thought to develop 'deep mathematical understanding'. However,\nconcerted efforts to radically reform mathematics education must be\nsystematically scrutinized in view of available evidence and theoretical\nadvances in the learning sciences. To that end, this scoping review sought to\nconsolidate the extant research literature from cognitive science and\neducational psychology, offering a critical commentary on the effectiveness of\ninquiry-based learning. Our analysis of research articles and books pertaining\nto the topic revealed that the call for a major reform by the IBME advocates is\nnot justified. Specifically, the general claim that students would learn better\n(and acquire superior conceptual understanding) if they were not taught is not\nsupported by evidence. Neither is the general claim about the merits of IBME\nfor addressing equity issues in mathematics classrooms.",
          "arxiv_id": "2206.12149v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:32:40Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}