{
  "topics": {
    "data": {
      "0": {
        "name": "0_space_spaces_topological_compact",
        "keywords": [
          [
            "space",
            0.06822950543331367
          ],
          [
            "spaces",
            0.06442419522714732
          ],
          [
            "topological",
            0.04430797095051597
          ],
          [
            "compact",
            0.04118972484053398
          ],
          [
            "set",
            0.033316022952571196
          ],
          [
            "topology",
            0.03306142462991712
          ],
          [
            "continuous",
            0.029274943116623243
          ],
          [
            "sets",
            0.02817614915406744
          ],
          [
            "paper",
            0.027135736129935337
          ],
          [
            "group",
            0.02693309043388176
          ]
        ],
        "count": 1920
      },
      "1": {
        "name": "1_mappings_point_metric_metric spaces",
        "keywords": [
          [
            "mappings",
            0.14493525926326156
          ],
          [
            "point",
            0.11705787601474808
          ],
          [
            "metric",
            0.07669212983570704
          ],
          [
            "metric spaces",
            0.0688597621823861
          ],
          [
            "type",
            0.06113782050016071
          ],
          [
            "spaces",
            0.05865944225899262
          ],
          [
            "results",
            0.05368059675207974
          ],
          [
            "contractions",
            0.052421912108813154
          ],
          [
            "point theorems",
            0.044357002553611136
          ],
          [
            "point theorem",
            0.04423679955945394
          ]
        ],
        "count": 52
      }
    },
    "correlations": [
      [
        1.0,
        -0.28583310802580186
      ],
      [
        -0.28583310802580186,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        28,
        1
      ],
      "2020-02": [
        27,
        1
      ],
      "2020-03": [
        26,
        1
      ],
      "2020-04": [
        29,
        3
      ],
      "2020-05": [
        23,
        4
      ],
      "2020-06": [
        26,
        2
      ],
      "2020-07": [
        29,
        5
      ],
      "2020-08": [
        9,
        2
      ],
      "2020-09": [
        28,
        1
      ],
      "2020-10": [
        15,
        2
      ],
      "2020-11": [
        24,
        1
      ],
      "2020-12": [
        30,
        0
      ],
      "2021-01": [
        19,
        4
      ],
      "2021-02": [
        23,
        2
      ],
      "2021-03": [
        27,
        3
      ],
      "2021-04": [
        33,
        3
      ],
      "2021-05": [
        28,
        1
      ],
      "2021-06": [
        16,
        0
      ],
      "2021-07": [
        23,
        6
      ],
      "2021-08": [
        24,
        4
      ],
      "2021-09": [
        34,
        2
      ],
      "2021-10": [
        25,
        1
      ],
      "2021-11": [
        36,
        5
      ],
      "2021-12": [
        31,
        1
      ],
      "2022-01": [
        19,
        3
      ],
      "2022-02": [
        22,
        1
      ],
      "2022-03": [
        25,
        2
      ],
      "2022-04": [
        28,
        4
      ],
      "2022-05": [
        29,
        1
      ],
      "2022-06": [
        29,
        3
      ],
      "2022-07": [
        38,
        3
      ],
      "2022-08": [
        23,
        4
      ],
      "2022-09": [
        19,
        3
      ],
      "2022-10": [
        33,
        2
      ],
      "2022-11": [
        50,
        1
      ],
      "2022-12": [
        29,
        1
      ],
      "2023-01": [
        23,
        1
      ],
      "2023-02": [
        21,
        2
      ],
      "2023-03": [
        36,
        6
      ],
      "2023-04": [
        21,
        0
      ],
      "2023-05": [
        24,
        2
      ],
      "2023-06": [
        16,
        1
      ],
      "2023-07": [
        34,
        3
      ],
      "2023-08": [
        34,
        7
      ],
      "2023-09": [
        32,
        3
      ],
      "2023-10": [
        19,
        1
      ],
      "2023-11": [
        23,
        5
      ],
      "2023-12": [
        36,
        2
      ],
      "2024-01": [
        28,
        4
      ],
      "2024-02": [
        19,
        2
      ],
      "2024-03": [
        32,
        3
      ],
      "2024-04": [
        27,
        4
      ],
      "2024-05": [
        31,
        4
      ],
      "2024-06": [
        29,
        4
      ],
      "2024-07": [
        38,
        3
      ],
      "2024-08": [
        21,
        1
      ],
      "2024-09": [
        26,
        2
      ],
      "2024-10": [
        18,
        1
      ],
      "2024-11": [
        22,
        0
      ],
      "2024-12": [
        41,
        9
      ],
      "2025-01": [
        28,
        6
      ],
      "2025-02": [
        28,
        1
      ],
      "2025-03": [
        29,
        2
      ],
      "2025-04": [
        24,
        5
      ],
      "2025-05": [
        22,
        1
      ],
      "2025-06": [
        30,
        0
      ],
      "2025-07": [
        29,
        3
      ],
      "2025-08": [
        32,
        4
      ],
      "2025-09": [
        10,
        1
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Surfaces and other Peano Continua with no Generic Chains",
          "year": "2024-03",
          "abstract": "The space of chains on a compact connected space encodes all the different\nways of continuously growing out of a point until exhausting the space. A chain\nis \\emph{generic} if its orbit under the action of the underlying homeomorphism\ngroup is comeager. In this paper we show that a large family of topological\nspaces do not have a generic chain: in addition to all manifolds of dimension\nat least 3, for which the result was already known, our theorem covers all\ncompact surfaces except for the sphere and the real projective plane - for\nwhich the question remains open - as well as all other homogeneous Peano\ncontinua, circle excluded. If the spaces are moreover strongly locally\nhomogeneous, which is the case for any closed manifold and the Menger curve, we\nprove that chains cannot be classified up to homeomorphism by countable\nstructures, and that the underlying homeomorphism groups have non-metrizable\nuniversal minimal flows, with all orbits meager, in contrast to the case of\n1-dimensional manifolds. The proof of the main result is of combinatorial\nnature, and it relies on the creation of a dictionary between open sets of\nchains on one side, and walks on finite connected graphs on the other.",
          "arxiv_id": "2403.08667v3"
        },
        {
          "title": "$\\mathcal{S}_X$-convergence and locally hypercompact spaces",
          "year": "2022-09",
          "abstract": "In this paper, we give a topological version of Scott convergence theorem for\nlocally hypercompact spaces. We introduce the notion of\n$\\mathcal{S}^*_X$-convergence on a $T_0$ topological space $X$, and define the\nnotion of finitely approximated spaces. Monotone determined spaces are natural\ntopological extensions of dcpos. The main results are: (1) A monotone\ndetermined space $X$ is a locally hypercompact space iff\n$\\mathcal{S}^*_X$-convergence is topological. (2) For a $T_0$ space $X$,\n$\\mathcal{S}^*_X$-convergence is topological iff $X$ is a finitely\napproximating space. (3) If the Lawson topology on a monotone determined space\n$X$ is compact, then $X$ is a dcpo endowed with the Scott topology.",
          "arxiv_id": "2209.13253v2"
        },
        {
          "title": "On the class of NY compact spaces of finitely supported elements and related classes",
          "year": "2024-07",
          "abstract": "We prove that a compact space $K$ embeds into a $\\sigma$-product of compact\nmetrizable spaces ($\\sigma$-product of intervals) if and only if $K$ is\n(strongly countable-dimensional) hereditarily metalindel\\\"of and every subspace\nof $K$ has a nonempty relative open second-countable subset. This provides\nnovel characterizations of $\\omega$-Corson and $NY$ compact spaces. We give an\nexample of a uniform Eberlein compact space that does not embed into a product\nof compact metric spaces in such a way that the $\\sigma$-product is dense in\nthe image. In particular, this answers a question of Kubi\\'s and Leiderman. We\nalso show that for a compact space $K$ the property of being $NY$ compact is\ndetermined by the topological structure of the space $C_p(K)$ of continuous\nreal-valued functions of $K$ equipped with the pointwise convergence topology.\nThis refines a recent result of Zakrzewski.",
          "arxiv_id": "2407.09090v2"
        }
      ],
      "1": [
        {
          "title": "Fixed point results for multipoint Kannan-type mappings",
          "year": "2025-04",
          "abstract": "We introduce and study a new type of mappings in metric spaces termed\n$n$-point Kannan-type mappings. A fixed-point theorem is proved for these\nmappings. In general case such mappings are discontinuous in the domain but\nnecessarily continuous at fixed points. Conditions under which usual Kannan\nmappings and mapping contracting the total pairwise distances between $n$\npoints are $n$-point Kannan-type mappings are found. It is shown that\nadditional conditions of asymptotic regularity and continuity allow to extend\nthe value of the contraction coefficient in fixed-point theorems for $n$-point\nKannan-type mappings.",
          "arxiv_id": "2504.14213v1"
        },
        {
          "title": "Fixed point theorem for generalized Kannan type mappings",
          "year": "2023-08",
          "abstract": "We introduce a new type of mappings in metric spaces which are three-point\nanalogue of the well-known Kannan type mappings and call them generalized\nKannan type mappings. It is shown that in general case such mappings are\ndiscontinuous but continuous at fixed points as well as Kannan type mappings\nand that these two classes of mappings are independent. The fixed-point theorem\nfor generalized Kannan type mappings is proved. Additional conditions of\nasymptotic regularity and continuity allow us to extent the class of mappings\nfor which the fixed-point theorems hold. Following Kannan, we also obtain two\nother fixed-point theorems for generalized Kannan type mappings in metric\nspaces which are not obligatory complete.",
          "arxiv_id": "2308.05419v2"
        },
        {
          "title": "A three point extension of Chatterjea's fixed point theorem with at most two fixed points",
          "year": "2024-02",
          "abstract": "In this paper, we introduce a new category of mappings within metric spaces,\nspecifically focusing on three-point analogs of the well-established Chatterjea\ntype mappings. We demonstrate that Chatterjea type mappings and their\nthree-point analogs are different classes of mappings. A fixed point theorem\nfor generalized Chatterjea type mappings is established. It is shown that these\nmappings are continuous at fixed point. Connections between generalized\nChatterjea type mappings, generalized Kannan type mappings, Chatterjea type\nmappings, and mappings contracting perimeters of triangles are found.\nAdditionally, we derive two fixed point theorems for generalized Chatterjea\ntype mappings in metric spaces, even when completeness is not mandatory.",
          "arxiv_id": "2403.07906v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:32:21Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}