{
  "topics": {
    "data": {
      "0": {
        "name": "0_method_numerical_order_methods",
        "keywords": [
          [
            "method",
            0.03160725144705021
          ],
          [
            "numerical",
            0.023273464779094883
          ],
          [
            "order",
            0.020343418563502243
          ],
          [
            "methods",
            0.020052683182719334
          ],
          [
            "time",
            0.01966582401754532
          ],
          [
            "equations",
            0.0182393544801159
          ],
          [
            "problems",
            0.017768776117731432
          ],
          [
            "problem",
            0.017459388302919977
          ],
          [
            "model",
            0.01530030452934083
          ],
          [
            "convergence",
            0.014735002627210204
          ]
        ],
        "count": 23044
      },
      "1": {
        "name": "1_model_cardiac_blood_flow",
        "keywords": [
          [
            "model",
            0.05123917977872357
          ],
          [
            "cardiac",
            0.046376167125174596
          ],
          [
            "blood",
            0.03627631424783496
          ],
          [
            "flow",
            0.03199403499148674
          ],
          [
            "models",
            0.028753591601182564
          ],
          [
            "heart",
            0.02697831470069097
          ],
          [
            "blood flow",
            0.02256109170680144
          ],
          [
            "simulations",
            0.0193529419184511
          ],
          [
            "numerical",
            0.019095000204665362
          ],
          [
            "fluid",
            0.017433029910613292
          ]
        ],
        "count": 166
      }
    },
    "correlations": [
      [
        1.0,
        -0.5961629805736948
      ],
      [
        -0.5961629805736948,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        254,
        33
      ],
      "2020-02": [
        256,
        45
      ],
      "2020-03": [
        251,
        44
      ],
      "2020-04": [
        250,
        46
      ],
      "2020-05": [
        271,
        33
      ],
      "2020-06": [
        279,
        36
      ],
      "2020-07": [
        301,
        41
      ],
      "2020-08": [
        224,
        34
      ],
      "2020-09": [
        233,
        34
      ],
      "2020-10": [
        283,
        52
      ],
      "2020-11": [
        299,
        39
      ],
      "2020-12": [
        297,
        47
      ],
      "2021-01": [
        288,
        47
      ],
      "2021-02": [
        279,
        49
      ],
      "2021-03": [
        346,
        53
      ],
      "2021-04": [
        307,
        38
      ],
      "2021-05": [
        300,
        51
      ],
      "2021-06": [
        308,
        54
      ],
      "2021-07": [
        266,
        43
      ],
      "2021-08": [
        259,
        40
      ],
      "2021-09": [
        272,
        29
      ],
      "2021-10": [
        306,
        60
      ],
      "2021-11": [
        303,
        31
      ],
      "2021-12": [
        297,
        54
      ],
      "2022-01": [
        281,
        35
      ],
      "2022-02": [
        281,
        32
      ],
      "2022-03": [
        309,
        60
      ],
      "2022-04": [
        238,
        38
      ],
      "2022-05": [
        269,
        47
      ],
      "2022-06": [
        272,
        43
      ],
      "2022-07": [
        273,
        34
      ],
      "2022-08": [
        253,
        42
      ],
      "2022-09": [
        291,
        54
      ],
      "2022-10": [
        313,
        50
      ],
      "2022-11": [
        311,
        45
      ],
      "2022-12": [
        299,
        42
      ],
      "2023-01": [
        266,
        64
      ],
      "2023-02": [
        282,
        48
      ],
      "2023-03": [
        333,
        41
      ],
      "2023-04": [
        298,
        39
      ],
      "2023-05": [
        344,
        44
      ],
      "2023-06": [
        346,
        50
      ],
      "2023-07": [
        320,
        46
      ],
      "2023-08": [
        300,
        47
      ],
      "2023-09": [
        273,
        43
      ],
      "2023-10": [
        370,
        50
      ],
      "2023-11": [
        313,
        50
      ],
      "2023-12": [
        312,
        43
      ],
      "2024-01": [
        343,
        55
      ],
      "2024-02": [
        348,
        56
      ],
      "2024-03": [
        352,
        84
      ],
      "2024-04": [
        331,
        51
      ],
      "2024-05": [
        380,
        42
      ],
      "2024-06": [
        304,
        45
      ],
      "2024-07": [
        349,
        57
      ],
      "2024-08": [
        292,
        40
      ],
      "2024-09": [
        344,
        50
      ],
      "2024-10": [
        388,
        59
      ],
      "2024-11": [
        312,
        58
      ],
      "2024-12": [
        333,
        50
      ],
      "2025-01": [
        314,
        60
      ],
      "2025-02": [
        340,
        50
      ],
      "2025-03": [
        350,
        50
      ],
      "2025-04": [
        333,
        66
      ],
      "2025-05": [
        342,
        52
      ],
      "2025-06": [
        379,
        49
      ],
      "2025-07": [
        369,
        56
      ],
      "2025-08": [
        345,
        49
      ],
      "2025-09": [
        189,
        34
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Nonlinear Reduction using the Extended Group Finite Element Method",
          "year": "2021-06",
          "abstract": "In this paper, we develop a nonlinear reduction framework based on our\nrecently introduced extended group finite element method. By interpolating\nnonlinearities onto approximation spaces defined with the help of finite\nelements, the extended group finite element formulation achieves a noticeable\nreduction in the computational overhead associated with nonlinear finite\nelement problems. However, the problem's size still leads to long solution\ntimes in most applications. Aiming to make real-time and/or many-query\napplications viable, we apply model order reduction and complexity reduction\ntechniques in order to reduce the problem size and efficiently handle the\nreduced nonlinear terms, respectively. For this work, we focus on the proper\northogonal decomposition and discrete empirical interpolation methods. While\nsimilar approaches based on the group finite element method only focus on\nsemilinear problems, our proposed framework is also compatible with quasilinear\nproblems. Compared to existing methods, our reduced models prove to be superior\nin many different aspects as demonstrated in three numerical benchmark\nproblems.",
          "arxiv_id": "2106.02372v1"
        },
        {
          "title": "Numerical Solution of Variable-Order Fractional Differential Equations Using Bernoulli Polynomials",
          "year": "2021-11",
          "abstract": "We introduce a new numerical method, based on Bernoulli polynomials, for\nsolving multiterm variable-order fractional differential equations. The\nvariable-order fractional derivative was considered in the Caputo sense, while\nthe Riemann--Liouville integral operator was used to give approximations for\nthe unknown function and its variable-order derivatives. An operational matrix\nof variable-order fractional integration was introduced for the Bernoulli\nfunctions. By assuming that the solution of the problem is sufficiently smooth,\nwe approximated a given order of its derivative using Bernoulli polynomials.\nThen, we used the introduced operational matrix to find some approximations for\nthe unknown function and its derivatives. Using these approximations and some\ncollocation points, the problem was reduced to the solution of a system of\nnonlinear algebraic equations. An error estimate is given for the approximate\nsolution obtained by the proposed method. Finally, five illustrative examples\nwere considered to demonstrate the applicability and high accuracy of the\nproposed technique, comparing our results with the ones obtained by existing\nmethods in the literature and making clear the novelty of the work. The\nnumerical results showed that the new method is efficient, giving high-accuracy\napproximate solutions even with a small number of basis functions and when the\nsolution to the problem is not infinitely differentiable, providing better\nresults and a smaller number of basis functions when compared to\nstate-of-the-art methods.",
          "arxiv_id": "2111.07413v1"
        },
        {
          "title": "Integration factor combined with level set method for reaction-diffusion systems with free boundary in high spatial dimensions",
          "year": "2022-09",
          "abstract": "For reaction-diffusion equations in irregular domain with moving boundaries,\nthe numerical stability constraints from the reaction and diffusion terms often\nrequire very restricted time step size, while complex geometries may lead to\ndifficulties in accuracy when discretizing the high-order derivatives on grid\npoints near the boundary. It is very challenging to design numerical methods\nthat can efficiently and accurately handle both difficulties. Applying an\nimplicit scheme may be able to remove the stability constraints on the time\nstep, however, it usually requires solving a large global system of nonlinear\nequations for each time step, and the computational cost could be significant.\nIntegration factor (IF) or exponential differencing time (ETD) methods are one\nof the popular methods for temporal partial differential equations (PDEs) among\nmany other methods. In our paper, we couple ETD methods with an embedded\nboundary method to solve a system of reaction-diffusion equations with complex\ngeometries. In particular, we rewrite all ETD schemes into a linear combination\nof specific {\\phi}-functions and apply one start-of-the-art algorithm to\ncompute the matrix-vector multiplications, which offers significant\ncomputational advantages with adaptive Krylov subspaces. In addition, we extend\nthis method by incorporating the level set method to solve the free boundary\nproblem. The accuracy, stability, and efficiency of the developed method are\ndemonstrated by numerical examples.",
          "arxiv_id": "2209.15095v1"
        }
      ],
      "1": [
        {
          "title": "A cardiac electromechanics model coupled with a lumped parameters model for closed-loop blood circulation. Part I: model derivation",
          "year": "2020-11",
          "abstract": "We propose an integrated electromechanical model of the human heart, with\nfocus on the left ventricle, wherein biophysically detailed models describe the\ndifferent physical phenomena concurring to the cardiac function. We model the\nsubcellular generation of active force by means of an Artificial Neural\nNetwork, which is trained by a suitable Machine Learning algorithm from a\ncollection of pre-computed numerical simulations of a biophysically detailed,\nyet computational demanding, high-fidelity model. To provide physiologically\nmeaningful results, we couple the 3D electromechanical model with a closed-loop\n0D (lumped parameters) model describing the blood circulation in the whole\ncardiovascular network. We prove that the 3D-0D coupling of the two models is\ncompliant with the principle of energy conservation, which is achieved in\nvirtue of energy-consistent boundary conditions that account for the\ninteraction among cardiac chambers within the computational domain, pericardium\nand surrounding tissue. We thus derive an overall balance of mechanical energy\nfor the 3D-0D model. This provides a quantitative insight into the energy\nutilization, dissipation and transfer among the different compartments of the\ncardiovascular network and during different stages of the heartbeat. In virtue\nof this new model and the energy balance, we propose a new validation tool of\nheart energy usage against relationships used in the daily clinical practice.\nFinally, we provide a mathematical formulation of an inverse problem aimed at\nrecovering the reference configuration of one or multiple cardiac chambers,\nstarting from the stressed configuration acquired from medical imaging. This is\nfundamental to correctly initialize electromechanical simulations. Numerical\nmethods and simulations of the 3D-0D model will be detailed in Part II.",
          "arxiv_id": "2011.15040v1"
        },
        {
          "title": "A Modular Framework for Implicit 3D-0D Coupling in Cardiac Mechanics",
          "year": "2023-10",
          "abstract": "In numerical simulations of cardiac mechanics, coupling the heart to a model\nof the circulatory system is essential for capturing physiological cardiac\nbehavior. A popular and efficient technique is to use an electrical circuit\nanalogy, known as a lumped parameter network or zero-dimensional (0D) fluid\nmodel, to represent blood flow throughout the cardiovascular system. Due to the\nstrong physical interaction between the heart and the blood circulation,\ndeveloping accurate and efficient numerical coupling methods remains an active\narea of research. In this work, we present a modular framework for implicitly\ncoupling three-dimensional (3D) finite element simulations of cardiac mechanics\nto 0D models of blood circulation. The framework is modular in that the\ncirculation model can be modified independently of the 3D finite element\nsolver, and vice versa. The numerical scheme builds upon a previous work that\ncombines 3D blood flow models with 0D circulation models (3D fluid - 0D fluid).\nHere, we extend it to couple 3D cardiac tissue mechanics models with 0D\ncirculation models (3D structure - 0D fluid), showing that both mathematical\nproblems can be solved within a unified coupling scheme. The effectiveness,\ntemporal convergence, and computational cost of the algorithm are assessed\nthrough multiple examples relevant to the cardiovascular modeling community.\nImportantly, in an idealized left ventricle example, we show that the coupled\nmodel yields physiological pressure-volume loops and naturally recapitulates\nthe isovolumic contraction and relaxation phases of the cardiac cycle without\nany additional numerical techniques. Furthermore, we provide a new derivation\nof the scheme inspired by the Approximate Newton Method of Chan (1985),\nexplaining how the proposed numerical scheme combines the stability of\nmonolithic approaches with the modularity and flexibility of partitioned\napproaches.",
          "arxiv_id": "2310.13780v1"
        },
        {
          "title": "A geometric multiscale model for the numerical simulation of blood flow in the human left heart",
          "year": "2021-10",
          "abstract": "We present a new computational model for the numerical simulation of blood\nflow in the human left heart. To this aim, we use the Navier-Stokes equations\nin an Arbitrary Lagrangian Eulerian formulation to account for the endocardium\nmotion and we model the cardiac valves by means of the Resistive Immersed\nImplicit Surface method. To impose a physiological displacement of the domain\nboundary, we use a 3D cardiac electromechanical model of the left ventricle\ncoupled to a lumped-parameter (0D) closed-loop model of the remaining\ncirculation. We thus obtain a one-way coupled electromechanics-fluid dynamics\nmodel in the left ventricle. To extend the left ventricle motion to the\nendocardium of the left atrium and to that of the ascending aorta, we introduce\na preprocessing procedure according to which an harmonic extension of the left\nventricle displacement is combined with the motion of the left atrium based on\nthe 0D model. To better match the 3D cardiac fluid flow with the external blood\ncirculation, we couple the 3D Navier-Stokes equations to the 0D circulation\nmodel, obtaining a multiscale coupled 3D-0D fluid dynamics model that we solve\nvia a segregated numerical scheme. We carry out numerical simulations for a\nhealthy left heart and we validate our model by showing that meaningful\nhemodynamic indicators are correctly reproduced.",
          "arxiv_id": "2110.02114v2"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:34:33Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}