{
  "topics": {
    "data": {
      "0": {
        "name": "0_quantum_algebra_algebras_category",
        "keywords": [
          [
            "quantum",
            0.05464682653857406
          ],
          [
            "algebra",
            0.05346418402850361
          ],
          [
            "algebras",
            0.05154142865963089
          ],
          [
            "category",
            0.029881020967829477
          ],
          [
            "group",
            0.029760208300875505
          ],
          [
            "theory",
            0.029203092535193258
          ],
          [
            "modules",
            0.025873965087466196
          ],
          [
            "type",
            0.023865090422603402
          ],
          [
            "categories",
            0.023788296463090365
          ],
          [
            "finite",
            0.022606406184278297
          ]
        ],
        "count": 4369
      },
      "1": {
        "name": "1_Baxter_solutions_Yang_algebras",
        "keywords": [
          [
            "Baxter",
            0.11389291780821399
          ],
          [
            "solutions",
            0.07480830776569812
          ],
          [
            "Yang",
            0.07233598420656911
          ],
          [
            "algebras",
            0.0671185161851135
          ],
          [
            "equation",
            0.06177230856935927
          ],
          [
            "Lie",
            0.057277425663002646
          ],
          [
            "Rota",
            0.051358796398307975
          ],
          [
            "operators",
            0.03557063279634879
          ],
          [
            "set",
            0.03161666771540419
          ],
          [
            "algebra",
            0.030860763222735652
          ]
        ],
        "count": 237
      }
    },
    "correlations": [
      [
        1.0,
        -0.4239638661508865
      ],
      [
        -0.4239638661508865,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        56,
        1
      ],
      "2020-02": [
        49,
        8
      ],
      "2020-03": [
        62,
        6
      ],
      "2020-04": [
        64,
        6
      ],
      "2020-05": [
        71,
        2
      ],
      "2020-06": [
        44,
        1
      ],
      "2020-07": [
        52,
        7
      ],
      "2020-08": [
        62,
        7
      ],
      "2020-09": [
        62,
        9
      ],
      "2020-10": [
        55,
        6
      ],
      "2020-11": [
        58,
        3
      ],
      "2020-12": [
        60,
        8
      ],
      "2021-01": [
        45,
        5
      ],
      "2021-02": [
        34,
        7
      ],
      "2021-03": [
        65,
        2
      ],
      "2021-04": [
        54,
        1
      ],
      "2021-05": [
        51,
        4
      ],
      "2021-06": [
        57,
        6
      ],
      "2021-07": [
        69,
        7
      ],
      "2021-08": [
        48,
        1
      ],
      "2021-09": [
        56,
        6
      ],
      "2021-10": [
        48,
        6
      ],
      "2021-11": [
        58,
        1
      ],
      "2021-12": [
        70,
        8
      ],
      "2022-01": [
        42,
        4
      ],
      "2022-02": [
        53,
        4
      ],
      "2022-03": [
        69,
        4
      ],
      "2022-04": [
        52,
        5
      ],
      "2022-05": [
        49,
        8
      ],
      "2022-06": [
        48,
        8
      ],
      "2022-07": [
        61,
        4
      ],
      "2022-08": [
        58,
        4
      ],
      "2022-09": [
        62,
        6
      ],
      "2022-10": [
        58,
        5
      ],
      "2022-11": [
        76,
        9
      ],
      "2022-12": [
        66,
        7
      ],
      "2023-01": [
        55,
        4
      ],
      "2023-02": [
        61,
        5
      ],
      "2023-03": [
        62,
        11
      ],
      "2023-04": [
        63,
        5
      ],
      "2023-05": [
        74,
        7
      ],
      "2023-06": [
        65,
        6
      ],
      "2023-07": [
        69,
        5
      ],
      "2023-08": [
        64,
        7
      ],
      "2023-09": [
        57,
        10
      ],
      "2023-10": [
        41,
        9
      ],
      "2023-11": [
        66,
        7
      ],
      "2023-12": [
        89,
        8
      ],
      "2024-01": [
        52,
        7
      ],
      "2024-02": [
        73,
        4
      ],
      "2024-03": [
        75,
        6
      ],
      "2024-04": [
        55,
        7
      ],
      "2024-05": [
        59,
        8
      ],
      "2024-06": [
        78,
        4
      ],
      "2024-07": [
        64,
        6
      ],
      "2024-08": [
        69,
        7
      ],
      "2024-09": [
        56,
        9
      ],
      "2024-10": [
        81,
        6
      ],
      "2024-11": [
        67,
        4
      ],
      "2024-12": [
        93,
        6
      ],
      "2025-01": [
        59,
        7
      ],
      "2025-02": [
        60,
        4
      ],
      "2025-03": [
        70,
        11
      ],
      "2025-04": [
        66,
        11
      ],
      "2025-05": [
        68,
        6
      ],
      "2025-06": [
        67,
        6
      ],
      "2025-07": [
        73,
        1
      ],
      "2025-08": [
        73,
        6
      ],
      "2025-09": [
        39,
        3
      ]
    },
    "papers": {
      "0": [
        {
          "title": "An algebraic theory for logarithmic Kazhdan-Lusztig correspondences",
          "year": "2023-06",
          "abstract": "Let $\\mathcal{U}$ be a braided tensor category, typically unknown,\ncomplicated and in particular non-semisimple. We characterize $\\mathcal{U}$\nunder the assumption that there exists a commutative algebra $A$ in\n$\\mathcal{U}$ with certain properties: Let $\\mathcal{C}$ be the category of\nlocal $A$-modules in $\\mathcal{U}$ and $\\mathcal{B}$ the category of\n$A$-modules in $\\mathcal{U}$, which are in our set-up usually much simpler\ncategories than $\\mathcal{U}$. Then we can characterize $\\mathcal{U}$ as a\nrelative Drinfeld center $\\mathcal{Z}_\\mathcal{C}(\\mathcal{B})$ and\n$\\mathcal{B}$ as representations of a certain Hopf algebra inside\n$\\mathcal{C}$.\n  In particular this allows us to reduce braided tensor equivalences to the\nknowledge of abelian equivalences, e.g. if we already know that $\\mathcal{U}$\nis abelian equivalent to the category of modules of some quantum group $U_q$ or\nsome generalization thereof, and if $\\mathcal{C}$ is braided equivalent to a\ncategory of graded vector spaces, and if $A$ has a certain form, then we\nalready obtain a braided tensor equivalence between $\\mathcal{U}$ and\n$\\mathrm{Rep}(U_q)$.\n  A main application of our theory is to prove logarithmic Kazhdan-Lusztig\ncorrespondences, that is, equivalences of braided tensor categories of\nrepresentations of vertex algebras and of quantum groups. Here, the algebra $A$\nand the corresponding category $\\mathcal{C}$ are a-priori given by a free-field\nrealization of the vertex algebra and by a Nichols algebra. We illustrate this\nin those examples where the representation theory of the vertex algebra is well\nenough understood. In particular we prove the conjectured correspondences\nbetween the singlet vertex algebra $\\mathcal{M}(p)$ and the unrolled small\nquantum groups of $\\mathfrak{sl}_2$ at $2p$-th root of unity. Another new\nexample is the Kazhdan-Lusztig correspondence for $\\mathfrak{gl}_{1|1}$.",
          "arxiv_id": "2306.11492v1"
        },
        {
          "title": "Representations of shifted quantum affine algebras",
          "year": "2020-10",
          "abstract": "We develop the representation theory of shifted quantum affine algebras\n$\\mathcal{U}_q^\\mu(\\hat{\\mathfrak{g}})$ and of their truncations which appeared\nin the study of quantized K-theoretic Coulomb branches of 3d $N = 4$ SUSY\nquiver gauge theories. Our approach is based on novel techniques, which are new\nin the cases of shifted Yangians or ordinary quantum affine algebras as well :\nrealization in terms of asymptotical subalgebras of the quantum affine algebra\n$\\mathcal{U}_q(\\hat{\\mathfrak{g}})$, induction and restriction functors to the\ncategory $\\mathcal{O}$ of representations of the Borel subalgebra\n$\\mathcal{U}_q(\\hat{\\mathfrak{b}})$ of $\\mathcal{U}_q(\\hat{\\mathfrak{g}})$,\nrelations between truncations and Baxter polynomiality in quantum integrable\nmodels, parametrization of simple modules via Langlands dual interpolation. We\nfirst introduce the category $\\mathcal{O}_\\mu$ of representations of\n$\\mathcal{U}_q^\\mu(\\hat{\\mathfrak{g}})$ and we classify its simple objects.\nThen we establish the existence of fusion products and we get a ring structure\non the sum of the Grothendieck groups $K_0(\\mathcal{O}_\\mu)$. We classify\nsimple finite-dimensional representations of\n$\\mathcal{U}_q^\\mu(\\hat{\\mathfrak{g}})$ and we obtain a cluster algebra\nstructure on the Grothendieck ring of finite-dimensional representations. We\nprove a truncation has only a finite number of simple representations and we\nintroduce a related partial ordering on simple modules. Eventually, we state a\nconjecture on the parametrization of simple modules of a non simply-laced\ntruncation in terms of the Langlands dual Lie algebra. We have several\nevidences, including a general result for simple finite-dimensional\nrepresentations.",
          "arxiv_id": "2010.06996v3"
        },
        {
          "title": "Vertex algebras with big center and a Kazhdan-Lusztig Correspondence",
          "year": "2022-10",
          "abstract": "Certain deformable families of vertex algebras acquire at a limit of the\ndeformation parameter a large center, similar to affine Lie algebras at\ncritical level. Then the vertex algebra and its representation category become\na bundle over the variety defined by this large center. The zero-fibre becomes\na vertex algebra, the other fibres become twisted modules over this vertex\nalgebra.\n  We explore these ideas and a conjectural correspondence in a class of vertex\nalgebras $A^{(p)}[\\mathfrak{g},\\kappa]$ associated to a choice of a\nfinite-dimensional semisimple Lie algebra and an integer $(\\mathfrak{g},p)$ and\na level $\\kappa$, and some related algebras. These algebras were introduced\nunder the name quantum geometric Langlands kernels and have an interpretation\nin 4-dimensional quantum field theory. In the limit $\\kappa\\to \\infty$, they\nacquire a large central subalgebra identified with the ring of functions on the\nspace of $\\mathfrak{g}$-connections. The zero fibre is expected to be the\nFeigin-Tipunin algebra $W_p(\\mathfrak{g})$, whose category of representations\nis expected to be equivalent to the small quantum group by the logarithmic\nKazhdan Lusztig conjecture.\n  Our rigorous results focus on the cases $(\\mathfrak{g},1)$ and\n$(\\mathfrak{sl}_2,2)$. In the first part of the paper, which might be of\nindependent interest, we discuss the twisted modules (including twists by\nunipotent elements) of the affine Lie algebra and of the triplet algebra\n$W_2(\\mathfrak{sl}_2)$, and introduce a method of twisted free field\nrealization to obtain twisted modules for arbitrary $(\\mathfrak{g},p)$. We also\nmatch our findings to the respective quantum group with big center. In the\nsecond part of the paper we match the results to the vertex algebra bundle we\ncompute from the limit of $A^{(p)}[\\mathfrak{g},\\kappa]$, which in our cases\nhave realizations as GKO coset resp. N=4 superconformal algebras.",
          "arxiv_id": "2210.13337v2"
        }
      ],
      "1": [
        {
          "title": "Rota-Baxter operators, differential operators, pre- and Novikov structures on groups and Lie algebras",
          "year": "2024-08",
          "abstract": "Rota-Baxter operators on various structures have found important applications\nin diverse areas, from renormalization of quantum field theory to Yang-Baxter\nequations. Relative Rota-Baxter operators on Lie algebras are closely related\nto pre-Lie algebras and post-Lie algebras. Some of their group counterparts\nhave been introduced to study post-groups, skew left braces and set-theoretic\nsolutions of Yang-Baxter equations, but searching suitable notions of relative\nRota-Baxter operators on groups with weight zero and pre-groups has been\nchallenging and has been the focus of recent studies, by provisionally imposing\nan abelian condition.\n  Arising from the works of Balinsky-Novikov and Gelfand-Dorfman, Novikov\nalgebras and their constructions from differential commutative algebras have\nled to broad applications. Finding their suitable counterparts for groups and\nLie algebras has also attracted quite much recent attention.\n  This paper uses one-sided-inverse pairs of maps to give a perturbative\napproach to a general notion of relative Rota-Baxter operators and differential\noperators on a group and a Lie algebra with limit-weight. With the extra\ncondition of limit-abelianess on the group or Lie algebra, we give an\ninterpretation of relative Rota-Baxter and differential operators with weight\nzero. These operators motivate us to define pre-groups and Novikov groups\nrespectively as the induced structures. The tangent maps of these operators are\nshown to give Rota-Baxter and differential operators with weight zero on Lie\nalgebras. The tangent spaces of the pre-Lie and Novikov Lie groups are pre-Lie\nalgebras and Novikov Lie algebras, fulfilling the expected property.\nFurthermore, limit-weight relative Rota-Baxter operators on groups give rise to\nskew left braces and then set-theoretic solutions of the Yang-Baxter equation.",
          "arxiv_id": "2408.06096v2"
        },
        {
          "title": "Rota-Baxter Lie bialgebras, classical Yang-Baxter equations and special L-dendriform bialgebras",
          "year": "2022-07",
          "abstract": "We establish a bialgebra structure on Rota-Baxter Lie algebras following the\nManin triple approach to Lie bialgebras. Explicitly, Rota-Baxter Lie bialgebras\nare characterized by generalizing matched pairs of Lie algebras and Manin\ntriples of Lie algebras to the context of Rota-Baxter Lie algebras. The\ncoboundary case leads to the introduction of the admissible classical\nYang-Baxter equation (CYBE) in Rota-Baxter Lie algebras, for which the\nantisymmetric solutions give rise to Rota-Baxter Lie bialgebras. The notions of\n$\\mathcal{O}$-operators on Rota-Baxter Lie algebras and Rota-Baxter pre-Lie\nalgebras are introduced to produce antisymmetric solutions of the admissible\nCYBE. Furthermore, extending the well-known property that a Rota-Baxter Lie\nalgebra of weight zero induces a pre-Lie algebra, the Rota-Baxter Lie bialgebra\nof weight zero induces a bialgebra structure of independent interest, namely\nthe special L-dendriform bialgebra, which is equivalent to a Lie group with a\nleft-invariant flat pseudo-metric in geometry. This induction is also\ncharacterized as the inductions between the corresponding Manin triples and\nmatched pairs. Finally, antisymmetric solutions of the admissible CYBE in a\nRota-Baxter Lie algebra of weight zero give special L-dendriform bialgebras. In\nparticular, both Rota-Baxter algebras of weight zero and Rota-Baxter pre-Lie\nalgebras of weight zero can be used to construct special L-dendriform algebras.",
          "arxiv_id": "2207.08703v1"
        },
        {
          "title": "Operator forms of nonhomogeneous associative classical Yang-Baxter equation",
          "year": "2020-07",
          "abstract": "This paper studies operator forms of the nonhomogeneous associative classical\nYang-Baxter equation (nhacYBe), extending and generalizing such studies for the\nclassical Yang-Baxter equation and associative Yang-Baxter equation that can be\ntracked back to the works of Semonov-Tian-Shansky and Kupershmidt on\nRota-Baxter Lie algebras and $\\mathcal{O}$-operators. In general, solutions of\nthe nhacYBe are characterized in terms of generalized $\\mathcal{O}$-operators.\nThe characterization can be given by the classical $\\mathcal{O}$-operators\nprecisely when the solutions satisfy an invariant condition. When the invariant\ncondition is compatible with a Frobenius algebra, such solutions have close\nrelationships with Rota-Baxter operators on the Frobenius algebra. In general,\nsolutions of the nhacYBe can be produced from Rota-Baxter operators, and then\nfrom $\\mathcal{O}$-operators when the solutions are taken in semi-direct\nproduct algebras. In the other direction, Rota-Baxter operators can be obtained\nfrom solutions of the nhacYBe in unitizations of algebras. Finally a\nclassifications of solutions of the nhacYBe satisfying the mentioned invariant\ncondition in all unital complex algebras of dimensions two and three are\nobtained. All these solutions are shown to come from Rota-Baxter operators.",
          "arxiv_id": "2007.10939v2"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:36:12Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}