{
  "topics": {
    "data": {
      "0": {
        "name": "0_algebras_algebra_Lie_modules",
        "keywords": [
          [
            "algebras",
            0.042158398186167075
          ],
          [
            "algebra",
            0.035691455020245885
          ],
          [
            "Lie",
            0.028577385295866113
          ],
          [
            "modules",
            0.018395501535575644
          ],
          [
            "finite",
            0.01826042296774981
          ],
          [
            "group",
            0.017255590194033197
          ],
          [
            "paper",
            0.01627869647193999
          ],
          [
            "matrices",
            0.015172021550177415
          ],
          [
            "dimensional",
            0.01477747994794599
          ],
          [
            "category",
            0.013430525798144445
          ]
        ],
        "count": 4151
      },
      "1": {
        "name": "1_rings_ring_lattices_lattice",
        "keywords": [
          [
            "rings",
            0.03570802726212832
          ],
          [
            "ring",
            0.029899564915872586
          ],
          [
            "lattices",
            0.0269628364261461
          ],
          [
            "lattice",
            0.024890919766827783
          ],
          [
            "finite",
            0.0228192983973496
          ],
          [
            "monoids",
            0.020835257443715997
          ],
          [
            "monoid",
            0.01884715739554983
          ],
          [
            "semigroup",
            0.01865591409961686
          ],
          [
            "semigroups",
            0.017967339691474953
          ],
          [
            "set",
            0.017022303310882184
          ]
        ],
        "count": 845
      },
      "2": {
        "name": "2_Baxter_Rota_algebras_operators",
        "keywords": [
          [
            "Baxter",
            0.11816277698167794
          ],
          [
            "Rota",
            0.09448777184041829
          ],
          [
            "algebras",
            0.0576498112016419
          ],
          [
            "operators",
            0.05590632465662587
          ],
          [
            "Lie",
            0.04291079475479494
          ],
          [
            "Yang",
            0.03863933172090546
          ],
          [
            "algebra",
            0.0374437765000164
          ],
          [
            "solutions",
            0.033058733964482896
          ],
          [
            "equation",
            0.030788118502976778
          ],
          [
            "relative",
            0.029255448031754065
          ]
        ],
        "count": 320
      },
      "3": {
        "name": "3_Leavitt_path_path algebras_algebras",
        "keywords": [
          [
            "Leavitt",
            0.11851185186745984
          ],
          [
            "path",
            0.1170869398159916
          ],
          [
            "path algebras",
            0.07854901823693193
          ],
          [
            "algebras",
            0.06607051979743059
          ],
          [
            "graph",
            0.0640667405724687
          ],
          [
            "graphs",
            0.0614171480318798
          ],
          [
            "path algebra",
            0.05046741633934019
          ],
          [
            "algebra",
            0.037363278894946096
          ],
          [
            "ideal",
            0.02212030816857836
          ],
          [
            "ideals",
            0.021315242785077543
          ]
        ],
        "count": 120
      }
    },
    "correlations": [
      [
        1.0,
        -0.02047150986440379,
        -0.41100398008645633,
        -0.5131771602100428
      ],
      [
        -0.02047150986440379,
        1.0,
        -0.666793491398529,
        -0.6460974752426795
      ],
      [
        -0.41100398008645633,
        -0.666793491398529,
        1.0,
        -0.4977105519921329
      ],
      [
        -0.5131771602100428,
        -0.6460974752426795,
        -0.4977105519921329,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        73,
        30,
        5,
        3
      ],
      "2020-02": [
        50,
        16,
        5,
        5
      ],
      "2020-03": [
        65,
        13,
        3,
        3
      ],
      "2020-04": [
        67,
        22,
        2,
        3
      ],
      "2020-05": [
        71,
        15,
        4,
        2
      ],
      "2020-06": [
        78,
        28,
        7,
        6
      ],
      "2020-07": [
        72,
        20,
        10,
        3
      ],
      "2020-08": [
        85,
        18,
        3,
        5
      ],
      "2020-09": [
        72,
        20,
        1,
        1
      ],
      "2020-10": [
        67,
        23,
        4,
        2
      ],
      "2020-11": [
        62,
        9,
        4,
        4
      ],
      "2020-12": [
        58,
        18,
        0,
        1
      ],
      "2021-01": [
        50,
        19,
        2,
        7
      ],
      "2021-02": [
        50,
        15,
        3,
        3
      ],
      "2021-03": [
        51,
        20,
        3,
        7
      ],
      "2021-04": [
        55,
        21,
        3,
        0
      ],
      "2021-05": [
        59,
        25,
        2,
        6
      ],
      "2021-06": [
        47,
        22,
        3,
        4
      ],
      "2021-07": [
        73,
        19,
        5,
        3
      ],
      "2021-08": [
        66,
        13,
        12,
        3
      ],
      "2021-09": [
        42,
        14,
        6,
        6
      ],
      "2021-10": [
        47,
        16,
        2,
        3
      ],
      "2021-11": [
        46,
        15,
        1,
        1
      ],
      "2021-12": [
        66,
        21,
        7,
        5
      ],
      "2022-01": [
        60,
        23,
        2,
        5
      ],
      "2022-02": [
        54,
        10,
        6,
        1
      ],
      "2022-03": [
        66,
        22,
        3,
        6
      ],
      "2022-04": [
        57,
        24,
        8,
        1
      ],
      "2022-05": [
        65,
        27,
        5,
        2
      ],
      "2022-06": [
        60,
        18,
        7,
        7
      ],
      "2022-07": [
        59,
        25,
        9,
        7
      ],
      "2022-08": [
        70,
        25,
        5,
        5
      ],
      "2022-09": [
        87,
        23,
        8,
        1
      ],
      "2022-10": [
        62,
        25,
        5,
        2
      ],
      "2022-11": [
        77,
        19,
        6,
        2
      ],
      "2022-12": [
        58,
        19,
        8,
        5
      ],
      "2023-01": [
        76,
        22,
        1,
        1
      ],
      "2023-02": [
        53,
        18,
        3,
        4
      ],
      "2023-03": [
        65,
        21,
        7,
        4
      ],
      "2023-04": [
        76,
        17,
        8,
        2
      ],
      "2023-05": [
        70,
        19,
        4,
        1
      ],
      "2023-06": [
        66,
        29,
        5,
        4
      ],
      "2023-07": [
        63,
        19,
        5,
        2
      ],
      "2023-08": [
        64,
        21,
        5,
        1
      ],
      "2023-09": [
        80,
        21,
        5,
        4
      ],
      "2023-10": [
        56,
        17,
        4,
        4
      ],
      "2023-11": [
        58,
        24,
        5,
        7
      ],
      "2023-12": [
        64,
        20,
        5,
        5
      ],
      "2024-01": [
        67,
        33,
        5,
        3
      ],
      "2024-02": [
        77,
        27,
        8,
        4
      ],
      "2024-03": [
        74,
        31,
        8,
        6
      ],
      "2024-04": [
        80,
        22,
        5,
        3
      ],
      "2024-05": [
        78,
        30,
        7,
        1
      ],
      "2024-06": [
        64,
        16,
        8,
        6
      ],
      "2024-07": [
        72,
        23,
        3,
        2
      ],
      "2024-08": [
        50,
        22,
        6,
        2
      ],
      "2024-09": [
        65,
        34,
        5,
        5
      ],
      "2024-10": [
        63,
        27,
        9,
        1
      ],
      "2024-11": [
        66,
        22,
        10,
        1
      ],
      "2024-12": [
        63,
        30,
        13,
        7
      ],
      "2025-01": [
        67,
        15,
        7,
        2
      ],
      "2025-02": [
        59,
        20,
        9,
        6
      ],
      "2025-03": [
        81,
        20,
        7,
        8
      ],
      "2025-04": [
        83,
        27,
        13,
        5
      ],
      "2025-05": [
        66,
        20,
        6,
        3
      ],
      "2025-06": [
        71,
        24,
        6,
        4
      ],
      "2025-07": [
        99,
        16,
        9,
        5
      ],
      "2025-08": [
        90,
        29,
        6,
        2
      ],
      "2025-09": [
        43,
        11,
        7,
        4
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Isotopisms of nilpotent Leibniz algebras and Lie racks",
          "year": "2023-02",
          "abstract": "In this paper we study the isotopism classes of two-step nilpotent algebras.\nWe show that every nilpotent Leibniz algebra $\\mathfrak{g}$ with\n$\\operatorname{dim}[\\mathfrak{g},\\mathfrak{g}]=1$ is isotopic to the Heisenberg\nLie algebra or to the Heisenberg algebra $\\mathfrak{l}_{2n+1}^{J_1}$, where\n$J_1$ is the $n \\times n$ Jordan block of eigenvalue 1. We also prove that two\nsuch algebras are isotopic if and only if the Lie racks integrating them are\nisotopic. This gives the classification of Lie racks whose tangent space at the\nunit element is a nilpotent Leibniz algebra with one-dimensional commutator\nideal. Eventually, we introduce new isotopism invariants for Leibniz algebras\nand Lie racks.",
          "arxiv_id": "2302.08306v2"
        },
        {
          "title": "Some applications of Gröbner-Shirshov bases to Lie algebras",
          "year": "2023-10",
          "abstract": "We show that if a countably generated Lie algebra $H$ does not contain\nisomorphic copies of certain finite-dimensional nilpotent Lie algebras $A$ and\n$B$ (satisfying some mild conditions), then $H$ embeds into a quotient of $A\n\\ast B$ that is at the same time hopfian and cohopfian. This is a Lie algebraic\nversion of an embedding theorem proved by C. Miller and P. Schupp for groups.\nWe also prove that any finitely presentable Lie algebra is the quotient of a\nfinitely presented, centerless, residually nilpotent and SQ-universal Lie\nalgebra of cohomological dimension at most $2$ by an ideal that can be\ngenerated by two elements as a Lie subalgebra. This is reminiscent of the Rips\nconstruction in group theory. In both results we use the theory of\nGr\\\"obner-Shirshov bases.",
          "arxiv_id": "2310.12331v1"
        },
        {
          "title": "Global Weyl modules for thin Lie algebras are finite-dimensional",
          "year": "2024-11",
          "abstract": "The notion of Weyl modules, both local and global, goes back to Chari and\nPressley in the case of affine Lie algebras, and has been extensively studied\nfor various Lie algebras graded by root systems. We extend that definition to a\ncertain class of Lie algebras graded by weight lattices and prove that if such\na Lie algebra satisfies a natural \"thinness\" condition, then already the global\nWeyl modules are finite-dimensional. Our motivating example of a thin Lie\nalgebra is the Lie algebra of polynomial Hamiltonian vector fields on the plane\nvanishing at the origin. We also introduce stratifications of categories of\nmodules over such Lie algebras and identify the corresponding strata\ncategories.",
          "arxiv_id": "2411.17550v1"
        }
      ],
      "1": [
        {
          "title": "Zero Insertive Nil Clean Rings",
          "year": "2025-08",
          "abstract": "This paper investigates key properties of ZINC rings and their relationships\nwith semicommutative and weakly semicommutative rings. We call an element $x$\nof a ring $R$ zero insertive if $x=arb$ for some $a,b,r\\in R$ such that $ab=0$\nand $ZI(R)$ denotes the set of all zero insertive elements of $R$. We establish\nthat a ring $R$ is semicommutative if and only if $ZI(R) \\subseteq E(R)$, and\nweakly semicommutative if and only if $ZI(R) \\subseteq N(R)$, where $E(R)$ and\n$N(R)$ denote respectively the sets of idempotent elements and nilpotent\nelements. For ZINC rings with no nontrivial idempotents, $ZI(R) \\subseteq\nN(R)$.\n  We prove that a finite direct product of ZINC rings is ZINC if and only if\neach component ring is ZINC, while an infinite direct product may fail to be\nZINC. For $n \\geq 2$, if $M_n(R)$ is ZINC, then $R$ is weakly clean, however,\nthe converse is not true (e.g., $\\mathbb{Z}$). Additionally, $M_n(K)$ is ZINC\nfor a division ring $K$ if and only if $K \\cong \\mathbb{F}_2$. We, also,\npresent a ZINC ring whose polynomial and power series extensions are not ZINC.",
          "arxiv_id": "2508.01333v1"
        },
        {
          "title": "Connections between commutative rings and some algebras of logic",
          "year": "2022-05",
          "abstract": "In this paper using the connections between some subvarieties of residuated\nlattices, we investigated some properties of the lattice of ideals in\ncommutative and unitary rings. We give new characterizations for commutative\nrings $A$ in which $Id(A)$ is an MV-algebra, a Heyting algebra or a Boolean\nalgebra and we establish connections between these types of rings. We are very\ninterested in the finite case and we present summarizing statistics. We show\nthat the lattice of ideals in a finite commutative ring of the form $A=%\n\\mathbb{Z}_{k_{1}}\\times \\mathbb{Z}_{k_{2}}\\times ...\\times \\mathbb{Z}%\n_{k_{r}},$ where $k_{i}=p_{i}^{\\alpha _{i}}$ and $p_{i}$ a prime number, for\nall $i\\in \\{1,2,...,r\\},$ \\ is a Boolean algebra or an MV-algebra (which is not\nBoolean).\n  Using this result we generate the binary block codes associated to the\nlattice of ideals in finite commutative rings and we present a new way to\ngenerate all (up to an isomorphism) finite MV-algebras using rings.",
          "arxiv_id": "2205.11431v2"
        },
        {
          "title": "The lattice and semigroup structure of multipermutations",
          "year": "2021-03",
          "abstract": "We study the algebraic properties of binary relations whose underlying\ndigraph is smooth, that is has no source or sink. Such objects have been\nstudied as surjective hyper-operations (shops) on the corresponding vertex set,\nand as binary relations that are defined everywhere and whose inverse is also\ndefined everywhere. In the latter formulation, they have been called\nmultipermutations. We study the lattice structure of sets (monoids) of\nmultipermutations over an n-element domain. Through a Galois connection, these\nmonoids form the algebraic counterparts to sets of relations closed under\ndefinability in positive first-order logic without equality. The first side of\nthis Galois connection has been elaborated previously, we show the other side\nhere. We study the property of inverse on multipermutations and how it connects\nour monoids to groups. We use our results to give a simple dichotomy theorem\nfor the evaluation problem of positive first-order logic without equality on\nthe class of structures whose preserving multipermutations form a monoid closed\nunder inverse. These problems turn out either to be in Logspace or to be\nPspace-complete. We go on to study the monoid of all multipermutations on an\nn-element domain, under usual composition of relations. We characterise its\nGreen relations, regular elements and show that it does not admit a generating\nset that is polynomial on n.",
          "arxiv_id": "2103.06012v1"
        }
      ],
      "2": [
        {
          "title": "Lie n-algebras and cohomologies of relative Rota-Baxter operators on n-Lie algebras",
          "year": "2021-08",
          "abstract": "Based on the differential graded Lie algebra controlling deformations of an\n$n$-Lie algebra with a representation (called an n-LieRep pair), we construct a\nLie n-algebra, whose Maurer-Cartan elements characterize relative Rota-Baxter\noperators on n-LieRep pairs. The notion of an n-pre-Lie algebra is introduced,\nwhich is the underlying algebraic structure of the relative Rota-Baxter\noperator. We give the cohomology of relative Rota-Baxter operators and study\ninfinitesimal deformations and extensions of order m deformations to order m+1\ndeformations of relative Rota-Baxter operators through the cohomology groups of\nrelative Rota-Baxter operators. Moreover, we build the relation between the\ncohomology groups of relative Rota-Baxter operators on n-LieRep pairs and those\non (n+1)-LieRep pairs by certain linear functions.",
          "arxiv_id": "2108.04076v1"
        },
        {
          "title": "Rota-Baxter operators, differential operators, pre- and Novikov structures on groups and Lie algebras",
          "year": "2024-08",
          "abstract": "Rota-Baxter operators on various structures have found important applications\nin diverse areas, from renormalization of quantum field theory to Yang-Baxter\nequations. Relative Rota-Baxter operators on Lie algebras are closely related\nto pre-Lie algebras and post-Lie algebras. Some of their group counterparts\nhave been introduced to study post-groups, skew left braces and set-theoretic\nsolutions of Yang-Baxter equations, but searching suitable notions of relative\nRota-Baxter operators on groups with weight zero and pre-groups has been\nchallenging and has been the focus of recent studies, by provisionally imposing\nan abelian condition.\n  Arising from the works of Balinsky-Novikov and Gelfand-Dorfman, Novikov\nalgebras and their constructions from differential commutative algebras have\nled to broad applications. Finding their suitable counterparts for groups and\nLie algebras has also attracted quite much recent attention.\n  This paper uses one-sided-inverse pairs of maps to give a perturbative\napproach to a general notion of relative Rota-Baxter operators and differential\noperators on a group and a Lie algebra with limit-weight. With the extra\ncondition of limit-abelianess on the group or Lie algebra, we give an\ninterpretation of relative Rota-Baxter and differential operators with weight\nzero. These operators motivate us to define pre-groups and Novikov groups\nrespectively as the induced structures. The tangent maps of these operators are\nshown to give Rota-Baxter and differential operators with weight zero on Lie\nalgebras. The tangent spaces of the pre-Lie and Novikov Lie groups are pre-Lie\nalgebras and Novikov Lie algebras, fulfilling the expected property.\nFurthermore, limit-weight relative Rota-Baxter operators on groups give rise to\nskew left braces and then set-theoretic solutions of the Yang-Baxter equation.",
          "arxiv_id": "2408.06096v2"
        },
        {
          "title": "Extended Rota-Baxter algebras, diagonally colored Delannoy paths and Hopf algebras",
          "year": "2024-01",
          "abstract": "The Rota-Baxter operator and the modified Rota-Baxter operator on various\nalgebras are both important in mathematics and mathematical physics. The former\nis originated from the integration-by-parts formula and probability with\napplications to the renormalization of quantum field theory and the classical\nYang-Baxter equation. The latter originated from Hilbert transformations with\napplications to ergodic theory and the modified Yang-Baxter equation. Their\nmerged form, called the extended Rota-Baxter operators, has also found\ninteresting applications recently.\n  This paper presents a systematic study of the extended Rota-Baxter operator.\nWe show that while extended Rota-Baxter operators have properties similar to\nRota-Baxter operators; they provide a linear structure that unifies Rota-Baxter\noperators and modified Rota-Baxter operators. Examples of extended Rota-Baxter\noperators are also given, especially from polynomials and Laurent series due to\ntheir importance in ($q$-)integration and the renormalization in quantum field\ntheory. We then construct free commutative extended Rota-Baxter operators by a\ngeneralization of the quasi-shuffle product. The multiplication of the initial\nobject in the category of commutative extended Rota-Baxter operators allows a\ncombinatorial interpretation in terms of a color-enrichment of Delannoy paths.\nApplying its universal property, we equip a free commutative extended\nRota-Baxter operators with a coproduct which has a cocycle condition, yielding\na bialgebraic structure. We then show that this bialgebra on a free extended\nRota-Baxter operators possesses an increasing filtration and a connectedness\nproperty, culminating at a Hopf algebraic structure on a free commutative\nextended Rota-Baxter operator.",
          "arxiv_id": "2401.11363v2"
        }
      ],
      "3": [
        {
          "title": "On the ideals of ultragraph Leavitt path algebras",
          "year": "2021-09",
          "abstract": "In this article, we provide an explicit description of a set of generators\nfor any ideal of an ultragraph Leavitt path algebra. We provide several\nadditional consequences of this description, including information about\ngenerating sets for graded ideals, the graded uniqueness and Cuntz-Krieger\ntheorems, the semiprimeness, and the semiprimitivity of ultragraph Leavitt path\nalgebras, a complete characterization of the prime and primitive ideals of an\nultragraph Leavitt path algebra. We also show that every primitive ideal of an\nultragraph Leavitt path algebra is exactly the annihilator of a Chen simple\nmodule. Consequently, we prove Exel's Effros-Hahn conjecture on primitive\nideals in the ultragraph Leavitt path algebra setting (a conclusion that is\nalso new in the context of Leavitt path algebras of graphs).",
          "arxiv_id": "2109.10440v1"
        },
        {
          "title": "A note on the regular ideals of Leavitt path algebras",
          "year": "2020-06",
          "abstract": "We show that, for an arbitrary graph, a regular ideal of the associated\nLeavitt path algebra is also graded. As a consequence, for a row-finite graph,\nwe obtain that the quotient of the associated Leavitt path by a regular ideal\nis again a Leavitt path algebra and that Condition~(L) is preserved by\nquotients by regular ideals. Furthermore, we describe the vertex set of a\nregular ideal and make a comparison between the theory of regular ideals in\nLeavitt path algebras and in graph C*-algebras.",
          "arxiv_id": "2006.03634v3"
        },
        {
          "title": "Realizing ultragraph Leavitt path algebras as Steinberg algebras",
          "year": "2020-08",
          "abstract": "In this article, we realize ultragraph Leavitt path algebras as Steinberg\nalgebras. This realization allows us to use the groupoid approach to obtain\nstructural results about these algebras. Using skew product groupoid, we show\nthat ultragraph Leavitt path algebras are graded von Neumann regular rings. We\ncharacterize strongly graded ultragraph Leavitt path algebras and show that\nevery ultragraph Leavitt path algebra is semiprimitive. Moreover, we\ncharacterize irreducible representations of ultragraph Leavitt path algebras.\nWe also show that ultragraph Leavitt path algebras can be realized as\nCuntz-Pimsner rings.",
          "arxiv_id": "2008.04668v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:36:19Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}