{
  "topics": {
    "data": {
      "0": {
        "name": "0_theory_homotopy_group_groups",
        "keywords": [
          [
            "theory",
            0.032365007973323236
          ],
          [
            "homotopy",
            0.03019459123134654
          ],
          [
            "group",
            0.028098607935432684
          ],
          [
            "groups",
            0.02749064862100847
          ],
          [
            "category",
            0.02742963345381196
          ],
          [
            "spaces",
            0.025412703334438277
          ],
          [
            "cohomology",
            0.02440236465534581
          ],
          [
            "homology",
            0.022655647914468998
          ],
          [
            "space",
            0.022562283170141535
          ],
          [
            "categories",
            0.020414955324797448
          ]
        ],
        "count": 5007
      },
      "1": {
        "name": "1_data_persistence_persistent_topological",
        "keywords": [
          [
            "data",
            0.052118106684459764
          ],
          [
            "persistence",
            0.04912048408435451
          ],
          [
            "persistent",
            0.040203299293066465
          ],
          [
            "topological",
            0.038215213683289055
          ],
          [
            "homology",
            0.0341263775097069
          ],
          [
            "persistent homology",
            0.031064723665760588
          ],
          [
            "analysis",
            0.0290148360328173
          ],
          [
            "data analysis",
            0.01956053703122628
          ],
          [
            "features",
            0.017723233134308243
          ],
          [
            "modules",
            0.017564982526580918
          ]
        ],
        "count": 909
      }
    },
    "correlations": [
      [
        1.0,
        -0.400046142831902
      ],
      [
        -0.400046142831902,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        77,
        13
      ],
      "2020-02": [
        83,
        8
      ],
      "2020-03": [
        68,
        9
      ],
      "2020-04": [
        68,
        12
      ],
      "2020-05": [
        69,
        10
      ],
      "2020-06": [
        83,
        17
      ],
      "2020-07": [
        89,
        11
      ],
      "2020-08": [
        60,
        16
      ],
      "2020-09": [
        71,
        7
      ],
      "2020-10": [
        67,
        19
      ],
      "2020-11": [
        83,
        15
      ],
      "2020-12": [
        73,
        20
      ],
      "2021-01": [
        56,
        9
      ],
      "2021-02": [
        63,
        12
      ],
      "2021-03": [
        72,
        19
      ],
      "2021-04": [
        64,
        12
      ],
      "2021-05": [
        78,
        14
      ],
      "2021-06": [
        76,
        17
      ],
      "2021-07": [
        73,
        17
      ],
      "2021-08": [
        58,
        18
      ],
      "2021-09": [
        70,
        17
      ],
      "2021-10": [
        72,
        15
      ],
      "2021-11": [
        71,
        13
      ],
      "2021-12": [
        74,
        17
      ],
      "2022-01": [
        62,
        17
      ],
      "2022-02": [
        73,
        7
      ],
      "2022-03": [
        84,
        20
      ],
      "2022-04": [
        61,
        14
      ],
      "2022-05": [
        70,
        13
      ],
      "2022-06": [
        57,
        23
      ],
      "2022-07": [
        74,
        14
      ],
      "2022-08": [
        79,
        13
      ],
      "2022-09": [
        77,
        15
      ],
      "2022-10": [
        85,
        11
      ],
      "2022-11": [
        78,
        18
      ],
      "2022-12": [
        65,
        20
      ],
      "2023-01": [
        72,
        14
      ],
      "2023-02": [
        62,
        15
      ],
      "2023-03": [
        89,
        20
      ],
      "2023-04": [
        62,
        11
      ],
      "2023-05": [
        87,
        9
      ],
      "2023-06": [
        77,
        20
      ],
      "2023-07": [
        65,
        19
      ],
      "2023-08": [
        89,
        11
      ],
      "2023-09": [
        68,
        16
      ],
      "2023-10": [
        86,
        25
      ],
      "2023-11": [
        82,
        23
      ],
      "2023-12": [
        91,
        19
      ],
      "2024-01": [
        65,
        10
      ],
      "2024-02": [
        76,
        11
      ],
      "2024-03": [
        70,
        17
      ],
      "2024-04": [
        65,
        10
      ],
      "2024-05": [
        92,
        10
      ],
      "2024-06": [
        85,
        18
      ],
      "2024-07": [
        81,
        9
      ],
      "2024-08": [
        74,
        15
      ],
      "2024-09": [
        67,
        10
      ],
      "2024-10": [
        92,
        18
      ],
      "2024-11": [
        84,
        23
      ],
      "2024-12": [
        76,
        19
      ],
      "2025-01": [
        61,
        9
      ],
      "2025-02": [
        53,
        12
      ],
      "2025-03": [
        83,
        15
      ],
      "2025-04": [
        65,
        18
      ],
      "2025-05": [
        84,
        20
      ],
      "2025-06": [
        80,
        16
      ],
      "2025-07": [
        84,
        12
      ],
      "2025-08": [
        83,
        8
      ],
      "2025-09": [
        43,
        7
      ]
    },
    "papers": {
      "0": [
        {
          "title": "On filtered algebraic $K$-theory of stacks I: characteristic zero",
          "year": "2025-03",
          "abstract": "Given a compact Lie group $G$ acting on a space $X$, the classical\nAtiyah-Segal completion theorem identifies topological $K$-theory of the\nhomotopy quotient $X/G$ with an explicit completion of $G$-equivariant\ntopological $K$-theory of $X$. We prove an analog of this result for algebraic\n$K$-theory over a field of characteristic 0. In our setting $G$ is a reductive\ngroup that acts on a derived algebraic space $X$ with the assumption that all\nstabilizer groups are nice (in the sense of Alper). Our main result identifies\nthe value $R^{\\mathrm{dAff}}K([X/G])$ of right Kan extension of the $K$-theory\nfunctor from schemes to stacks with the completion of $K$-theory of the\ncategory $\\mathrm{Perf}([X/G])$ at the augmentation ideal of\n$K_0(\\mathrm{Rep}(G))$. The main novelty of our results is that $X$ is allowed\nto be singular or even derived. This generality is achieved by employing and\nimproving analogous versions of completion theorem for negative cyclic homology\n(after Ben-Zvi--Nadler and Chen) and for homotopy $K$-theory (after van den\nBergh--Tabuada). We also show that in the singular setting the completion\ntheorem does not necessarily hold without the nice stabilizer assumption. We\nview our results as a part of the general paradigm of extending the motivic\nfiltration on algebraic $K$-theory of schemes to algebraic $K$-theory of\nstacks.",
          "arxiv_id": "2503.09928v1"
        },
        {
          "title": "The inverse limit topology and profinite descent on Picard groups in $K(n)$-local homotopy theory",
          "year": "2023-09",
          "abstract": "In this paper, we study profinite descent theory for Picard groups in\n$K(n)$-local homotopy theory through their inverse limit topology. Building\nupon Burklund's result on the multiplicative structures of generalized Moore\nspectra, we prove that the module category over a $K(n)$-local commutative ring\nspectrum is equivalent to the limit of its base changes by a tower of\ngeneralized Moore spectra of type $n$. As a result, the $K(n)$-local Picard\ngroups are endowed with a natural inverse limit topology. This topology allows\nus to identify the entire $E_1$ and $E_2$-pages of a descent spectral sequence\nfor Picard spaces of $K(n)$-local profinite Galois extensions.\n  Our main examples are $K(n)$-local Picard groups of homotopy fixed points\n$E_n^{hG}$ of the Morava $E$-theory $E_n$ for all closed subgroups $G$ of the\nMorava stabilizer group $\\mathbb{G}_n$. The $G=\\mathbb{G}_n$ case has been\nstudied by Heard and Mor. At height $1$, we compute Picard groups of $E_1^{hG}$\nfor all closed subgroups $G$ of $\\mathbb{G}_1=\\mathbb{Z}_p^\\times$ at all\nprimes as a Mackey functor.",
          "arxiv_id": "2309.05039v3"
        },
        {
          "title": "Stabilization and costabilization with respect to an action of a monoidal category",
          "year": "2021-02",
          "abstract": "We study actions of monoidal categories on objects in a suitably enriched\n$2$-category, and applications in stable homotopy theory. Given a monoidal\ncategory $\\mathcal{I}$ and an $\\mathcal{I}$-object $\\mathcal{A}$, the\n(co)stabilization of $\\mathcal{A}$ is obtained by universally forcing the\n$\\mathcal{I}$-action to be reversible so that every object of $\\mathcal{I}$\nacts on $\\mathcal{A}$ by auto-equivalences. We introduce a notion of\n$\\mathcal{I}$-equivariance for morphisms between $\\mathcal{I}$-objects and give\nconstructions of stabilization and costabilization in terms of weak ends and\ncoends in an enriched $2$-category of $\\mathcal{I}$-objects and\n$\\mathcal{I}$-equivariant morphisms. We observe that the stabilization of a\nrelative category with respect to an action coincides with the usual notion of\nstabilization in stable homotopy theory when the action is defined by loop\nspace functors. We show that several examples that exist in the literature,\nincluding various categories of spectra, fit into our setting after fixing\n$\\mathcal{A}$ and the $\\mathcal{I}$-action on it. In particular, categories of\nsequential spectra, coordinate free spectra, genuine equivariant spectra,\nparameterized spectra indexed by vector bundles are obtained in terms of weak\nends in the $2$-category of relative categories. On the other hand, the\ncostabilization of a relative category with respect to an action gives a stable\nrelative category akin to a version Spanier-Whitehead category. In particular,\nwe establish a form of duality between constructions of stable homotopy\ncategories by spectra and by Spanier-Whitehead like categories.",
          "arxiv_id": "2102.00999v2"
        }
      ],
      "1": [
        {
          "title": "The Christoffel-Darboux kernel for topological data analysis",
          "year": "2022-11",
          "abstract": "Persistent homology has been widely used to study the topology of point\nclouds in $\\mathbb{R}^n$. Standard approaches are very sensitive to outliers,\nand their computational complexity depends badly on the number of data points.\nIn this paper we introduce a novel persistence module for a point cloud using\nthe theory of Christoffel-Darboux kernels. This module is robust to\n(statistical) outliers in the data, and can be computed in time linear in the\nnumber of data points. We illustrate the benefits and limitations of our new\nmodule with various numerical examples in $\\mathbb{R}^n$, for $n=1, 2, 3$. Our\nwork expands upon recent applications of Christoffel-Darboux kernels in the\ncontext of statistical data analysis and geometric inference (Lasserre, Pauwels\nand Putinar, 2022). There, these kernels are used to construct a polynomial\nwhose level sets capture the geometry of a point cloud in a precise sense. We\nshow that the persistent homology associated to the sublevel set filtration of\nthis polynomial is stable with respect to the Wasserstein distance. Moreover,\nwe show that the persistent homology of this filtration can be computed in\nsingly exponential time in the ambient dimension $n$, using a recent algorithm\nof Basu & Karisani (2022).",
          "arxiv_id": "2211.15489v1"
        },
        {
          "title": "A Framework for Fast and Stable Representations of Multiparameter Persistent Homology Decompositions",
          "year": "2023-06",
          "abstract": "Topological data analysis (TDA) is an area of data science that focuses on\nusing invariants from algebraic topology to provide multiscale shape\ndescriptors for geometric data sets such as point clouds. One of the most\nimportant such descriptors is {\\em persistent homology}, which encodes the\nchange in shape as a filtration parameter changes; a typical parameter is the\nfeature scale. For many data sets, it is useful to simultaneously vary multiple\nfiltration parameters, for example feature scale and density. While the\ntheoretical properties of single parameter persistent homology are well\nunderstood, less is known about the multiparameter case. In particular, a\ncentral question is the problem of representing multiparameter persistent\nhomology by elements of a vector space for integration with standard machine\nlearning algorithms. Existing approaches to this problem either ignore most of\nthe multiparameter information to reduce to the one-parameter case or are\nheuristic and potentially unstable in the face of noise. In this article, we\nintroduce a new general representation framework that leverages recent results\non {\\em decompositions} of multiparameter persistent homology. This framework\nis rich in information, fast to compute, and encompasses previous approaches.\nMoreover, we establish theoretical stability guarantees under this framework as\nwell as efficient algorithms for practical computation, making this framework\nan applicable and versatile tool for analyzing geometric and point cloud data.\nWe validate our stability results and algorithms with numerical experiments\nthat demonstrate statistical convergence, prediction accuracy, and fast running\ntimes on several real data sets.",
          "arxiv_id": "2306.11170v1"
        },
        {
          "title": "Topological Machine Learning for Mixed Numeric and Categorical Data",
          "year": "2020-03",
          "abstract": "Topological data analysis is a relatively new branch of machine learning that\nexcels in studying high dimensional data, and is theoretically known to be\nrobust against noise. Meanwhile, data objects with mixed numeric and\ncategorical attributes are ubiquitous in real-world applications. However,\ntopological methods are usually applied to point cloud data, and to the best of\nour knowledge there is no available framework for the classification of mixed\ndata using topological methods. In this paper, we propose a novel topological\nmachine learning method for mixed data classification. In the proposed method,\nwe use theory from topological data analysis such as persistent homology,\npersistence diagrams and Wasserstein distance to study mixed data. The\nperformance of the proposed method is demonstrated by experiments on a\nreal-world heart disease dataset. Experimental results show that our\ntopological method outperforms several state-of-the-art algorithms in the\nprediction of heart disease.",
          "arxiv_id": "2003.04584v2"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:30:39Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}