{
  "topics": {
    "data": {
      "0": {
        "name": "0_equations_integrable_systems_equation",
        "keywords": [
          [
            "equations",
            0.030733844595328942
          ],
          [
            "integrable",
            0.02620351785162778
          ],
          [
            "systems",
            0.024339408518343108
          ],
          [
            "equation",
            0.022570600563758883
          ],
          [
            "hierarchy",
            0.02256737815937826
          ],
          [
            "Lie",
            0.017913736967841844
          ],
          [
            "solutions",
            0.016685270152270545
          ],
          [
            "dimensional",
            0.01642688333165923
          ],
          [
            "Hamiltonian",
            0.014708435939011772
          ],
          [
            "non",
            0.014561025157708275
          ]
        ],
        "count": 973
      },
      "1": {
        "name": "1_equation_solutions_soliton_nonlinear",
        "keywords": [
          [
            "equation",
            0.04756559394064049
          ],
          [
            "solutions",
            0.04599378496453885
          ],
          [
            "soliton",
            0.041035303341916324
          ],
          [
            "nonlinear",
            0.03270627678668228
          ],
          [
            "wave",
            0.025235791306570932
          ],
          [
            "equations",
            0.02261773624668079
          ],
          [
            "problem",
            0.022191891802499572
          ],
          [
            "waves",
            0.021139544612799436
          ],
          [
            "solution",
            0.021109478253061538
          ],
          [
            "solitons",
            0.02015223704091152
          ]
        ],
        "count": 604
      },
      "2": {
        "name": "2_quantum_model_spin_integrable",
        "keywords": [
          [
            "quantum",
            0.04047619089291534
          ],
          [
            "model",
            0.03476867178153289
          ],
          [
            "spin",
            0.02791846140866457
          ],
          [
            "integrable",
            0.026624873623924843
          ],
          [
            "chain",
            0.0249900698001706
          ],
          [
            "dynamics",
            0.02450007266985787
          ],
          [
            "models",
            0.02381422857596413
          ],
          [
            "time",
            0.022065492700210125
          ],
          [
            "Bethe",
            0.018189925166058572
          ],
          [
            "states",
            0.01770929590054124
          ]
        ],
        "count": 216
      },
      "3": {
        "name": "3_Baxter_Yang_maps_tetrahedron",
        "keywords": [
          [
            "Baxter",
            0.10007272996763192
          ],
          [
            "Yang",
            0.09152504780846298
          ],
          [
            "maps",
            0.07907267135200412
          ],
          [
            "tetrahedron",
            0.05395789223848995
          ],
          [
            "equation",
            0.044035757306636475
          ],
          [
            "matrix",
            0.03826070626815404
          ],
          [
            "solutions",
            0.03414784916272351
          ],
          [
            "operators",
            0.029112220373562373
          ],
          [
            "map",
            0.02875944062256185
          ],
          [
            "set",
            0.021421123232466446
          ]
        ],
        "count": 78
      }
    },
    "correlations": [
      [
        1.0,
        -0.4439977529704622,
        -0.20762868715980942,
        -0.601864656939954
      ],
      [
        -0.4439977529704622,
        1.0,
        -0.5496895358056071,
        -0.48155989915361375
      ],
      [
        -0.20762868715980942,
        -0.5496895358056071,
        1.0,
        -0.5900893775023384
      ],
      [
        -0.601864656939954,
        -0.48155989915361375,
        -0.5900893775023384,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        12,
        17,
        6,
        4
      ],
      "2020-02": [
        14,
        10,
        8,
        1
      ],
      "2020-03": [
        19,
        8,
        15,
        2
      ],
      "2020-04": [
        13,
        16,
        4,
        1
      ],
      "2020-05": [
        10,
        16,
        4,
        2
      ],
      "2020-06": [
        18,
        12,
        4,
        0
      ],
      "2020-07": [
        17,
        8,
        8,
        2
      ],
      "2020-08": [
        20,
        18,
        6,
        2
      ],
      "2020-09": [
        20,
        13,
        4,
        3
      ],
      "2020-10": [
        17,
        12,
        5,
        2
      ],
      "2020-11": [
        21,
        10,
        9,
        1
      ],
      "2020-12": [
        22,
        14,
        14,
        4
      ],
      "2021-01": [
        24,
        11,
        5,
        2
      ],
      "2021-02": [
        16,
        12,
        6,
        0
      ],
      "2021-03": [
        17,
        15,
        9,
        3
      ],
      "2021-04": [
        19,
        17,
        6,
        2
      ],
      "2021-05": [
        13,
        12,
        10,
        4
      ],
      "2021-06": [
        18,
        14,
        3,
        5
      ],
      "2021-07": [
        18,
        12,
        4,
        1
      ],
      "2021-08": [
        13,
        9,
        6,
        1
      ],
      "2021-09": [
        19,
        19,
        6,
        5
      ],
      "2021-10": [
        13,
        11,
        9,
        2
      ],
      "2021-11": [
        17,
        17,
        4,
        0
      ],
      "2021-12": [
        23,
        11,
        2,
        4
      ],
      "2022-01": [
        21,
        14,
        9,
        3
      ],
      "2022-02": [
        9,
        14,
        9,
        3
      ],
      "2022-03": [
        19,
        15,
        5,
        2
      ],
      "2022-04": [
        10,
        9,
        9,
        2
      ],
      "2022-05": [
        14,
        15,
        5,
        2
      ],
      "2022-06": [
        14,
        11,
        9,
        0
      ],
      "2022-07": [
        17,
        15,
        8,
        1
      ],
      "2022-08": [
        22,
        12,
        8,
        1
      ],
      "2022-09": [
        20,
        5,
        4,
        0
      ],
      "2022-10": [
        16,
        10,
        7,
        3
      ],
      "2022-11": [
        19,
        13,
        10,
        2
      ],
      "2022-12": [
        21,
        18,
        7,
        2
      ],
      "2023-01": [
        22,
        13,
        4,
        1
      ],
      "2023-02": [
        14,
        7,
        5,
        3
      ],
      "2023-03": [
        20,
        9,
        8,
        4
      ],
      "2023-04": [
        17,
        16,
        9,
        2
      ],
      "2023-05": [
        21,
        12,
        5,
        3
      ],
      "2023-06": [
        16,
        8,
        10,
        1
      ],
      "2023-07": [
        21,
        18,
        7,
        2
      ],
      "2023-08": [
        15,
        11,
        7,
        2
      ],
      "2023-09": [
        14,
        14,
        10,
        2
      ],
      "2023-10": [
        12,
        13,
        10,
        4
      ],
      "2023-11": [
        18,
        9,
        7,
        3
      ],
      "2023-12": [
        20,
        12,
        7,
        6
      ],
      "2024-01": [
        17,
        6,
        5,
        2
      ],
      "2024-02": [
        16,
        19,
        13,
        3
      ],
      "2024-03": [
        21,
        9,
        4,
        4
      ],
      "2024-04": [
        13,
        14,
        7,
        0
      ],
      "2024-05": [
        17,
        12,
        13,
        5
      ],
      "2024-06": [
        16,
        17,
        5,
        1
      ],
      "2024-07": [
        18,
        18,
        9,
        1
      ],
      "2024-08": [
        13,
        7,
        7,
        3
      ],
      "2024-09": [
        18,
        14,
        10,
        3
      ],
      "2024-10": [
        21,
        14,
        9,
        3
      ],
      "2024-11": [
        16,
        17,
        9,
        3
      ],
      "2024-12": [
        29,
        25,
        9,
        2
      ],
      "2025-01": [
        21,
        11,
        3,
        4
      ],
      "2025-02": [
        8,
        17,
        7,
        3
      ],
      "2025-03": [
        20,
        14,
        7,
        5
      ],
      "2025-04": [
        20,
        19,
        8,
        7
      ],
      "2025-05": [
        10,
        14,
        8,
        3
      ],
      "2025-06": [
        18,
        9,
        6,
        3
      ],
      "2025-07": [
        17,
        14,
        9,
        4
      ],
      "2025-08": [
        17,
        15,
        5,
        4
      ],
      "2025-09": [
        12,
        2,
        5,
        1
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Polynomial algebras from $su(3)$ and the generic model on the two sphere",
          "year": "2020-07",
          "abstract": "Construction of superintegrable systems based on Lie algebras have been\nintroduced over the years. However, these approaches depend on explicit\nrealisations, for instance as a differential operators, of the underlying Lie\nalgebra. This is also the case for the construction of their related symmetry\nalgebra which take usually the form of a finitely generated quadratic algebra.\nThese algebras often display structure constants which depend on the central\nelements and in particular on the Hamiltonian. In this paper, we develop a new\napproach reexamining the case of the generic superintegrable systems on the\n2-sphere for which a symmetry algebra is known to be the Racah algebra $R(3)$.\nSuch a model is related to the 59 $2D$ superintegrable systems on conformally\nflat spaces and their 12 equivalence classes. We demonstrate that using further\npolynomials of degree 2,3 and 4 in the enveloping algebra of $su(3)$ one can\ngenerate an algebra based only on abstract commutation relations of $su(3)$ Lie\nalgebra without explicit constraints on the representations or realisations.\nThis construction relies on the maximal Abelian subalgebra, also called MASA,\nwhich are the Cartan generators and their commutant. We obtain a new\n6-dimensional cubic algebra where the structure constant are integer numbers\nwhich reduce from a quartic algebra for which the structure constant depend on\nthe Cartan generator and the Casimir invariant. We also present other form of\nthe symmetry algebra using the quadratic and cubic Casimir invariants of\n$su(3)$. It reduces as the known quadratic Racah algebra $R(3)$ only when using\nan explicit realization. This algebraic structure describe the symmetry of the\ngeneric superintegrable systems on the 2 sphere. We also present a contraction\nto another 6-dimensional cubic algebra which would corresponding to the\nsymmetry algebra of a Smorodinsky-Winternitz model.",
          "arxiv_id": "2007.11163v1"
        },
        {
          "title": "On matrix Lax representations and constructions of Miura-type transformations for differential-difference equations",
          "year": "2024-10",
          "abstract": "This paper is part of a research project on relations between\ndifferential-difference matrix Lax representations (MLRs) with the action of\ngauge transformations and discrete Miura-type transformations (MTs) for\n(nonlinear) integrable differential-difference equations.\n  The paper addresses the following problem:\n  when and how can one eliminate some shifts of dependent variables from the\ndiscrete (difference) part of an MLR by means of gauge transformations?\n  Using results on this problem, we present applications to constructing new\nMLRs and new integrable equations connected by new MTs to known equations.\n  In particular, we obtain results of this kind for equations connected to the\nfollowing ones:\n  - The two-component Belov--Chaltikian lattice.\n  - The equation (introduced by G. Mari Beffa and Jing Ping Wang) which\ndescribes the evolution induced on invariants by an invariant evolution of\nplanar polygons.\n  - An equation from [S. Igonin, arXiv:2405.08579] related to the Toda lattice\nin the Flaschka--Manakov coordinates.",
          "arxiv_id": "2410.01474v2"
        },
        {
          "title": "Semi-discrete Lagrangian 2-forms and the Toda hierarchy",
          "year": "2022-04",
          "abstract": "We present a variational theory of integrable differential-difference\nequations (semi-discrete integrable systems). This is a natural extension of\nthe ideas known by the names \"Lagrangian multiforms\" and \"Pluri-Lagrangian\nsystems\", which have previously been established in both the fully discrete and\nfully continuous cases. The main feature of these ideas is to capture a\nhierarchy of commuting equations in a single variational principle. Our main\nexample to illustrate the new semi-discrete theory of Lagrangian multiforms is\nthe Toda lattice. This ODE describes the evolution in continuous time of a\n1-dimensional lattice of particles with nearest-neighbour interaction. It is\npart of an integrable hierarchy of ODEs, each of which involves a derivative\nwith respect to a continuous variable and a number of lattice shifts. We will\nuse the Lagrangian multiform theory to derive PDEs in the continuous variables\nof the Toda hierarchy, which do not involve any lattice shifts. As a second\nexample, we briefly discuss the semi-discrete potential KdV equation, which is\nrelated to the Volterra lattice.",
          "arxiv_id": "2204.13063v3"
        }
      ],
      "1": [
        {
          "title": "Bound-state soliton and rogue wave solutions for the sixth-order nonlinear Schrödinger equation via inverse scattering transform method",
          "year": "2021-03",
          "abstract": "In this work, inverse scattering transform for the sixth-order nonlinear\nSchr\\\"{o}dinger equation with both zero and nonzero boundary conditions at\ninfinity is given, respectively. For the case of zero nonzero boundary\nconditions, in terms of the Laurent's series and generalization of the residue\ntheorem, the bound-state soliton is derived. For nonzero boundary conditions,\nusing the robust inverse scattering transform, we present a matrix\nRiemann-Hilbert problem of the sixth-order nonlinear Schr\\\"{o}dinger equation.\nThen based on the obtained Riemann-Hilbert problem, the rogue wave and breather\nwave solutions are derived through a modified Darboux transformation. Besides,\naccording to some appropriate parameters choices, several graphical analyses\nare provided to discuss the dynamical behaviors of the bound-state soliton and\nrogue wave solutions, and analyse how the higher-order terms affect the\nbound-state soliton and rogue wave.",
          "arxiv_id": "2103.14296v2"
        },
        {
          "title": "Inverse scattering transform and soliton solutions for the modified matrix Korteweg-de Vries equation with nonzero boundary conditions",
          "year": "2020-05",
          "abstract": "The theory of inverse scattering is developed to study the initial-value\nproblem for the modified matrix Korteweg-de Vries (mmKdV) equation with the\n$2m\\times2m$ $(m\\geq 1)$ Lax pairs under the nonzero boundary conditions at\ninfinity. In the direct problem, by introducing a suitable uniform\ntransformation we establish the proper complex $z$-plane in order to discuss\nthe Jost eigenfunctions, scattering matrix and their analyticity and symmetry\nof the equation. Moreover the asymptotic behavior of the Jost functions and\nscattering matrix needed in the inverse problem are analyzed via\nWentzel-Kramers-Brillouin expansion. In the inverse problem, the generalized\nRiemann-Hilbert problem of the mmKdV equation is first established by using the\nanalyticity of the modified eigenfunctions and scattering coefficients. The\nreconstruction formula of potential function with reflection-less case is\nderived by solving this Riemann-Hilbert problem and using the scattering data.\nIn addition the dynamic behavior of the solutions for the focusing mmKdV\nequation including one- and two- soliton solutions are presented in detail\nunder the the condition that the potential is scalar and the $2\\times2$\nsymmetric matrix. Finally, we provide some detailed proofs and weak version of\ntrace formulas to show that the asymptotic phase of the potential and the\nscattering data.",
          "arxiv_id": "2005.00290v1"
        },
        {
          "title": "Long-time asymptotics of the coupled nonlinear Schödinger equation in a weighted Sobolev space",
          "year": "2025-04",
          "abstract": "We study the Cauchy problem for the focusing coupled nonlinear Schr\\\"odinger\n(CNLS) equation with initial data $\\mathbf{q}_0$ lying in the weighted Sobolev\nspace and the scattering data having $n$ simple zeros. Based on the\ncorresponding $3\\times3$ matrix spectral problem, we deduce the Riemann-Hilbert\nproblem (RHP) for CNLS equation through inverse scattering transform. We remove\ndiscrete spectrum of initial RHP using Darboux transformations. By applying the\nnonlinear steepest-descent method for RHP introduced by Deift and Zhou, we\ncompute the long-time asymptotic expansion of the solution $\\mathbf{q}(x,t)$ to\nan (optimal) residual error of order $\\mathcal{O}\\left(t^{-3 /\n4+1/(2p)}\\right)$ where $2\\le p<\\infty$. The leading order term in this\nexpansion is a multi-soliton whose parameters are modulated by soliton-soliton\nand soliton-radiation interactions. Our work strengthens and extends the\nearlier work regarding long-time asymptotics for solutions of the nonlinear\nSchr\\\"odinger equation with a delta potential and even initial data by Deift\nand Park.",
          "arxiv_id": "2504.21315v2"
        }
      ],
      "2": [
        {
          "title": "Non-equilibrium dynamics of the open quantum $O(n)$-model with non-Markovian noise: exact results",
          "year": "2021-06",
          "abstract": "The collective and purely relaxational dynamics of quantum many-body systems\nafter a quench at temperature $T=0$, from a disordered state to various phases\nis studied through the exact solution of the quantum Langevin equation of the\nspherical and the $O(n)$-model in the limit $n\\to\\infty$. The stationary state\nof the quantum dynamics is shown to be a non-equilibrium state. The quantum\nspherical and the quantum $O(n)$-model for $n\\to\\infty$ are in the same\ndynamical universality class. The long-time behaviour of single-time and\ntwo-time correlation and response functions is analysed and the universal\nexponents which characterise quantum coarsening and quantum ageing are derived.\nThe importance of the non-Markovian long-time memory of the quantum noise is\nelucidated by comparing it with an effective Markovian noise having the same\nscaling behaviour and with the case of non-equilibrium classical dynamics.",
          "arxiv_id": "2106.08237v2"
        },
        {
          "title": "The quantum sine-Gordon model with quantum circuits",
          "year": "2020-07",
          "abstract": "Analog quantum simulation has the potential to be an indispensable technique\nin the investigation of complex quantum systems. In this work, we numerically\ninvestigate a one-dimensional, faithful, analog, quantum electronic circuit\nsimulator built out of Josephson junctions for one of the paradigmatic models\nof an integrable quantum field theory: the quantum sine-Gordon (qSG) model in\n1+1 space-time dimensions. We analyze the lattice model using the density\nmatrix renormalization group technique and benchmark our numerical results with\nexisting Bethe ansatz computations. Furthermore, we perform analytical\nform-factor calculations for the two-point correlation function of vertex\noperators, which closely agree with our numerical computations. Finally, we\ncompute the entanglement spectrum of the qSG model. We compare our results with\nthose obtained using the integrable lattice-regularization based on the quantum\nXYZ chain and show that the quantum circuit model is less susceptible to\ncorrections to scaling compared to the XYZ chain. We provide numerical evidence\nthat the parameters required to realize the qSG model are accessible with\nmodern-day superconducting circuit technology, thus providing additional\ncredence towards the viability of the latter platform for simulating strongly\ninteracting quantum field theories.",
          "arxiv_id": "2007.06874v2"
        },
        {
          "title": "An integrable spin chain with Hilbert space fragmentation and solvable real time dynamics",
          "year": "2021-05",
          "abstract": "We revisit the so-called folded XXZ model, which was treated earlier by two\nindependent research groups. We argue that this spin-1/2 chain is one of the\nsimplest quantum integrable models, yet it has quite remarkable physical\nproperties. The particles have constant scattering lengths, which leads to a\nsimple treatment of the exact spectrum and the dynamics of the system. The\nHilbert space of the model is fragmented, leading to exponentially large\ndegeneracies in the spectrum, such that the exponent depends on the particle\ncontent of a given state. We provide an alternative derivation of the\nHamiltonian and the conserved charges of the model, including a new\ninterpretation of the so-called \"dual model\" considered earlier. We also\nconstruct a non-local map that connects the model with the Maassarani-Mathieu\nspin chain, also known as the SU(3) XX model. We consider the exact solution of\nthe model with periodic and open boundary conditions, and also derive multiple\ndescriptions of the exact thermodynamics of the model. We consider quantum\nquenches of different types. In one class of problems the dynamics can be\ntreated relatively easily: we compute an example for the real time dependence\nof a local observable. In another class of quenches the degeneracies of the\nmodel lead to the breakdown of equilibration, and we argue that they can lead\nto persistent oscillations. We also discuss connections with the $T\\bar T$- and\nhard rod deformations known from Quantum Field Theories.",
          "arxiv_id": "2105.02252v1"
        }
      ],
      "3": [
        {
          "title": "Tropical limit of matrix solitons and entwining Yang-Baxter maps",
          "year": "2020-01",
          "abstract": "We consider a matrix refactorization problem, i.e., a \"Lax representation\",\nfor the Yang-Baxter map that originated as the map of polarizations from the\n\"pure\" 2-soliton solution of a matrix KP equation. Using the Lax matrix and its\ninverse, a related refactorization problem determines another map, which is not\na solution of the Yang-Baxter equation, but satisfies a mixed version of the\nYang-Baxter equation together with the Yang-Baxter map. Such maps have been\ncalled \"entwining Yang-Baxter maps\" in recent work. In fact, the map of\npolarizations obtained from a pure 2-soliton solution of a matrix KP equation,\nand already for the matrix KdV reduction, is NOT in general a Yang-Baxter map,\nbut it is described by one of the two maps or their inverses. We clarify why\nthe weaker version of the Yang-Baxter equation holds, by exploring the pure\n3-soliton solution in the \"tropical limit\", where the 3-soliton interaction\ndecomposes into 2-soliton interactions. Here this is elaborated for pure\nsoliton solutions, generated via a binary Darboux transformation, of matrix\ngeneralizations of the two-dimensional Toda lattice equation, where we meet the\nsame entwining Yang-Baxter maps as in the KP case, indicating a kind of\nuniversality.",
          "arxiv_id": "2001.09688v3"
        },
        {
          "title": "Tetrahedron maps, Yang-Baxter maps, and partial linearisations",
          "year": "2021-06",
          "abstract": "We study tetrahedron maps, which are set-theoretical solutions to the\nZamolodchikov tetrahedron equation, and Yang-Baxter maps, which are\nset-theoretical solutions to the quantum Yang-Baxter equation.\n  In particular, we clarify the structure of the nonlinear algebraic relations\nwhich define linear (parametric) tetrahedron maps (with nonlinear dependence on\nparameters), and we present several transformations which allow one to obtain\nnew such maps from known ones. Furthermore, we prove that the differential of a\n(nonlinear) tetrahedron map on a manifold is a tetrahedron map as well. Similar\nresults on the differentials of Yang-Baxter and entwining Yang-Baxter maps are\nalso presented.\n  Using the obtained general results, we construct new examples of (parametric)\nYang-Baxter and tetrahedron maps. The considered examples include maps\nassociated with integrable systems and matrix groups. In particular, we obtain\na parametric family of new linear tetrahedron maps, which are linear\napproximations for the nonlinear tetrahedron map constructed by Dimakis and\nM\\\"uller-Hoissen [arXiv:1708.05694] in a study of soliton solutions of vector\nKadomtsev-Petviashvili (KP) equations. Also, we present invariants for this\nnonlinear tetrahedron map.",
          "arxiv_id": "2106.09130v2"
        },
        {
          "title": "Local Yang--Baxter correspondences and set-theoretical solutions to the Zamolodchikov tetrahedron equation",
          "year": "2023-02",
          "abstract": "We study tetrahedron maps, which are set-theoretical solutions to the\nZamolodchikov tetrahedron equation, and their matrix Lax representations\ndefined by the local Yang--Baxter equation.\n  Sergeev [S.M. Sergeev 1998 Lett. Math. Phys. 45, 113--119] presented\nclassification results on three-dimensional tetrahedron maps obtained from the\nlocal Yang--Baxter equation for a certain class of matrix-functions in the\nsituation when the equation possesses a unique solution which determines a\ntetrahedron map. In this paper, using correspondences arising from the local\nYang--Baxter equation for some simple $2\\times 2$ matrix-functions, we show\nthat there are (non-unique) solutions to the local Yang--Baxter equation which\ndefine tetrahedron maps that do not belong to the Sergeev list; this paves the\nway for a new, wider classification of tetrahedron maps. We present invariants\nfor the derived tetrahedron maps and prove Liouville integrability for some of\nthem.\n  Furthermore, using the approach of solving correspondences arising from the\nlocal Yang--Baxter equation, we obtain several new birational tetrahedron maps,\nincluding maps with matrix Lax representations on arbitrary groups, a\n$9$-dimensional map associated with a Darboux transformation for the derivative\nnonlinear Schr\\\"odinger (NLS) equation, and a $9$-dimensional generalisation of\nthe $3$-dimensional Hirota map.",
          "arxiv_id": "2302.03059v2"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:37:48Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}