{
  "topics": {
    "data": {
      "0": {
        "name": "0_nonlinear_solitons_soliton_equation",
        "keywords": [
          [
            "nonlinear",
            0.03760752969752597
          ],
          [
            "solitons",
            0.033975235991791176
          ],
          [
            "soliton",
            0.030636833984255894
          ],
          [
            "equation",
            0.02891406438663552
          ],
          [
            "wave",
            0.02809297825537476
          ],
          [
            "solutions",
            0.02486269736602686
          ],
          [
            "waves",
            0.024786420371086026
          ],
          [
            "dynamics",
            0.018255533592896746
          ],
          [
            "states",
            0.01732231368258961
          ],
          [
            "equations",
            0.016434854907657625
          ]
        ],
        "count": 2107
      },
      "1": {
        "name": "1_model_patterns_systems_dynamics",
        "keywords": [
          [
            "model",
            0.032726869995964344
          ],
          [
            "patterns",
            0.030402643906753922
          ],
          [
            "systems",
            0.02525035180011558
          ],
          [
            "dynamics",
            0.023464134481945176
          ],
          [
            "pattern",
            0.021769570796194137
          ],
          [
            "diffusion",
            0.020454597856042745
          ],
          [
            "states",
            0.01755757628895118
          ],
          [
            "spatial",
            0.017050316767287646
          ],
          [
            "phase",
            0.016337061337771887
          ],
          [
            "formation",
            0.016073270551697477
          ]
        ],
        "count": 965
      }
    },
    "correlations": [
      [
        1.0,
        -0.20227333672232845
      ],
      [
        -0.20227333672232845,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        31,
        13
      ],
      "2020-02": [
        21,
        13
      ],
      "2020-03": [
        36,
        9
      ],
      "2020-04": [
        35,
        12
      ],
      "2020-05": [
        41,
        14
      ],
      "2020-06": [
        36,
        14
      ],
      "2020-07": [
        51,
        14
      ],
      "2020-08": [
        33,
        15
      ],
      "2020-09": [
        39,
        18
      ],
      "2020-10": [
        39,
        18
      ],
      "2020-11": [
        36,
        11
      ],
      "2020-12": [
        42,
        25
      ],
      "2021-01": [
        31,
        12
      ],
      "2021-02": [
        44,
        15
      ],
      "2021-03": [
        44,
        5
      ],
      "2021-04": [
        38,
        15
      ],
      "2021-05": [
        44,
        9
      ],
      "2021-06": [
        36,
        8
      ],
      "2021-07": [
        36,
        7
      ],
      "2021-08": [
        32,
        6
      ],
      "2021-09": [
        31,
        7
      ],
      "2021-10": [
        32,
        9
      ],
      "2021-11": [
        29,
        16
      ],
      "2021-12": [
        29,
        14
      ],
      "2022-01": [
        27,
        12
      ],
      "2022-02": [
        23,
        13
      ],
      "2022-03": [
        40,
        11
      ],
      "2022-04": [
        25,
        10
      ],
      "2022-05": [
        32,
        14
      ],
      "2022-06": [
        30,
        10
      ],
      "2022-07": [
        31,
        17
      ],
      "2022-08": [
        39,
        13
      ],
      "2022-09": [
        23,
        11
      ],
      "2022-10": [
        30,
        18
      ],
      "2022-11": [
        32,
        13
      ],
      "2022-12": [
        50,
        13
      ],
      "2023-01": [
        34,
        11
      ],
      "2023-02": [
        21,
        8
      ],
      "2023-03": [
        31,
        15
      ],
      "2023-04": [
        31,
        15
      ],
      "2023-05": [
        28,
        16
      ],
      "2023-06": [
        35,
        12
      ],
      "2023-07": [
        36,
        11
      ],
      "2023-08": [
        32,
        15
      ],
      "2023-09": [
        30,
        9
      ],
      "2023-10": [
        32,
        8
      ],
      "2023-11": [
        27,
        11
      ],
      "2023-12": [
        25,
        14
      ],
      "2024-01": [
        33,
        12
      ],
      "2024-02": [
        28,
        11
      ],
      "2024-03": [
        28,
        23
      ],
      "2024-04": [
        28,
        17
      ],
      "2024-05": [
        43,
        9
      ],
      "2024-06": [
        33,
        9
      ],
      "2024-07": [
        42,
        14
      ],
      "2024-08": [
        22,
        9
      ],
      "2024-09": [
        36,
        15
      ],
      "2024-10": [
        36,
        14
      ],
      "2024-11": [
        36,
        7
      ],
      "2024-12": [
        34,
        14
      ],
      "2025-01": [
        27,
        9
      ],
      "2025-02": [
        29,
        13
      ],
      "2025-03": [
        33,
        11
      ],
      "2025-04": [
        41,
        8
      ],
      "2025-05": [
        33,
        6
      ],
      "2025-06": [
        19,
        18
      ],
      "2025-07": [
        40,
        14
      ],
      "2025-08": [
        28,
        14
      ],
      "2025-09": [
        9,
        5
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Higher dimensional localized and periodic wave dynamics in a new integrable (2+1)-dimensional Kundu-Mukherjee-Naskar model",
          "year": "2020-01",
          "abstract": "In this article, a new integrable (2+1)-dimensional Kundu-Mukherjee-Naskar\nmodel which is a variant of the well known nonlinear Schr\\\"odinger equation is\ninvestigated. Bright-dark optical solitons along with periodic waves,\ncomplexiton and rational solutions are constructed by employing a generalized\ntraveling wave analysis, Jacobian-elliptic function, Riccati equation and\nansatz approach. Further, the dynamics of these bright/dark optical solitons\nand complexiton/periodic waves are studied by exploring the importance of\narbitrary physical parameters with graphical demonstrations for a clear\nunderstanding. The obtained higher dimensional nonlinear wave solutions of this\nintegrable system shall have useful applications in different physical systems\nincluding the dynamics of beam propagation in optical fibers, ion-acoustic\nwaves in magnetized plasma and deep water oceanic rogue waves.",
          "arxiv_id": "2001.06766v1"
        },
        {
          "title": "Propagation of periodic and solitary waves in a highly dispersive cubic-quintic medium with self-frequency shift and self-steepening nonlinearity",
          "year": "2022-05",
          "abstract": "We study the dynamics of femtosecond light pulse propagation in a\ncubic-quintic medium exhibiting dispersive effect up to the fourth order as\nwell as self-frequency shift and self-steepening nonlinearity. A rich variety\nof periodic and solitary wave solutions are derived for the governing\ngeneralized higher-order nonlinear Schr\\\"{o}dinger equation in the presence of\nself-frequency shift and self-steepening effects. It is found that the\nfrequency shift, inverse velocity, amplitude and wave number of both periodic\nand solitary waves depend on dispersion coefficients and nonlinearity\nparameters as well. The conditions on optical fiber parameters for the\nexistence of these structures are presented. The stability of these periodic\nand solitary wave solutions is studied numerically by adding white noise. It is\nproved by using the numerical split-step Fourier method that the profile of\nthese nonlinear waves remains unchanged during evolution.",
          "arxiv_id": "2205.10975v1"
        },
        {
          "title": "Optical soliton solutions of the Biswas-Arshed model by the $\\tan(\\circleddash/2)$ expansion approach",
          "year": "2020-07",
          "abstract": "In this paper, we consider the Biswas-Arshed model (BAM) with nonlinear Kerr\nand power law. We integrate these nonlinear structures of the BAM to obtain\noptical exact solitons that passing through the optical fibers. To retrieve the\nsolutions, we apply the $\\tan(\\circleddash/2)$ expansion integral scheme to the\nstructures of the BAM nonlinearity. The novel solutions present optical shock\nwave, double periodic optical solitons, interaction between optical periodic\nwave and optical solitons, and optical periodic and rogue waves for both\nstructures of the model. It is shown that the amplitude of the periodic double\nsolitons waves gradually increases and reached the highest peak at the moment\nof interaction, and it goes to diminish for a much larger time. In fact, we\nshow that the amplitude of the wave for the interaction between periodic and\noptical solitons, gradually increases with beat phenomena. To the purpose, all\nthese types of optical solitons can be frequently used to amplify or reduce\nwaves for a certain hight. Moreover, we describe the physical phenomena of the\nsolitons in graphically.",
          "arxiv_id": "2007.12643v1"
        }
      ],
      "1": [
        {
          "title": "Spatiotemporal instabilities and pattern formation in systems of diffusively coupled Izhikevich neurons",
          "year": "2021-09",
          "abstract": "Neurons are often connected, spatially and temporally, in phenomenal ways\nthat promote wave propagation. Therefore, it is essential to analyze the\nemergent spatiotemporal patterns to understand the working mechanism of brain\nactivity, especially in cortical areas. Here, we present an explicit\nmathematical analysis, corroborated by numerical results, to identify and\ninvestigate the spatiotemporal, non-uniform, patterns that emerge due to\ninstability in an extended homogeneous 2D spatial domain, using the excitable\nIzhikevich neuron model. We examine diffusive instability and perform\nbifurcation and fixed-point analyses to characterize the patterns and their\nstability. Then, we derive analytically the amplitude equations that establish\nthe activities of reaction-diffusion structures. We report on the emergence of\ndiverse spatial structures including hexagonal and mixed-type patterns by\nproviding a systematic mathematical approach, including variations in\ncorrelated oscillations, pattern variations and amplitude fluctuations. Our\nwork shows that the emergence of spatiotemporal behavior, commonly found in\nexcitable systems, has the potential to contribute significantly to the study\nof diffusively-coupled biophysical systems at large.",
          "arxiv_id": "2109.05966v1"
        },
        {
          "title": "Fixed and Distributed Gene Expression Time Delays in Reaction-Diffusion Systems",
          "year": "2022-05",
          "abstract": "Time delays, modelling the process of intracellular gene expression, have\nbeen shown to have important impacts on the dynamics of pattern formation in\nreaction-diffusion systems. In particular, past work has shown that such time\ndelays can shrink the Turing space, thereby inhibiting patterns from forming\nacross large ranges of parameters. Such delays can also increase the time taken\nfor pattern formation even when Turing instabilities occur. Here we consider\nreaction-diffusion models incorporating fixed or distributed time delays,\nmodelling the underlying stochastic nature of gene expression dynamics, and\nanalyze these through a systematic linear instability analysis and numerical\nsimulations for several sets of different reaction kinetics. We find that even\ncomplicated distribution kernels (skewed Gaussian probability density\nfunctions) have little impact on the reaction-diffusion dynamics compared to\nfixed delays with the same mean delay. We show that the location of the delay\nterms in the model can lead to changes in the size of the Turing space\n(increasing or decreasing) as the mean time delay, $\\tau$, is increased. We\nshow that the time to pattern formation from a perturbation of the homogeneous\nsteady state scales linearly with $\\tau$, and conjecture that this is a general\nimpact of time delay on reaction-diffusion dynamics, independent of the form of\nthe kinetics or location of the delayed terms. Finally we show that while\ninitial and boundary conditions can influence these dynamics, particularly the\ntime-to-pattern, the effects of delay appear robust under variations of initial\nand boundary data. Overall our results help clarify the role of gene expression\ntime delays in reaction-diffusion patterning, and suggest clear directions for\nfurther work in studying more realistic models of pattern formation.",
          "arxiv_id": "2205.05410v2"
        },
        {
          "title": "Beyond water limitation in vegetation-autotoxicity patterning: a cross-diffusion model",
          "year": "2025-06",
          "abstract": "Many mathematical models describing vegetation patterns are based on\nbiomass--water interactions, due to the impact of this limited resource in arid\nand semi-arid environments. However, in recent years, a novel biological factor\ncalled autotoxicity has proved to play a key role in vegetation spatiotemporal\ndynamics, particularly by inhibiting biomass growth and increasing its natural\nmortality rate. In a standard reaction-diffusion framework, biomass-toxicity\ndynamics alone are unable to support the emergence of stable spatial patterns.\nIn this paper, we derive a cross-diffusion model for biomass and toxicity\ndynamics as the fast-reaction limit of a three-species system involving\ndichotomy and different time scales. Within this general framework, in addition\nto growth inhibition and extra-mortality already considered in previous\nstudies, the additional effect of ''propagation reduction'' induced by\nautotoxicity on vegetation dynamics is obtained. By combining linearised\nanalysis, simulations, and continuation, we investigate the formation of\nspatial patterns. Thanks to the cross-diffusion term, for the first time, a\nspatial model based solely on biomass-toxicity feedback without explicit water\ndynamics supports the formation of stable (Turing) vegetation patterns for a\nwide range of parameter values.",
          "arxiv_id": "2506.03981v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:37:44Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}