{
  "topics": {
    "data": {
      "0": {
        "name": "0_energy_electron_molecular_quantum",
        "keywords": [
          [
            "energy",
            0.030169792851997383
          ],
          [
            "electron",
            0.026276140468703753
          ],
          [
            "molecular",
            0.02610466110600604
          ],
          [
            "quantum",
            0.025498098494982326
          ],
          [
            "molecules",
            0.024535532741948318
          ],
          [
            "state",
            0.02202615231431651
          ],
          [
            "dynamics",
            0.02052765940837176
          ],
          [
            "states",
            0.020474602386204223
          ],
          [
            "time",
            0.019116735529488272
          ],
          [
            "atoms",
            0.01873389486738972
          ]
        ],
        "count": 674
      },
      "1": {
        "name": "1_CO2_spectra_carbon_bands",
        "keywords": [
          [
            "CO2",
            0.03967828826061255
          ],
          [
            "spectra",
            0.027271125437111673
          ],
          [
            "carbon",
            0.025237530807754285
          ],
          [
            "bands",
            0.024803073681055752
          ],
          [
            "infrared",
            0.024550681739862128
          ],
          [
            "observed",
            0.021165585446987142
          ],
          [
            "spectrum",
            0.020255215052397156
          ],
          [
            "interstellar",
            0.020156328166873138
          ],
          [
            "fundamental",
            0.020092303064188063
          ],
          [
            "model",
            0.018013455223655148
          ]
        ],
        "count": 60
      }
    },
    "correlations": [
      [
        1.0,
        -0.38963243649380935
      ],
      [
        -0.38963243649380935,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        10,
        2
      ],
      "2020-02": [
        9,
        2
      ],
      "2020-03": [
        18,
        0
      ],
      "2020-04": [
        6,
        1
      ],
      "2020-05": [
        11,
        2
      ],
      "2020-06": [
        10,
        3
      ],
      "2020-07": [
        9,
        0
      ],
      "2020-08": [
        6,
        2
      ],
      "2020-09": [
        7,
        2
      ],
      "2020-10": [
        13,
        2
      ],
      "2020-11": [
        12,
        0
      ],
      "2020-12": [
        5,
        0
      ],
      "2021-01": [
        5,
        1
      ],
      "2021-02": [
        14,
        2
      ],
      "2021-03": [
        12,
        0
      ],
      "2021-04": [
        9,
        2
      ],
      "2021-05": [
        17,
        2
      ],
      "2021-06": [
        15,
        0
      ],
      "2021-07": [
        7,
        3
      ],
      "2021-08": [
        4,
        4
      ],
      "2021-09": [
        9,
        0
      ],
      "2021-10": [
        11,
        1
      ],
      "2021-11": [
        13,
        4
      ],
      "2021-12": [
        4,
        2
      ],
      "2022-01": [
        13,
        1
      ],
      "2022-02": [
        7,
        2
      ],
      "2022-03": [
        11,
        4
      ],
      "2022-04": [
        13,
        0
      ],
      "2022-05": [
        10,
        1
      ],
      "2022-06": [
        13,
        0
      ],
      "2022-07": [
        9,
        4
      ],
      "2022-08": [
        8,
        1
      ],
      "2022-09": [
        12,
        2
      ],
      "2022-10": [
        11,
        2
      ],
      "2022-11": [
        17,
        4
      ],
      "2022-12": [
        8,
        3
      ],
      "2023-01": [
        9,
        2
      ],
      "2023-02": [
        5,
        0
      ],
      "2023-03": [
        10,
        2
      ],
      "2023-04": [
        9,
        2
      ],
      "2023-05": [
        8,
        1
      ],
      "2023-06": [
        9,
        1
      ],
      "2023-07": [
        10,
        1
      ],
      "2023-08": [
        12,
        1
      ],
      "2023-09": [
        16,
        3
      ],
      "2023-10": [
        11,
        0
      ],
      "2023-11": [
        5,
        1
      ],
      "2023-12": [
        11,
        0
      ],
      "2024-01": [
        12,
        5
      ],
      "2024-02": [
        14,
        1
      ],
      "2024-03": [
        12,
        0
      ],
      "2024-04": [
        3,
        0
      ],
      "2024-05": [
        7,
        0
      ],
      "2024-06": [
        10,
        0
      ],
      "2024-07": [
        8,
        1
      ],
      "2024-08": [
        14,
        3
      ],
      "2024-09": [
        13,
        1
      ],
      "2024-10": [
        8,
        1
      ],
      "2024-11": [
        2,
        5
      ],
      "2024-12": [
        12,
        0
      ],
      "2025-01": [
        7,
        0
      ],
      "2025-02": [
        11,
        1
      ],
      "2025-03": [
        11,
        2
      ],
      "2025-04": [
        12,
        2
      ],
      "2025-05": [
        9,
        0
      ],
      "2025-06": [
        19,
        3
      ],
      "2025-07": [
        8,
        2
      ],
      "2025-08": [
        8,
        1
      ],
      "2025-09": [
        8,
        1
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Gamma -ray spectra in the positron-annihilation process of molecules at room temperature",
          "year": "2020-03",
          "abstract": "In this study, a fully self-consistent method was developed to obtain the\nwave functions of the positron and electrons in molecules simultaneously. The\nwave function of a positron at room temperature , with a characteristic energy\nof approximately $0.04 eV$, was used to analyse the experimental results of its\nannihilation in helium, neon, hydrogen, and methane molecules. The interactions\nbetween the positron and molecule provide a significant correction in the\ngamma-ray spectra of the annihilating electron--positron pairs. It was also\nobserved that high-order correlations offered almost no correction in the\nspectra, as the interaction between the low-energy positron and electrons\ncannot drive the electrons into excited electronic states. More accurate\nstudies, which consider the coupling of the positron--electron pair states and\nvibration states of nuclei, must be undertaken.",
          "arxiv_id": "2003.03767v2"
        },
        {
          "title": "Time-resolved formation of excited atomic and molecular states in XUV-induced nanoplasmas in ammonia clusters",
          "year": "2020-03",
          "abstract": "High intensity XUV radiation from a free-electron (FEL) was used to create a\nnanoplasma inside ammonia clusters with the intent of studying the resulting\nelectron-ion interactions and their interplay with plasma evolution. In a\nplasma-like state, electrons with kinetic energy lower than the local\ncollective Coulomb potential of the positive ionic core are trapped in the\ncluster and take part in secondary processes (e.g. electron-impact\nexcitation/ionization and electron-ion recombination) which lead to subsequent\nexcited and neutral molecular fragmentation. Using a time-delayed UV laser, the\ndynamics of the excited atomic and molecular states are probed from -0.1 ps to\n18 ps. We identify three different phases of molecular fragmentation that are\nclearly distinguished by the effect of the probe laser on the ionic and\nelectronic yield. We propose a simple model to rationalize our data and further\nidentify two separate channels leading to the formation of excited hydrogen.",
          "arxiv_id": "2003.05675v1"
        },
        {
          "title": "Theoretical Prediction of Low-Energy Experimental Photoelectron Spectra of Al$_n$Ni$^{-}$ Clusters (n=1-13)",
          "year": "2024-03",
          "abstract": "Context Mixed-metal clusters have long been studied because of their peculiar\nproperties and how they change with cluster size, composition and charge state\nand their potential roles in catalysis. The characterization of these clusters\nis therefore a very important issue. One of the main experimental tools for\ncharacterizing their electronic structure is photoelectron spectroscopy.\nTheoretical computation completes the task by fully determining the structural\nproperties and matching the theoretical predictions to the measured spectra. We\npresent density functional theory computations of the structural, magnetic and\nelectronic properties of negatively charged mixed Al$_{n}$Ni$^{-}$ clusters\nwith up to 13 Al atoms. The lowest energy structures of the anionic clusters\nwith up to 7 atoms are also found to be low energy isomers of the neutral\ncounterparts found in the literature. The 13-atom cluster is found to be a\nquartet and a perfect icosahedron. The predicted photoelectron spectra are also\npresented and can be used to interpret future experimental data. We also\npresented indicators that can be used to determine the potential of these\nsystems for single atom catalysis. These indicators point to smaller clusters\nto be more reactive as the gap between the Fermi energy and the center of the\nd-band increases with cluster size and that Ni occupy and internal site for\nn=11-13. We speculate that reactivity can be enhanced if one adds an additional\nNi atom. Methods The DFT calculations were performed using the Becke exchange\nand Perdew-Wang/91 correlation functionals (BPW91), a DFT-optimized\nall-electron basis set for the aluminum atom and the Stuttgart small core\npseudopotential for the Ni atom. All of the computations used the Gaussian 03\nsoftware.",
          "arxiv_id": "2403.01020v1"
        }
      ],
      "1": [
        {
          "title": "Infrared spectra of (CO$_2$)$_2$-Rg trimers, Rg = Ne, Ar, Kr, and Xe",
          "year": "2022-07",
          "abstract": "High resolution spectra of (CO$_2$)$_2$-Rg trimers (Rg = Ne, Ar, Kr, and Xe)\nin the region of the CO2 nu3 fundamental (~2350 cm$^{-1}$) are reported, using\na tunable OPO laser source to probe a pulsed supersonic slit jet expansion.\nThese (CO$_2$)$_2$-Rg transitions tend to be hidden among stronger spectra due\nto other species, such as CO$_2$-Rg and (CO$_2$)$_2$. Each trimer consists of a\n(CO$_2$)$_2$ unit which is similar to the free carbon dioxide dimer (planar\nparallel staggered) plus an Rg atom located out-of-plane on the dimer C$_2$\nsymmetry axis, but the (CO$_2$)$_2$ unit may not remain exactly planar in the\ndimer. Experimental structures show that the C-Rg bond lengths in the trimers\nare similar to those in the corresponding CO$_2$-Rg dimers. As well, the\nvibrational band origin shifts, relative to (CO$_2$)$_2$ itself, are similar to\nthose of CO$_2$-Rg relative to CO$_2$.",
          "arxiv_id": "2207.03042v1"
        },
        {
          "title": "Infrared spectra of both isomers of CO$_2$-CO in the CO$_2$ $ν_3$ region",
          "year": "2021-05",
          "abstract": "Extensive infrared spectra of the weakly-bound CO$_2$-CO dimer are observed\nin the carbon dioxide $\\nu_3$ asymmetric stretch region (~2350 cm-1) using a\ntunable infrared OPO laser source to probe a pulsed slit jet supersonic\nexpansion. Both C-bonded and O-bonded isomers are analyzed for the normal\nisotopologue as well as for 13CO$_2$-CO and $^{16}$O$^{13}$C$^{18}$O-CO, the\nlatter being the first observation of an asymmetrically substituted form for\nwhich all values of Ka are allowed. Combination bands involving the lowest\nin-plane intermolecular bending modes are also studied for both isomers. Weak\nbands near 2337 cm-1 are assigned to CO$_2$ hot band transitions (v1, v2l2, v3)\n= (0111) <-- (0110), yielding the splitting of the degenerate CO$_2$ $\\nu_2$\nbend into in-plane and out-of-plane components due to the presence of the CO.\nThis splitting has rather different values for the C- and O- bonded isomers,\n4.56 and 1.59 cm-1, respectively, with the out-of-plane mode higher in energy\nthan the in-plane for both cases.",
          "arxiv_id": "2105.13259v1"
        },
        {
          "title": "Weakly-bound clusters of atmospheric molecules: infrared spectra and structural calculations of (CO$_2$)$_n$-(CO)$_m$-(N$_2$)$_p$, $(n, m, p)$ = (2, 1, 0), (2, 0, 1), (1, 2, 0), (1, 0, 2), (1, 1, 1), (1, 3, 0), (1, 0, 3), (1, 2, 1), (1, 1, 2)",
          "year": "2022-02",
          "abstract": "Structural calculations and high-resolution infrared spectra are reported for\ntrimers and tetramers containing CO$_2$ together with CO and/or N$_2$. Among\nthe 9 clusters studied here, only (CO$_2$)$_2$-CO was previously observed by\nhigh-resolution spectroscopy. The spectra, which occur in the region of the\n$\\nu_3$ fundamental of CO$_2$ (~2350 cm$^{-1}$), were recorded using a tunable\noptical parametric oscillator source to probe a pulsed supersonic slit jet\nexpansion. The trimers (CO$_2$)$_2$-CO and (CO$_2$)$_2$-N$_2$ have structures\nin which the CO or N$_2$ is aligned along the symmetry axis of a staggered\nside-by-side CO$_2$ dimer unit. The observation of two fundamental bands for\n(CO$_2$)$_2$-CO and (CO$_2$)$_2$-N$_2$ shows that this CO$_2$ dimer unit is\nnon-planar, unlike (CO$_2$)$_2$ itself. For the trimers CO$_2$-(CO)$_2$ and\nCO$_2$-(N$_2$)$_2$, the CO or N$_2$ monomers occupy equivalent positions in the\n'equatorial plane' of the CO$_2$, pointing toward its C atom. To form the\ntetramers CO$_2$-(CO)$_3$ and CO$_2$-(N$_2$)$_3$, a third CO or N$_2$ monomer\nis then added off to the 'side' of the first two. In the mixed tetramers\nCO$_2$-(CO)$_2$-N$_2$ and CO$_2$-CO-(N$_2$)$_2$, this 'side' position is taken\nby N2 and not CO. In addition to the fundamental bands, combination bands are\nalso observed for (CO$_2$)$_2$-CO, CO$_2$-(CO)$_2$, and CO$_2$-(N$_2$)$_2$,\nyielding some information about their low-frequency intermolecular vibrations.",
          "arxiv_id": "2202.13233v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:39:02Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}