{
  "topics": {
    "data": {
      "0": {
        "name": "0_species_model_population_dynamics",
        "keywords": [
          [
            "species",
            0.032742739839544226
          ],
          [
            "model",
            0.03176113033985515
          ],
          [
            "population",
            0.028963113657394207
          ],
          [
            "dynamics",
            0.021457986617293378
          ],
          [
            "models",
            0.02081519319169176
          ],
          [
            "evolutionary",
            0.01940609274806864
          ],
          [
            "evolution",
            0.01765718494618068
          ],
          [
            "time",
            0.017271078194919423
          ],
          [
            "tree",
            0.014502496954530021
          ],
          [
            "networks",
            0.014352766756019668
          ]
        ],
        "count": 2635
      },
      "1": {
        "name": "1_model_COVID_epidemic_disease",
        "keywords": [
          [
            "model",
            0.05180911346145031
          ],
          [
            "COVID",
            0.04090588990645205
          ],
          [
            "epidemic",
            0.0317248020655771
          ],
          [
            "disease",
            0.029409243093123292
          ],
          [
            "data",
            0.027253139378263617
          ],
          [
            "number",
            0.024735229381564923
          ],
          [
            "time",
            0.02311157703946095
          ],
          [
            "models",
            0.02285080652076109
          ],
          [
            "infection",
            0.022819024822405592
          ],
          [
            "spread",
            0.022224283072716983
          ]
        ],
        "count": 2523
      }
    },
    "correlations": [
      [
        1.0,
        -0.22801193926086732
      ],
      [
        -0.22801193926086732,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        36,
        10
      ],
      "2020-02": [
        39,
        35
      ],
      "2020-03": [
        43,
        133
      ],
      "2020-04": [
        39,
        234
      ],
      "2020-05": [
        39,
        164
      ],
      "2020-06": [
        34,
        133
      ],
      "2020-07": [
        39,
        127
      ],
      "2020-08": [
        36,
        77
      ],
      "2020-09": [
        30,
        54
      ],
      "2020-10": [
        36,
        61
      ],
      "2020-11": [
        42,
        45
      ],
      "2020-12": [
        42,
        40
      ],
      "2021-01": [
        29,
        36
      ],
      "2021-02": [
        40,
        44
      ],
      "2021-03": [
        38,
        51
      ],
      "2021-04": [
        40,
        36
      ],
      "2021-05": [
        29,
        28
      ],
      "2021-06": [
        31,
        41
      ],
      "2021-07": [
        39,
        31
      ],
      "2021-08": [
        30,
        26
      ],
      "2021-09": [
        39,
        43
      ],
      "2021-10": [
        33,
        27
      ],
      "2021-11": [
        55,
        34
      ],
      "2021-12": [
        39,
        33
      ],
      "2022-01": [
        35,
        31
      ],
      "2022-02": [
        47,
        30
      ],
      "2022-03": [
        29,
        16
      ],
      "2022-04": [
        32,
        17
      ],
      "2022-05": [
        33,
        34
      ],
      "2022-06": [
        31,
        18
      ],
      "2022-07": [
        30,
        29
      ],
      "2022-08": [
        20,
        32
      ],
      "2022-09": [
        30,
        19
      ],
      "2022-10": [
        40,
        26
      ],
      "2022-11": [
        34,
        27
      ],
      "2022-12": [
        30,
        14
      ],
      "2023-01": [
        37,
        20
      ],
      "2023-02": [
        32,
        21
      ],
      "2023-03": [
        49,
        27
      ],
      "2023-04": [
        41,
        15
      ],
      "2023-05": [
        38,
        21
      ],
      "2023-06": [
        39,
        27
      ],
      "2023-07": [
        43,
        18
      ],
      "2023-08": [
        33,
        12
      ],
      "2023-09": [
        40,
        19
      ],
      "2023-10": [
        43,
        18
      ],
      "2023-11": [
        49,
        24
      ],
      "2023-12": [
        28,
        23
      ],
      "2024-01": [
        37,
        18
      ],
      "2024-02": [
        33,
        12
      ],
      "2024-03": [
        43,
        19
      ],
      "2024-04": [
        31,
        22
      ],
      "2024-05": [
        57,
        20
      ],
      "2024-06": [
        34,
        12
      ],
      "2024-07": [
        39,
        17
      ],
      "2024-08": [
        31,
        15
      ],
      "2024-09": [
        59,
        20
      ],
      "2024-10": [
        59,
        22
      ],
      "2024-11": [
        52,
        25
      ],
      "2024-12": [
        46,
        22
      ],
      "2025-01": [
        40,
        20
      ],
      "2025-02": [
        47,
        15
      ],
      "2025-03": [
        49,
        27
      ],
      "2025-04": [
        52,
        27
      ],
      "2025-05": [
        32,
        20
      ],
      "2025-06": [
        52,
        17
      ],
      "2025-07": [
        52,
        15
      ],
      "2025-08": [
        51,
        18
      ],
      "2025-09": [
        25,
        13
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Evolutionary ecology of words",
          "year": "2025-05",
          "abstract": "We propose a model for the evolutionary ecology of words as one attempt to\nextend evolutionary game theory and agent-based models by utilizing the rich\nlinguistic expressions of Large Language Models (LLMs). Our model enables the\nemergence and evolution of diverse and infinite options for interactions among\nagents. Within the population, each agent possesses a short word (or phrase)\ngenerated by an LLM and moves within a spatial environment. When agents become\nadjacent, the outcome of their interaction is determined by the LLM based on\nthe relationship between their words, with the loser's word being replaced by\nthe winner's. Word mutations, also based on LLM outputs, may occur. We\nconducted preliminary experiments assuming that ``strong animal species\" would\nsurvive. The results showed that from an initial population consisting of\nwell-known species, many species emerged both gradually and in a punctuated\nequilibrium manner. Each trial demonstrated the unique evolution of diverse\npopulations, with one type of large species becoming dominant, such as\nterrestrial animals, marine life, or extinct species, which were ecologically\nspecialized and adapted ones across diverse extreme habitats. We also conducted\na long-term experiment with a large population, demonstrating the emergence and\ncoexistence of diverse species.",
          "arxiv_id": "2505.05863v1"
        },
        {
          "title": "Many-species ecological fluctuations as a jump process from the brink of extinction",
          "year": "2023-06",
          "abstract": "Highly-diverse ecosystems exhibit a broad distribution of population sizes\nand species turnover, where species at high and low abundances are exchanged\nover time. We show that these two features generically emerge in the\nfluctuating phase of many-variable model ecosystems with disordered species\ninteractions, when species are supported by migration from outside the system\nat a small rate. We show that these and other phenomena can be understood\nthrough the existence of a scaling regime in the limit of small migration, in\nwhich large fluctuations and long timescales emerge. We construct an exact\nanalytical theory for this asymptotic regime, that provides scaling predictions\non timescales and abundance distributions that are verified exactly in\nsimulations. In this regime, a clear separation emerges between rare and\nabundant species at any given time, despite species moving back and forth\nbetween the rare and abundant subsets. The number of abundant species is found\nto lie strictly below a well-known stability bound, maintaining the system away\nfrom marginality. At the same time, other measures of diversity, which also\ninclude some of the rare species, go above this bound.\n  In the asymptotic limit where the migration rate goes to zero, trajectories\nof individual species abundances are described by non-Markovian jump-diffusion\nprocesses, which proceeds as follows: A rare species remains so for some time,\nthen experiences a jump in population sizes after which it becomes abundant (a\nspecies turnover event) and later sees its population size gradually decreasing\nagain until rare, due to the competition with other species. The asymmetry of\nabundance trajectories under time-reversal is maintained at small but finite\nmigration rate. These features may serve as fingerprints of endogenous\nfluctuations in highly-diverse ecosystems.",
          "arxiv_id": "2306.13634v4"
        },
        {
          "title": "Finding analytical approximations for discrete, stochastic, individual-based models of ecology",
          "year": "2023-01",
          "abstract": "Discrete time, spatially extended models play an important role in ecology,\nmodelling population dynamics of species ranging from micro-organisms to birds.\nAn important question is how 'bottom up', individual-based models can be\napproximated by 'top down' models of dynamics. Here, we study a class of\nspatially explicit individual-based models with contest competition: where\nspecies compete for space in local cells and then disperse to nearby cells. We\nstart by describing simulations of the model, which exhibit large-scale\ndiscrete oscillations and characterise these oscillations by measuring spatial\ncorrelations. We then develop two new approximate descriptions of the resulting\nspatial population dynamics. The first is based on local interactions of the\nindividuals and allows us to give a difference equation approximation of the\nsystem over small dispersal distances. The second approximates the long-range\ninteractions of the individual-based model. These approximations capture\ndemographic stochasticity from the individual-based model and show that\ndispersal stabilizes population dynamics. We calculate extinction probability\nfor the individual-based model and show convergence between the local\napproximation and the non-spatial global approximation of the individual-based\nmodel as dispersal distance and population size simultaneously tend to\ninfinity. Our results provide new approximate analytical descriptions of a\ncomplex bottom-up model and deepen understanding of spatial population\ndynamics.",
          "arxiv_id": "2301.08094v1"
        }
      ],
      "1": [
        {
          "title": "A time series method to analyze incidence pattern and estimate reproduction number of COVID-19",
          "year": "2020-03",
          "abstract": "The ongoing pandemic of Coronavirus disease (COVID-19) emerged in Wuhan,\nChina in the end of 2019. It has already affected more than 300,000 people,\nwith the number of deaths nearing 13000 across the world. As it has been posing\na huge threat to global public health, it is of utmost importance to identify\nthe rate at which the disease is spreading. In this study, we propose a time\nseries model to analyze the trend pattern of the incidence of COVID-19\noutbreak. We also incorporate information on total or partial lockdown,\nwherever available, into the model. The model is concise in structure, and\nusing appropriate diagnostic measures, we showed that a time-dependent\nquadratic trend successfully captures the incidence pattern of the disease. We\nalso estimate the basic reproduction number across different countries, and\nfind that it is consistent except for the United States of America. The above\nstatistical analysis is able to shed light on understanding the trends of the\noutbreak, and gives insight on what epidemiological stage a region is in. This\nhas the potential to help in prompting policies to address COVID-19 pandemic in\ndifferent countries.",
          "arxiv_id": "2003.10655v1"
        },
        {
          "title": "Using A Partial Differential Equation with Google Mobility Data to Predict COVID-19 in Arizona",
          "year": "2020-06",
          "abstract": "The outbreak of COVID-19 disrupts the life of many people in the world. The\nstate of Arizona in the U.S. emerges as one of the country's newest COVID-19\nhot spots. Accurate forecasting for COVID-19 cases will help governments to\nimplement necessary measures and convince more people to take personal\nprecautions to combat the virus. It is difficult to accurately predict the\nCOVID-19 cases due to many human factors involved. This paper aims to provide a\nforecasting model for COVID-19 cases with the help of human activity data from\nthe Google Community Mobility Reports. To achieve this goal, a specific partial\ndifferential equation (PDE) is developed and validated with the COVID-19 data\nfrom the New York Times at the county level in the state of Arizona in the U.S.\nThe proposed model describes the combined effects of transboundary spread among\ncounty clusters in Arizona and human actives on the transmission of COVID-19.\nThe results show that the prediction accuracy of this model is well acceptable\n(above 94\\%). Furthermore, we study the effectiveness of personal precautions\nsuch as wearing face masks and practicing social distancing on COVID-19 cases\nat the local level. The localized analytical results can be used to help to\nslow the spread of COVID-19 in Arizona. To the best of our knowledge, this work\nis the first attempt to apply PDE models on COVID-19 prediction with the Google\nCommunity Mobility Reports.",
          "arxiv_id": "2006.16928v3"
        },
        {
          "title": "Analysis of COVID-19 cases in India through Machine Learning: A Study of Intervention",
          "year": "2020-08",
          "abstract": "To combat the coronavirus disease 2019 (COVID-19) pandemic, the world has\nvaccination, plasma therapy, herd immunity, and epidemiological interventions\nas few possible options. The COVID-19 vaccine development is underway and it\nmay take a significant amount of time to develop the vaccine and after\ndevelopment, it will take time to vaccinate the entire population, and plasma\ntherapy has some limitations. Herd immunity can be a plausible option to fight\nCOVID-19 for small countries. But for a country with huge population like\nIndia, herd immunity is not a plausible option, because to acquire herd\nimmunity approximately 67% of the population has to be recovered from COVID-19\ninfection, which will put an extra burden on medical system of the country and\nwill result in a huge loss of human life. Thus epidemiological interventions\n(complete lockdown, partial lockdown, quarantine, isolation, social distancing,\netc.) are some suitable strategies in India to slow down the COVID-19 spread\nuntil the vaccine development. In this work, we have suggested the SIR model\nwith intervention, which incorporates the epidemiological interventions in the\nclassical SIR model. To model the effect of the interventions, we have\nintroduced \\r{ho} as the intervention parameter. \\r{ho} is a cumulative\nquantity which covers all type of intervention. We have also discussed the\nsupervised machine learning approach to estimate the transmission rate\n(\\b{eta}) for the SIR model with intervention from the prevalence of COVID-19\ndata in India and some states of India. To validate our model, we present a\ncomparison between the actual and model-predicted number of COVID-19 cases.\nUsing our model, we also present predicted numbers of active and recovered\nCOVID-19 cases till Sept 30, 2020, for entire India and some states of India\nand also estimate the 95% and 99% confidence interval for the predicted cases.",
          "arxiv_id": "2008.10450v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:43:16Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}