{
  "topics": {
    "data": {
      "0": {
        "name": "0_data_model_models_learning",
        "keywords": [
          [
            "data",
            0.03438516767385128
          ],
          [
            "model",
            0.02865100117056251
          ],
          [
            "models",
            0.025503058187256036
          ],
          [
            "learning",
            0.020809067952865683
          ],
          [
            "methods",
            0.017324429229564585
          ],
          [
            "analysis",
            0.016171268049845963
          ],
          [
            "method",
            0.015387468390491002
          ],
          [
            "cell",
            0.014719115604403797
          ],
          [
            "time",
            0.01466145547125204
          ],
          [
            "protein",
            0.013723652520726387
          ]
        ],
        "count": 5743
      },
      "1": {
        "name": "1_model_infection_epidemic_transmission",
        "keywords": [
          [
            "model",
            0.04144460461279239
          ],
          [
            "infection",
            0.03051228745535009
          ],
          [
            "epidemic",
            0.02566386654162481
          ],
          [
            "transmission",
            0.025181899956436774
          ],
          [
            "data",
            0.024797612357547228
          ],
          [
            "disease",
            0.02182365725426117
          ],
          [
            "number",
            0.020975693835625895
          ],
          [
            "time",
            0.018981046910122194
          ],
          [
            "models",
            0.01892199152343595
          ],
          [
            "spread",
            0.018829723926305466
          ]
        ],
        "count": 343
      }
    },
    "correlations": [
      [
        1.0,
        -0.19702792453095136
      ],
      [
        -0.19702792453095136,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        52,
        4
      ],
      "2020-02": [
        69,
        5
      ],
      "2020-03": [
        69,
        15
      ],
      "2020-04": [
        66,
        48
      ],
      "2020-05": [
        77,
        52
      ],
      "2020-06": [
        73,
        27
      ],
      "2020-07": [
        66,
        31
      ],
      "2020-08": [
        55,
        23
      ],
      "2020-09": [
        50,
        17
      ],
      "2020-10": [
        65,
        14
      ],
      "2020-11": [
        71,
        16
      ],
      "2020-12": [
        65,
        16
      ],
      "2021-01": [
        61,
        17
      ],
      "2021-02": [
        61,
        17
      ],
      "2021-03": [
        70,
        10
      ],
      "2021-04": [
        41,
        7
      ],
      "2021-05": [
        61,
        14
      ],
      "2021-06": [
        53,
        12
      ],
      "2021-07": [
        58,
        11
      ],
      "2021-08": [
        58,
        18
      ],
      "2021-09": [
        55,
        16
      ],
      "2021-10": [
        86,
        12
      ],
      "2021-11": [
        84,
        15
      ],
      "2021-12": [
        66,
        6
      ],
      "2022-01": [
        58,
        19
      ],
      "2022-02": [
        68,
        11
      ],
      "2022-03": [
        60,
        13
      ],
      "2022-04": [
        66,
        9
      ],
      "2022-05": [
        68,
        12
      ],
      "2022-06": [
        79,
        13
      ],
      "2022-07": [
        59,
        11
      ],
      "2022-08": [
        68,
        19
      ],
      "2022-09": [
        60,
        11
      ],
      "2022-10": [
        81,
        12
      ],
      "2022-11": [
        105,
        6
      ],
      "2022-12": [
        59,
        6
      ],
      "2023-01": [
        49,
        10
      ],
      "2023-02": [
        67,
        12
      ],
      "2023-03": [
        91,
        19
      ],
      "2023-04": [
        68,
        11
      ],
      "2023-05": [
        76,
        11
      ],
      "2023-06": [
        69,
        13
      ],
      "2023-07": [
        76,
        9
      ],
      "2023-08": [
        82,
        13
      ],
      "2023-09": [
        96,
        8
      ],
      "2023-10": [
        86,
        6
      ],
      "2023-11": [
        94,
        15
      ],
      "2023-12": [
        84,
        18
      ],
      "2024-01": [
        91,
        8
      ],
      "2024-02": [
        99,
        15
      ],
      "2024-03": [
        81,
        8
      ],
      "2024-04": [
        75,
        12
      ],
      "2024-05": [
        92,
        14
      ],
      "2024-06": [
        81,
        18
      ],
      "2024-07": [
        89,
        15
      ],
      "2024-08": [
        65,
        7
      ],
      "2024-09": [
        99,
        15
      ],
      "2024-10": [
        119,
        16
      ],
      "2024-11": [
        100,
        15
      ],
      "2024-12": [
        83,
        14
      ],
      "2025-01": [
        89,
        12
      ],
      "2025-02": [
        85,
        14
      ],
      "2025-03": [
        103,
        21
      ],
      "2025-04": [
        87,
        11
      ],
      "2025-05": [
        128,
        18
      ],
      "2025-06": [
        105,
        14
      ],
      "2025-07": [
        115,
        7
      ],
      "2025-08": [
        111,
        14
      ],
      "2025-09": [
        46,
        8
      ]
    },
    "papers": {
      "0": [
        {
          "title": "A Knowledge Graph-Enhanced Tensor Factorisation Model for Discovering Drug Targets",
          "year": "2021-05",
          "abstract": "The drug discovery and development process is a long and expensive one,\ncosting over 1 billion USD on average per drug and taking 10-15 years. To\nreduce the high levels of attrition throughout the process, there has been a\ngrowing interest in applying machine learning methodologies to various stages\nof drug discovery and development in the recent decade, especially at the\nearliest stage identification of druggable disease genes. In this paper, we\nhave developed a new tensor factorisation model to predict potential drug\ntargets (genes or proteins) for treating diseases. We created a three\ndimensional data tensor consisting of 1,048 gene targets, 860 diseases and\n230,011 evidence attributes and clinical outcomes connecting them, using data\nextracted from the Open Targets and PharmaProjects databases. We enriched the\ndata with gene target representations learned from a drug discovery oriented\nknowledge graph and applied our proposed method to predict the clinical\noutcomes for unseen gene target and disease pairs. We designed three evaluation\nstrategies to measure the prediction performance and benchmarked several\ncommonly used machine learning classifiers together with Bayesian matrix and\ntensor factorisation methods. The result shows that incorporating knowledge\ngraph embeddings significantly improves the prediction accuracy and that\ntraining tensor factorisation alongside a dense neural network outperforms all\nother baselines. In summary, our framework combines two actively studied\nmachine learning approaches to disease target identification, namely tensor\nfactorisation and knowledge graph representation learning, which could be a\npromising avenue for further exploration in data driven drug discovery.",
          "arxiv_id": "2105.10578v3"
        },
        {
          "title": "SubOmiEmbed: Self-supervised Representation Learning of Multi-omics Data for Cancer Type Classification",
          "year": "2022-02",
          "abstract": "For personalized medicines, very crucial intrinsic information is present in\nhigh dimensional omics data which is difficult to capture due to the large\nnumber of molecular features and small number of available samples. Different\ntypes of omics data show various aspects of samples. Integration and analysis\nof multi-omics data give us a broad view of tumours, which can improve clinical\ndecision making. Omics data, mainly DNA methylation and gene expression\nprofiles are usually high dimensional data with a lot of molecular features. In\nrecent years, variational autoencoders (VAE) have been extensively used in\nembedding image and text data into lower dimensional latent spaces. In our\nproject, we extend the idea of using a VAE model for low dimensional latent\nspace extraction with the self-supervised learning technique of feature\nsubsetting. With VAEs, the key idea is to make the model learn meaningful\nrepresentations from different types of omics data, which could then be used\nfor downstream tasks such as cancer type classification. The main goals are to\novercome the curse of dimensionality and integrate methylation and expression\ndata to combine information about different aspects of same tissue samples, and\nhopefully extract biologically relevant features. Our extension involves\ntraining encoder and decoder to reconstruct the data from just a subset of it.\nBy doing this, we force the model to encode most important information in the\nlatent representation. We also added an identity to the subsets so that the\nmodel knows which subset is being fed into it during training and testing. We\nexperimented with our approach and found that SubOmiEmbed produces comparable\nresults to the baseline OmiEmbed with a much smaller network and by using just\na subset of the data. This work can be improved to integrate mutation-based\ngenomic data as well.",
          "arxiv_id": "2202.01672v1"
        },
        {
          "title": "Comprehensive evaluation of deep and graph learning on drug-drug interactions prediction",
          "year": "2023-06",
          "abstract": "Recent advances and achievements of artificial intelligence (AI) as well as\ndeep and graph learning models have established their usefulness in biomedical\napplications, especially in drug-drug interactions (DDIs). DDIs refer to a\nchange in the effect of one drug to the presence of another drug in the human\nbody, which plays an essential role in drug discovery and clinical research.\nDDIs prediction through traditional clinical trials and experiments is an\nexpensive and time-consuming process. To correctly apply the advanced AI and\ndeep learning, the developer and user meet various challenges such as the\navailability and encoding of data resources, and the design of computational\nmethods. This review summarizes chemical structure based, network based, NLP\nbased and hybrid methods, providing an updated and accessible guide to the\nbroad researchers and development community with different domain knowledge. We\nintroduce widely-used molecular representation and describe the theoretical\nframeworks of graph neural network models for representing molecular\nstructures. We present the advantages and disadvantages of deep and graph\nlearning methods by performing comparative experiments. We discuss the\npotential technical challenges and highlight future directions of deep and\ngraph learning models for accelerating DDIs prediction.",
          "arxiv_id": "2306.05257v1"
        }
      ],
      "1": [
        {
          "title": "COVIDHunter: COVID-19 pandemic wave prediction and mitigation via seasonality-aware modeling",
          "year": "2022-06",
          "abstract": "Early detection and isolation of COVID-19 patients are essential for\nsuccessful implementation of mitigation strategies and eventually curbing the\ndisease spread. With a limited number of daily COVID-19 tests performed in\nevery country, simulating the COVID-19 spread along with the potential effect\nof each mitigation strategy currently remains one of the most effective ways in\nmanaging the healthcare system and guiding policy-makers. We introduce\nCOVIDHunter, a flexible and accurate COVID-19 outbreak simulation model that\nevaluates the current mitigation measures that are applied to a region,\npredicts COVID-19 statistics (the daily number of cases, hospitalizations, and\ndeaths), and provides suggestions on what strength the upcoming mitigation\nmeasure should be. The key idea of COVIDHunter is to quantify the spread of\nCOVID-19 in a geographical region by simulating the average number of new\ninfections caused by an infected person considering the effect of external\nfactors, such as environmental conditions (e.g., climate, temperature,\nhumidity), different variants of concern, vaccination rate, and mitigation\nmeasures. Using Switzerland as a case study, COVIDHunter estimates that we are\nexperiencing a deadly new wave that will peak on 26 January 2022, which is very\nsimilar in numbers to the wave we had in February 2020. The policy-makers have\nonly one choice that is to increase the strength of the currently applied\nmitigation measures for 30 days. Unlike existing models, the COVIDHunter model\naccurately monitors and predicts the daily number of cases, hospitalizations,\nand deaths due to COVID-19. Our model is flexible to configure and simple to\nmodify for modeling different scenarios under different environmental\nconditions and mitigation measures. We release the source code of the\nCOVIDHunter implementation at https://github.com/CMU-SAFARI/COVIDHunter.",
          "arxiv_id": "2206.06692v1"
        },
        {
          "title": "Bayesian dynamical estimation of the parameters of an SE(A)IR COVID-19 spread model",
          "year": "2020-05",
          "abstract": "In this article, we consider a dynamic epidemiology model for the spread of\nthe COVID-19 infection. Starting from the classical SEIR model, the model is\nmodified so as to better describe characteristic features of the underlying\npathogen and its infectious modes. In line with the large number of secondary\ninfections not related to contact with documented infectious individuals, the\nmodel includes a cohort of asymptomatic or oligosymptomatic infectious\nindividuals, not accounted for in the data of new daily counts of infections. A\nBayesian particle filtering algorithm is used to update dynamically the\nrelevant cohort and simultaneously estimate the transmission rate as the new\ndata on the number of new infections and disease related death become\navailable. The underlying assumption of the model is that the infectivity rate\nis dynamically changing during the epidemics, either because of a mutation of\nthe pathogen or in response to mitigation and containment measures. The\nsequential Bayesian framework naturally provides a quantification of the\nuncertainty in the estimate of the model parameters, including the reproduction\nnumber, and of the size of the different cohorts. Moreover, we introduce a\ndimensionless quantity, which is the equilibrium ratio between asymptomatic and\nsymptomatic cohort sizes, and propose a simple formula to estimate the\nquantity. This ratio leads naturally to another dimensionless quantity that\nplays the role of the basic reproduction number $R_0$ of the model. When we\napply the model and particle filter algorithm to COVID-19 infection data from\nseveral counties in Northeastern Ohio and Southeastern Michigan we found the\nproposed reproduction number $R_0$ to have a consistent dynamic behavior within\nboth states, thus proving to be a reliable summary of the success of the\nmitigation measures.",
          "arxiv_id": "2005.04365v2"
        },
        {
          "title": "Computational model on COVID-19 Pandemic using Probabilistic Cellular Automata",
          "year": "2020-06",
          "abstract": "Coronavirus disease (COVID-19) which is caused by SARS-COV2 has become a\npandemic. This disease is highly infectious and potentially fatal, causing a\nglobal public health concern. To contain the spread of COVID-19, governments\nare adopting nationwide interventions, like lockdown, containment and\nquarantine, restrictions on travel, cancelling social events and extensive\ntesting. To understand the effects of these measures on the control of the\nepidemic in a data-driven manner, we propose a probabilistic cellular automata\n(PCA) based modified SEIQR model. The transitions associated with the model is\ndriven by data available on chronology, symptoms, pathogenesis and\ntransmissivity of the virus. By arguing that the lattice-based model captures\nthe features of the dynamics along with the existing fluctuations, we perform\nrigorous computational analyses of the model to take into account of the\nspatial dynamics of social distancing measures imposed on the people.\nConsidering the probabilistic behavioural aspects associated with mitigation\nstrategies, we study the model considering factors like population density and\ntesting efficiency. Using the model, we focus on the variability of epidemic\ndynamics data for different countries and point out the reasons behind these\ncontrasting observations. To the best of our knowledge, this is the first\nattempt to model COVID-19 spread using PCA that gives us both spatial and\ntemporal variations of the infection spread with the insight about the\ncontributions of different infection parameters.",
          "arxiv_id": "2006.11270v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:43:27Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}