{
  "topics": {
    "data": {
      "0": {
        "name": "0_market_data_model_financial",
        "keywords": [
          [
            "market",
            0.049462418553866246
          ],
          [
            "data",
            0.046456254065546126
          ],
          [
            "model",
            0.046237207197569345
          ],
          [
            "financial",
            0.044227753224380134
          ],
          [
            "time",
            0.040615743094440944
          ],
          [
            "stock",
            0.0401300383205835
          ],
          [
            "models",
            0.037520313926920325
          ],
          [
            "price",
            0.02804552598919734
          ],
          [
            "volatility",
            0.02746259800544712
          ],
          [
            "learning",
            0.02629866715643107
          ]
        ],
        "count": 1549
      },
      "1": {
        "name": "1_electricity_forecasting_prices_price",
        "keywords": [
          [
            "electricity",
            0.06992720622784054
          ],
          [
            "forecasting",
            0.04947892233787797
          ],
          [
            "prices",
            0.043449855350491715
          ],
          [
            "price",
            0.04180249936392702
          ],
          [
            "model",
            0.03132378184611035
          ],
          [
            "forecasts",
            0.027065463782188083
          ],
          [
            "market",
            0.025303698590973013
          ],
          [
            "markets",
            0.023983475903971013
          ],
          [
            "time",
            0.023429087080549943
          ],
          [
            "approach",
            0.0233146897489224
          ]
        ],
        "count": 59
      }
    },
    "correlations": [
      [
        1.0,
        -0.22980335389787393
      ],
      [
        -0.22980335389787393,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        19,
        0
      ],
      "2020-02": [
        19,
        1
      ],
      "2020-03": [
        25,
        1
      ],
      "2020-04": [
        30,
        2
      ],
      "2020-05": [
        20,
        3
      ],
      "2020-06": [
        21,
        0
      ],
      "2020-07": [
        26,
        1
      ],
      "2020-08": [
        19,
        2
      ],
      "2020-09": [
        32,
        0
      ],
      "2020-10": [
        23,
        5
      ],
      "2020-11": [
        20,
        0
      ],
      "2020-12": [
        17,
        0
      ],
      "2021-01": [
        21,
        0
      ],
      "2021-02": [
        13,
        3
      ],
      "2021-03": [
        29,
        0
      ],
      "2021-04": [
        18,
        1
      ],
      "2021-05": [
        19,
        0
      ],
      "2021-06": [
        21,
        3
      ],
      "2021-07": [
        36,
        4
      ],
      "2021-08": [
        16,
        0
      ],
      "2021-09": [
        13,
        2
      ],
      "2021-10": [
        14,
        1
      ],
      "2021-11": [
        22,
        0
      ],
      "2021-12": [
        19,
        5
      ],
      "2022-01": [
        28,
        1
      ],
      "2022-02": [
        15,
        1
      ],
      "2022-03": [
        19,
        1
      ],
      "2022-04": [
        20,
        7
      ],
      "2022-05": [
        14,
        3
      ],
      "2022-06": [
        15,
        2
      ],
      "2022-07": [
        20,
        3
      ],
      "2022-08": [
        19,
        1
      ],
      "2022-09": [
        20,
        2
      ],
      "2022-10": [
        16,
        0
      ],
      "2022-11": [
        18,
        1
      ],
      "2022-12": [
        13,
        0
      ],
      "2023-01": [
        14,
        2
      ],
      "2023-02": [
        18,
        0
      ],
      "2023-03": [
        32,
        2
      ],
      "2023-04": [
        27,
        1
      ],
      "2023-05": [
        25,
        2
      ],
      "2023-06": [
        27,
        4
      ],
      "2023-07": [
        21,
        3
      ],
      "2023-08": [
        21,
        2
      ],
      "2023-09": [
        21,
        1
      ],
      "2023-10": [
        27,
        2
      ],
      "2023-11": [
        18,
        1
      ],
      "2023-12": [
        21,
        0
      ],
      "2024-01": [
        21,
        2
      ],
      "2024-02": [
        30,
        0
      ],
      "2024-03": [
        34,
        1
      ],
      "2024-04": [
        19,
        3
      ],
      "2024-05": [
        18,
        4
      ],
      "2024-06": [
        15,
        3
      ],
      "2024-07": [
        21,
        2
      ],
      "2024-08": [
        30,
        1
      ],
      "2024-09": [
        30,
        1
      ],
      "2024-10": [
        27,
        3
      ],
      "2024-11": [
        33,
        1
      ],
      "2024-12": [
        23,
        3
      ],
      "2025-01": [
        14,
        2
      ],
      "2025-02": [
        28,
        0
      ],
      "2025-03": [
        17,
        1
      ],
      "2025-04": [
        27,
        2
      ],
      "2025-05": [
        25,
        1
      ],
      "2025-06": [
        22,
        1
      ],
      "2025-07": [
        29,
        1
      ],
      "2025-08": [
        22,
        4
      ],
      "2025-09": [
        10,
        0
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Research on the correlation between text emotion mining and stock market based on deep learning",
          "year": "2022-05",
          "abstract": "This paper discusses how to crawl the data of financial forums such as stock\nbar, and conduct emotional analysis combined with the in-depth learning model.\nThis paper will use the Bert model to train the financial corpus and predict\nthe Shenzhen stock index. Through the comparative study of the maximal\ninformation coefficient (MIC), it is found that the emotional characteristics\nobtained by applying the BERT model to the financial corpus can be reflected in\nthe fluctuation of the stock market, which is conducive to effectively improve\nthe prediction accuracy. At the same time, this paper combines in-depth\nlearning with financial texts to further explore the impact mechanism of\ninvestor sentiment on the stock market through in-depth learning, which will\nhelp the national regulatory authorities and policy departments to formulate\nmore reasonable policies and guidelines for maintaining the stability of the\nstock market.",
          "arxiv_id": "2205.06675v1"
        },
        {
          "title": "Deep Generative Modeling for Financial Time Series with Application in VaR: A Comparative Review",
          "year": "2024-01",
          "abstract": "In the financial services industry, forecasting the risk factor distribution\nconditional on the history and the current market environment is the key to\nmarket risk modeling in general and value at risk (VaR) model in particular. As\none of the most widely adopted VaR models in commercial banks, Historical\nsimulation (HS) uses the empirical distribution of daily returns in a\nhistorical window as the forecast distribution of risk factor returns in the\nnext day. The objectives for financial time series generation are to generate\nsynthetic data paths with good variety, and similar distribution and dynamics\nto the original historical data. In this paper, we apply multiple existing deep\ngenerative methods (e.g., CGAN, CWGAN, Diffusion, and Signature WGAN) for\nconditional time series generation, and propose and test two new methods for\nconditional multi-step time series generation, namely Encoder-Decoder CGAN and\nConditional TimeVAE. Furthermore, we introduce a comprehensive framework with a\nset of KPIs to measure the quality of the generated time series for financial\nmodeling. The KPIs cover distribution distance, autocorrelation and\nbacktesting. All models (HS, parametric and neural networks) are tested on both\nhistorical USD yield curve data and additional data simulated from GARCH and\nCIR processes. The study shows that top performing models are HS, GARCH and\nCWGAN models. Future research directions in this area are also discussed.",
          "arxiv_id": "2401.10370v1"
        },
        {
          "title": "BERTopic-Driven Stock Market Predictions: Unraveling Sentiment Insights",
          "year": "2024-04",
          "abstract": "This paper explores the intersection of Natural Language Processing (NLP) and\nfinancial analysis, focusing on the impact of sentiment analysis in stock price\nprediction. We employ BERTopic, an advanced NLP technique, to analyze the\nsentiment of topics derived from stock market comments. Our methodology\nintegrates this sentiment analysis with various deep learning models, renowned\nfor their effectiveness in time series and stock prediction tasks. Through\ncomprehensive experiments, we demonstrate that incorporating topic sentiment\nnotably enhances the performance of these models. The results indicate that\ntopics in stock market comments provide implicit, valuable insights into stock\nmarket volatility and price trends. This study contributes to the field by\nshowcasing the potential of NLP in enriching financial analysis and opens up\navenues for further research into real-time sentiment analysis and the\nexploration of emotional and contextual aspects of market sentiment. The\nintegration of advanced NLP techniques like BERTopic with traditional financial\nanalysis methods marks a step forward in developing more sophisticated tools\nfor understanding and predicting market behaviors.",
          "arxiv_id": "2404.02053v2"
        }
      ],
      "1": [
        {
          "title": "Multiple split approach -- multidimensional probabilistic forecasting of electricity markets",
          "year": "2024-07",
          "abstract": "In this article, a multiple split method is proposed that enables\nconstruction of multidimensional probabilistic forecasts of a selected set of\nvariables. The method uses repeated resampling to estimate uncertainty of\nsimultaneous multivariate predictions. This nonparametric approach links the\ngap between point and probabilistic predictions and can be combined with\ndifferent point forecasting methods. The performance of the method is evaluated\nwith data describing the German short-term electricity market. The results show\nthat the proposed approach provides highly accurate predictions. The gains from\nmultidimensional forecasting are the largest when functions of variables, such\nas price spread or residual load, are considered.\n  Finally, the method is used to support a decision process of a moderate\ngeneration utility that produces electricity from wind energy and sells it on\neither a day-ahead or an intraday market. The company makes decisions under\nhigh uncertainty because it knows neither the future production level nor the\nprices. We show that joint forecasting of both market prices and fundamentals\ncan be used to predict the distribution of a profit, and hence helps to design\na strategy that balances a level of income and a trading risk.",
          "arxiv_id": "2407.07795v1"
        },
        {
          "title": "Probabilistic forecasting of German electricity imbalance prices",
          "year": "2022-05",
          "abstract": "The exponential growth of renewable energy capacity has brought much\nuncertainty to electricity prices and to electricity generation. To address\nthis challenge, the energy exchanges have been developing further trading\npossibilities, especially the intraday and balancing markets. For an energy\ntrader participating in both markets, the forecasting of imbalance prices is of\nparticular interest. Therefore, in this manuscript we conduct a very short-term\nprobabilistic forecasting of imbalance prices, contributing to the scarce\nliterature in this novel subject. The forecasting is performed 30 minutes\nbefore the delivery, so that the trader might still choose the trading place.\nThe distribution of the imbalance prices is modelled and forecasted using\nmethods well-known in the electricity price forecasting literature: lasso with\nbootstrap, gamlss, and probabilistic neural networks. The methods are compared\nwith a naive benchmark in a meaningful rolling window study. The results\nprovide evidence of the efficiency between the intraday and balancing markets\nas the sophisticated methods do not substantially overperform the intraday\ncontinuous price index. On the other hand, they significantly improve the\nempirical coverage. The analysis was conducted on the German market, however it\ncould be easily applied to any other market of similar structure.",
          "arxiv_id": "2205.11439v1"
        },
        {
          "title": "Directional Price Forecasting in the Continuous Intraday Market under Consideration of Neighboring Products and Limit Order Books",
          "year": "2025-08",
          "abstract": "The increasing penetration of variable renewable energy and flexible demand\ntechnologies, such as electric vehicles and heat pumps, introduces significant\nuncertainty in power systems, resulting in greater imbalance; defined as the\ndeviation between scheduled and actual supply or demand. Short-term power\nmarkets, such as the European continuous intraday market, play a critical role\nin mitigating these imbalances by enabling traders to adjust forecasts close to\nreal time. Due to the high volatility of the continuous intraday market,\ntraders increasingly rely on electricity price forecasting to guide trading\ndecisions and mitigate price risk. However most electricity price forecasting\napproaches in the literature simplify the forecasting task. They focus on\nsingle benchmark prices, neglecting intra-product price dynamics and price\nsignals from the limit order book. They also underuse high-frequency and\ncross-product price data.\n  In turn, we propose a novel directional electricity price forecasting method\nfor hourly products in the European continuous intraday market. Our method\nincorporates short-term features from both hourly and quarter-hourly products\nand is evaluated using German European Power Exchange data from 2024-2025. The\nresults indicate that features derived from the limit order book are the most\ninfluential exogenous variables. In addition, features from neighboring\nproducts; especially those with delivery start times that overlap with the\ntrading period of the target product; improve forecast accuracy. Finally, our\nevaluation of the value captured by our electricity price forecasting suggests\nthat the proposed electricity price forecasting method has the potential to\ngenerate profit when applied in trading strategies.",
          "arxiv_id": "2509.04452v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:44:01Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}