{
  "topics": {
    "data": {
      "0": {
        "name": "0_portfolio_risk_optimal_problem",
        "keywords": [
          [
            "portfolio",
            0.037295840985533325
          ],
          [
            "risk",
            0.026630673800585255
          ],
          [
            "optimal",
            0.02526167823946226
          ],
          [
            "problem",
            0.022209767435280182
          ],
          [
            "model",
            0.021842235539440966
          ],
          [
            "market",
            0.020551362555024027
          ],
          [
            "optimization",
            0.016420104111620714
          ],
          [
            "time",
            0.016393828160620242
          ],
          [
            "investment",
            0.016194461310771173
          ],
          [
            "utility",
            0.015646271117061156
          ]
        ],
        "count": 572
      },
      "1": {
        "name": "1_learning_RL_reinforcement_reinforcement learning",
        "keywords": [
          [
            "learning",
            0.0406877967262751
          ],
          [
            "RL",
            0.033492719308165955
          ],
          [
            "reinforcement",
            0.031547015442973426
          ],
          [
            "reinforcement learning",
            0.03127476598618676
          ],
          [
            "Reinforcement",
            0.029741702625944104
          ],
          [
            "Learning",
            0.028693736995992116
          ],
          [
            "portfolio",
            0.02712856426462875
          ],
          [
            "Deep",
            0.023493454669066598
          ],
          [
            "agent",
            0.02321480275474974
          ],
          [
            "data",
            0.022343562277466596
          ]
        ],
        "count": 96
      },
      "2": {
        "name": "2_portfolio_market_correlation_network",
        "keywords": [
          [
            "portfolio",
            0.032445888528425414
          ],
          [
            "market",
            0.028353646440235067
          ],
          [
            "correlation",
            0.02658762036515694
          ],
          [
            "network",
            0.026542972822266267
          ],
          [
            "financial",
            0.023914206178405145
          ],
          [
            "portfolios",
            0.022653332805875625
          ],
          [
            "data",
            0.021286922200961067
          ],
          [
            "cryptocurrencies",
            0.020876450107884265
          ],
          [
            "risk",
            0.02026524952943888
          ],
          [
            "time",
            0.02019017356091375
          ]
        ],
        "count": 69
      },
      "3": {
        "name": "3_ESG_financial_portfolio_risk",
        "keywords": [
          [
            "ESG",
            0.05963546739841465
          ],
          [
            "financial",
            0.03175594977887111
          ],
          [
            "portfolio",
            0.0292758879250735
          ],
          [
            "risk",
            0.026984767181161707
          ],
          [
            "investors",
            0.025091970460961347
          ],
          [
            "investment",
            0.022258562544405777
          ],
          [
            "model",
            0.020081778006985577
          ],
          [
            "Social",
            0.019221195009170425
          ],
          [
            "energy",
            0.01882054508536291
          ],
          [
            "environmental",
            0.018196069997570976
          ]
        ],
        "count": 38
      },
      "4": {
        "name": "4_liquidity_exchange_blockchain_yield",
        "keywords": [
          [
            "liquidity",
            0.04051141500256663
          ],
          [
            "exchange",
            0.03913571807927307
          ],
          [
            "blockchain",
            0.03863962363396875
          ],
          [
            "yield",
            0.03192152870355561
          ],
          [
            "fees",
            0.03151970396663061
          ],
          [
            "market",
            0.031037109717202124
          ],
          [
            "arbitrage",
            0.025124449281698255
          ],
          [
            "fee",
            0.02511575536207969
          ],
          [
            "trading",
            0.02353847014318056
          ],
          [
            "Market",
            0.023456575620834957
          ]
        ],
        "count": 32
      }
    },
    "correlations": [
      [
        1.0,
        -0.5360877044859649,
        -0.3029513174213362,
        -0.6214722910598725,
        -0.41318948928611055
      ],
      [
        -0.5360877044859649,
        1.0,
        -0.50362384375843,
        -0.6946224552606572,
        -0.7080806755398609
      ],
      [
        -0.3029513174213362,
        -0.50362384375843,
        1.0,
        -0.63686506737043,
        -0.5895299207037716
      ],
      [
        -0.6214722910598725,
        -0.6946224552606572,
        -0.63686506737043,
        1.0,
        -0.6815910189766031
      ],
      [
        -0.41318948928611055,
        -0.7080806755398609,
        -0.5895299207037716,
        -0.6815910189766031,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        6,
        0,
        3,
        0,
        1
      ],
      "2020-02": [
        5,
        3,
        0,
        1,
        0
      ],
      "2020-03": [
        6,
        2,
        0,
        0,
        0
      ],
      "2020-04": [
        12,
        1,
        0,
        1,
        0
      ],
      "2020-05": [
        12,
        0,
        1,
        1,
        0
      ],
      "2020-06": [
        13,
        0,
        3,
        0,
        0
      ],
      "2020-07": [
        9,
        1,
        1,
        0,
        0
      ],
      "2020-08": [
        11,
        0,
        1,
        0,
        0
      ],
      "2020-09": [
        11,
        4,
        2,
        0,
        0
      ],
      "2020-10": [
        7,
        3,
        1,
        0,
        0
      ],
      "2020-11": [
        11,
        2,
        1,
        0,
        0
      ],
      "2020-12": [
        11,
        4,
        1,
        0,
        0
      ],
      "2021-01": [
        5,
        1,
        2,
        2,
        1
      ],
      "2021-02": [
        6,
        2,
        0,
        0,
        0
      ],
      "2021-03": [
        14,
        3,
        3,
        0,
        0
      ],
      "2021-04": [
        9,
        2,
        2,
        0,
        2
      ],
      "2021-05": [
        7,
        1,
        2,
        1,
        2
      ],
      "2021-06": [
        15,
        0,
        4,
        0,
        3
      ],
      "2021-07": [
        9,
        1,
        3,
        0,
        1
      ],
      "2021-08": [
        10,
        1,
        0,
        0,
        0
      ],
      "2021-09": [
        4,
        1,
        1,
        0,
        1
      ],
      "2021-10": [
        8,
        0,
        1,
        1,
        1
      ],
      "2021-11": [
        11,
        3,
        5,
        1,
        0
      ],
      "2021-12": [
        10,
        2,
        1,
        0,
        0
      ],
      "2022-01": [
        14,
        1,
        0,
        1,
        1
      ],
      "2022-02": [
        15,
        1,
        2,
        0,
        1
      ],
      "2022-03": [
        7,
        0,
        1,
        0,
        0
      ],
      "2022-04": [
        5,
        0,
        0,
        0,
        0
      ],
      "2022-05": [
        8,
        1,
        0,
        0,
        0
      ],
      "2022-06": [
        12,
        5,
        1,
        2,
        0
      ],
      "2022-07": [
        6,
        1,
        1,
        0,
        0
      ],
      "2022-08": [
        12,
        0,
        1,
        0,
        1
      ],
      "2022-09": [
        7,
        2,
        0,
        0,
        1
      ],
      "2022-10": [
        12,
        0,
        3,
        0,
        1
      ],
      "2022-11": [
        9,
        0,
        1,
        0,
        1
      ],
      "2022-12": [
        7,
        3,
        2,
        1,
        0
      ],
      "2023-01": [
        4,
        2,
        0,
        0,
        0
      ],
      "2023-02": [
        12,
        0,
        3,
        1,
        1
      ],
      "2023-03": [
        14,
        0,
        2,
        0,
        1
      ],
      "2023-04": [
        10,
        0,
        1,
        0,
        1
      ],
      "2023-05": [
        11,
        2,
        2,
        2,
        0
      ],
      "2023-06": [
        7,
        4,
        2,
        2,
        3
      ],
      "2023-07": [
        12,
        5,
        2,
        1,
        0
      ],
      "2023-08": [
        12,
        2,
        3,
        0,
        0
      ],
      "2023-09": [
        9,
        3,
        0,
        1,
        1
      ],
      "2023-10": [
        13,
        4,
        2,
        1,
        2
      ],
      "2023-11": [
        14,
        5,
        1,
        3,
        0
      ],
      "2023-12": [
        12,
        4,
        2,
        1,
        0
      ],
      "2024-01": [
        6,
        0,
        5,
        0,
        0
      ],
      "2024-02": [
        10,
        2,
        2,
        2,
        0
      ],
      "2024-03": [
        5,
        1,
        3,
        2,
        2
      ],
      "2024-04": [
        6,
        3,
        2,
        3,
        0
      ],
      "2024-05": [
        6,
        2,
        3,
        0,
        2
      ],
      "2024-06": [
        13,
        1,
        3,
        0,
        2
      ],
      "2024-07": [
        12,
        3,
        4,
        2,
        0
      ],
      "2024-08": [
        9,
        1,
        2,
        0,
        1
      ],
      "2024-09": [
        9,
        3,
        3,
        0,
        0
      ],
      "2024-10": [
        18,
        2,
        4,
        0,
        1
      ],
      "2024-11": [
        15,
        0,
        4,
        1,
        1
      ],
      "2024-12": [
        13,
        4,
        6,
        0,
        0
      ],
      "2025-01": [
        14,
        4,
        1,
        0,
        0
      ],
      "2025-02": [
        7,
        2,
        1,
        1,
        1
      ],
      "2025-03": [
        15,
        2,
        3,
        0,
        0
      ],
      "2025-04": [
        9,
        4,
        4,
        0,
        0
      ],
      "2025-05": [
        7,
        3,
        1,
        0,
        1
      ],
      "2025-06": [
        11,
        1,
        1,
        0,
        0
      ],
      "2025-07": [
        20,
        3,
        3,
        2,
        1
      ],
      "2025-08": [
        10,
        4,
        0,
        3,
        3
      ],
      "2025-09": [
        4,
        4,
        1,
        1,
        0
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Portfolio optimization with two quasiconvex risk measures",
          "year": "2020-12",
          "abstract": "We study a static portfolio optimization problem with two risk measures: a\nprinciple risk measure in the objective function and a secondary risk measure\nwhose value is controlled in the constraints. This problem is of interest when\nit is necessary to consider the risk preferences of two parties, such as a\nportfolio manager and a regulator, at the same time. A special case of this\nproblem where the risk measures are assumed to be coherent (positively\nhomogeneous) is studied recently in a joint work of the author. The present\npaper extends the analysis to a more general setting by assuming that the two\nrisk measures are only quasiconvex. First, we study the case where the\nprincipal risk measure is convex. We introduce a dual problem, show that there\nis zero duality gap between the portfolio optimization problem and the dual\nproblem, and finally identify a condition under which the Lagrange multiplier\nassociated to the dual problem at optimality gives an optimal portfolio. Next,\nwe study the general case without the convexity assumption and show that an\napproximately optimal solution with prescribed optimality gap can be achieved\nby using the well-known bisection algorithm combined with a duality result that\nwe prove.",
          "arxiv_id": "2012.06173v1"
        },
        {
          "title": "Exponential utility maximization in small/large financial markets",
          "year": "2022-08",
          "abstract": "Obtaining utility maximizing optimal portfolios in closed form is a\nchallenging issue when the return vector follows a more general distribution\nthan the normal one. In this note, we give closed form expressions, in markets\nbased on finitely many assets, for optimal portfolios that maximize the\nexpected exponential utility when the return vector follows normal\nmean-variance mixture models. We then consider large financial markets based on\nnormal mean-variance mixture models also and show that, under exponential\nutility, the optimal utilities based on small markets converge to the optimal\nutility in the large financial market. This result shows, in particular, that\nto reach optimal utility level investors need to diversify their portfolios to\ninclude infinitely many assets into their portfolio and with portfolios based\non any set of only finitely many assets, they never be able to reach optimum\nlevel of utility. In this paper, we also consider portfolio optimization\nproblems with more general class of utility functions and provide an\neasy-to-implement numerical procedure for locating optimal portfolios.\nEspecially, our approach in this part of the paper reduces a high dimensional\nproblem in locating optimal portfolio into a three dimensional problem for a\ngeneral class of utility functions.",
          "arxiv_id": "2208.06549v4"
        },
        {
          "title": "A Portfolio Choice Problem Under Risk Capacity Constraint",
          "year": "2020-05",
          "abstract": "This paper studies an optimal investing problem for a retiree facing\nlongevity risk and living standard risk. We formulate the investing problem as\na portfolio choice problem under a time-varying risk capacity constraint. We\nderive the optimal investment strategy under the specific condition on model\nparameters in terms of second-order ordinary differential equations. We\ndemonstrate an endogenous number that measures the expected value to sustain\nthe spending post-retirement. The optimal portfolio is nearly neutral to the\nstock market movement if the portfolio's value is higher than this number; but,\nif the portfolio is not worth enough to sustain the retirement spending, the\nretiree actively invests in the stock market for the higher expected return.\nBesides, we solve an optimal portfolio choice problem under a leverage\nconstraint and show that the optimal portfolio would lose significantly in\nstressed markets. This paper shows that the time-varying risk capacity\nconstraint has important implications for asset allocation in retirement.",
          "arxiv_id": "2005.13741v3"
        }
      ],
      "1": [
        {
          "title": "A Deep Reinforcement Learning Framework for Dynamic Portfolio Optimization: Evidence from China's Stock Market",
          "year": "2024-12",
          "abstract": "Artificial intelligence is transforming financial investment decision-making\nframeworks, with deep reinforcement learning demonstrating substantial\npotential in robo-advisory applications. This paper addresses the limitations\nof traditional portfolio optimization methods in dynamic asset weight\nadjustment through the development of a deep reinforcement learning-based\ndynamic optimization model grounded in practical trading processes. The\nresearch advances two key innovations: first, the introduction of a novel\nSharpe ratio reward function engineered for Actor-Critic deep reinforcement\nlearning algorithms, which ensures stable convergence during training while\nconsistently achieving positive average Sharpe ratios; second, the development\nof an innovative comprehensive approach to portfolio optimization utilizing\ndeep reinforcement learning, which significantly enhances model optimization\ncapability through the integration of random sampling strategies during\ntraining with image-based deep neural network architectures for\nmulti-dimensional financial time series data processing, average Sharpe ratio\nreward functions, and deep reinforcement learning algorithms. The empirical\nanalysis validates the model using randomly selected constituent stocks from\nthe CSI 300 Index, benchmarking against established financial econometric\noptimization models. Backtesting results demonstrate the model's efficacy in\noptimizing portfolio allocation and mitigating investment risk, yielding\nsuperior comprehensive performance metrics.",
          "arxiv_id": "2412.18563v3"
        },
        {
          "title": "Developing A Multi-Agent and Self-Adaptive Framework with Deep Reinforcement Learning for Dynamic Portfolio Risk Management",
          "year": "2024-02",
          "abstract": "Deep or reinforcement learning (RL) approaches have been adapted as reactive\nagents to quickly learn and respond with new investment strategies for\nportfolio management under the highly turbulent financial market environments\nin recent years. In many cases, due to the very complex correlations among\nvarious financial sectors, and the fluctuating trends in different financial\nmarkets, a deep or reinforcement learning based agent can be biased in\nmaximising the total returns of the newly formulated investment portfolio while\nneglecting its potential risks under the turmoil of various market conditions\nin the global or regional sectors. Accordingly, a multi-agent and self-adaptive\nframework namely the MASA is proposed in which a sophisticated multi-agent\nreinforcement learning (RL) approach is adopted through two cooperating and\nreactive agents to carefully and dynamically balance the trade-off between the\noverall portfolio returns and their potential risks. Besides, a very flexible\nand proactive agent as the market observer is integrated into the MASA\nframework to provide some additional information on the estimated market trends\nas valuable feedbacks for multi-agent RL approach to quickly adapt to the\never-changing market conditions. The obtained empirical results clearly reveal\nthe potential strengths of our proposed MASA framework based on the multi-agent\nRL approach against many well-known RL-based approaches on the challenging data\nsets of the CSI 300, Dow Jones Industrial Average and S&P 500 indexes over the\npast 10 years. More importantly, our proposed MASA framework shed lights on\nmany possible directions for future investigation.",
          "arxiv_id": "2402.00515v4"
        },
        {
          "title": "Deep Reinforcement Learning for Asset Allocation in US Equities",
          "year": "2020-10",
          "abstract": "Reinforcement learning is a machine learning approach concerned with solving\ndynamic optimization problems in an almost model-free way by maximizing a\nreward function in state and action spaces. This property makes it an exciting\narea of research for financial problems. Asset allocation, where the goal is to\nobtain the weights of the assets that maximize the rewards in a given state of\nthe market considering risk and transaction costs, is a problem easily framed\nusing a reinforcement learning framework. It is first a prediction problem for\nexpected returns and covariance matrix and then an optimization problem for\nreturns, risk, and market impact. Investors and financial researchers have been\nworking with approaches like mean-variance optimization, minimum variance, risk\nparity, and equally weighted and several methods to make expected returns and\ncovariance matrices' predictions more robust. This paper demonstrates the\napplication of reinforcement learning to create a financial model-free solution\nto the asset allocation problem, learning to solve the problem using time\nseries and deep neural networks. We demonstrate this on daily data for the top\n24 stocks in the US equities universe with daily rebalancing. We use a deep\nreinforcement model on US stocks using different architectures. We use Long\nShort Term Memory networks, Convolutional Neural Networks, and Recurrent Neural\nNetworks and compare them with more traditional portfolio management. The Deep\nReinforcement Learning approach shows better results than traditional\napproaches using a simple reward function and only being given the time series\nof stocks. In Finance, no training to test error generalization results come\nguaranteed. We can say that the modeling framework can deal with time series\nprediction and asset allocation, including transaction costs.",
          "arxiv_id": "2010.04404v1"
        }
      ],
      "2": [
        {
          "title": "A network-based strategy of price correlations for optimal cryptocurrency portfolios",
          "year": "2023-04",
          "abstract": "A cryptocurrency is a digital asset maintained by a decentralised system\nusing cryptography. Investors in this emerging digital market are exploring the\nprofitability potential of portfolios in place of single coins. Portfolios are\nparticularly useful given that price forecasting in such a volatile market is\nchallenging. The crypto market is a self-organised complex system where the\ncomplex inter-dependencies between the cryptocurrencies may be exploited to\nunderstand the market dynamics and build efficient portfolios. In this letter,\nwe use network methods to identify highly decorrelated cryptocurrencies to\ncreate diversified portfolios using the Markowitz Portfolio Theory agnostic to\nfuture market behaviour. The performance of our network-based portfolios is\noptimal with 46 coins and superior to benchmarks up to an investment horizon of\n14 days, reaching up to 1,066% average expected return within 1 day, with\nreasonable associated risks. We also show that popular cryptocurrencies are\ntypically not included in the optimal portfolios. Past price correlations\nreduce risk and may improve the performance of crypto portfolios in comparison\nto methodologies based exclusively on price auto-correlations. Short-term\ncrypto investments may be competitive to traditional high-risk investments such\nas the stock market or commodity market but call for caution given the high\nvariability of prices.",
          "arxiv_id": "2304.02362v1"
        },
        {
          "title": "Forecasting Financial Market Structure from Network Features using Machine Learning",
          "year": "2021-10",
          "abstract": "We propose a model that forecasts market correlation structure from link- and\nnode-based financial network features using machine learning. For such, market\nstructure is modeled as a dynamic asset network by quantifying time-dependent\nco-movement of asset price returns across company constituents of major global\nmarket indices. We provide empirical evidence using three different network\nfiltering methods to estimate market structure, namely Dynamic Asset Graph\n(DAG), Dynamic Minimal Spanning Tree (DMST) and Dynamic Threshold Networks\n(DTN). Experimental results show that the proposed model can forecast market\nstructure with high predictive performance with up to $40\\%$ improvement over a\ntime-invariant correlation-based benchmark. Non-pair-wise correlation features\nshowed to be important compared to traditionally used pair-wise correlation\nmeasures for all markets studied, particularly in the long-term forecasting of\nstock market structure. Evidence is provided for stock constituents of the\nDAX30, EUROSTOXX50, FTSE100, HANGSENG50, NASDAQ100 and NIFTY50 market indices.\nFindings can be useful to improve portfolio selection and risk management\nmethods, which commonly rely on a backward-looking covariance matrix to\nestimate portfolio risk.",
          "arxiv_id": "2110.11751v1"
        },
        {
          "title": "Network-based diversification of stock and cryptocurrency portfolios",
          "year": "2024-08",
          "abstract": "Maintaining a balance between returns and volatility is a common strategy for\nportfolio diversification, whether investing in traditional equities or digital\nassets like cryptocurrencies. One approach for diversification is the\napplication of community detection or clustering, using a network representing\nthe relationships between assets. We examine two network representations, one\nbased on a standard distance matrix based on correlation, and another based on\nmutual information. The Louvain and Affinity propagation algorithms were\nemployed for finding the network communities (clusters) based on annual data.\nFurthermore, we examine building assets' co-occurrence networks, where\ncommunities are detected for each month throughout a whole year and then the\nlinks represent how often assets belong to the same community. Portfolios are\nthen constructed by selecting several assets from each community based on local\nproperties (degree centrality), global properties (closeness centrality), or\nexplained variance (Principal component analysis), with three value ranges\n(max, med, min), calculated on a maximal spanning tree or a fully connected\ncommunity sub-graph. We explored these various strategies on data from the S\\&P\n500 and the Top 203 cryptocurrencies with a market cap above 2M USD in the\nperiod from Jan 2019 to Sep 2022. Moreover, we study into more details the\nperiods of the beginning of the COVID-19 outbreak and the start of the war in\nUkraine. The results confirm some of the previous findings already known for\ntraditional stock markets and provide some further insights, while they reveal\nan opposing trend in the crypto-assets market.",
          "arxiv_id": "2408.11739v2"
        }
      ],
      "3": [
        {
          "title": "Dissecting the explanatory power of ESG features on equity returns by sector, capitalization, and year with interpretable machine learning",
          "year": "2022-01",
          "abstract": "We systematically investigate the links between price returns and\nEnvironment, Social and Governance (ESG) scores in the European equity market.\nUsing interpretable machine learning, we examine whether ESG scores can explain\nthe part of price returns not accounted for by classic equity factors,\nespecially the market one. We propose a cross-validation scheme with random\ncompany-wise validation to mitigate the relative initial lack of quantity and\nquality of ESG data, which allows us to use most of the latest and best data to\nboth train and validate our models. Gradient boosting models successfully\nexplain the part of annual price returns not accounted for by the market\nfactor. We check with benchmark features that ESG data explain significantly\nbetter price returns than basic fundamental features alone. The most relevant\nESG score encodes controversies. Finally, we find the opposite effects of\nbetter ESG scores on the price returns of small and large capitalization\ncompanies: better ESG scores are generally associated with larger price returns\nfor the latter and reversely for the former.",
          "arxiv_id": "2201.04393v5"
        },
        {
          "title": "Navigating Uncertainty in ESG Investing",
          "year": "2023-10",
          "abstract": "The widespread confusion among investors regarding Environmental, Social, and\nGovernance (ESG) rankings assigned by rating agencies has underscored a\ncritical issue in sustainable investing. To address this uncertainty, our\nresearch has devised methods that not only recognize this ambiguity but also\noffer tailored investment strategies for different investor profiles. By\ndeveloping ESG ensemble strategies and integrating ESG scores into a\nReinforcement Learning (RL) model, we aim to optimize portfolios that cater to\nboth financial returns and ESG-focused outcomes. Additionally, by proposing the\nDouble-Mean-Variance model, we classify three types of investors based on their\nrisk preferences. We also introduce ESG-adjusted Capital Asset Pricing Models\n(CAPMs) to assess the performance of these optimized portfolios. Ultimately,\nour comprehensive approach provides investors with tools to navigate the\ninherent ambiguities of ESG ratings, facilitating more informed investment\ndecisions.",
          "arxiv_id": "2310.02163v2"
        },
        {
          "title": "Managing ESG Ratings Disagreement in Sustainable Portfolio Selection",
          "year": "2023-12",
          "abstract": "Sustainable Investing identifies the approach of investors whose aim is\ntwofold: on the one hand, they want to achieve the best compromise between\nportfolio risk and return, but they also want to take into account the\nsustainability of their investment, assessed through some Environmental,\nSocial, and Governance (ESG) criteria. The inclusion of sustainable goals in\nthe portfolio selection process may have an actual impact on financial\nportfolio performance. ESG indices provided by the rating agencies are\ngenerally considered good proxies for the performance in sustainability of an\ninvestment, as well as, appropriate measures for Socially Responsible\nInvestments (SRI) in the market. In this framework of analysis, the lack of\nalignment between ratings provided by different agencies is a crucial issue\nthat inevitably undermines the robustness and reliability of these evaluation\nmeasures. In fact, the ESG rating disagreement may produce conflicting\ninformation, implying a difficulty for the investor in the portfolio ESG\nevaluation. This may cause underestimation or overestimation of the market\nopportunities for a sustainable investment. In this paper, we deal with a\nmulti-criteria portfolio selection problem taking into account risk, return,\nand ESG criteria. For the ESG evaluation of the securities in the market, we\nconsider more than one agency and propose a new approach to overcome the\nproblem related to the disagreement between the ESG ratings by different\nagencies. We propose a nonlinear optimization model for our three-criteria\nportfolio selection problem. We show that it can be reformulated as an\nequivalent convex quadratic program by exploiting a technique known in the\nliterature as the k-sum optimization strategy. An extensive empirical analysis\nof the performance of this model is provided on real-world financial data sets.",
          "arxiv_id": "2312.10739v1"
        }
      ],
      "4": [
        {
          "title": "Impermanent Loss in Uniswap v3",
          "year": "2021-11",
          "abstract": "AMMs are autonomous smart contracts deployed on a blockchain that make\nmarkets between different assets that live on that chain. In this paper we are\nexamining a specific class of AMMs called Constant Function Market Makers whose\ntrading profile, ignoring fees, is determined by their bonding curve. This\nclass of AMM suffers from what is commonly referred to as Impermanent Loss,\nwhich we have previously identified as the Gamma component of the associated\nself-financing trading strategy and which is the risk that LP providers wager\nagainst potential fee earnings.\n  The recent Uniswap v3 release has popularized the concept of leveraged\nliquidity provision - wherein the trading range in which liquidity is provided\nis reduced and achieves a higher degree of capital efficiency through\nelimination of unused collateral. This leverage increases the fees earned, but\nit also increases the risk taken, ie the IL. Fee levels on Uniswap v3 are well\npublicized so, in this paper, we focus on calculating the IL.\n  We found that for the 17 pools we analyzed, covering 43% of TVL and chosen by\nsize, composite tokens and data availability, total fees earned since inception\nuntil the cut-off date was $199.3m. We also found that the total IL suffered by\nLPs during this period was USD 260.1m, meaning that in aggregate those LPs\nwould have been better off by USD 60.8m had they simply HODLd.",
          "arxiv_id": "2111.09192v1"
        },
        {
          "title": "UNISWAP: Impermanent Loss and Risk Profile of a Liquidity Provider",
          "year": "2021-06",
          "abstract": "Uniswap is a decentralized exchange (DEX) and was first launched on November\n2, 2018 on the Ethereum mainnet [1] and is part of an Ecosystem of products in\nDecentralized Finance (DeFi). It replaces a traditional order book type of\ntrading common on centralized exchanges (CEX) with a deterministic model that\nswaps currencies (or tokens/assets) along a fixed price function determined by\nthe amount of currencies supplied by the liquidity providers. Liquidity\nproviders can be regarded as investors in the decentralized exchange and earn\nfixed commissions per trade. They lock up funds in liquidity pools for distinct\npairs of currencies allowing market participants to swap them using the fixed\nprice function. Liquidity providers take on market risk as a liquidity provider\nin exchange for earning commissions on each trade. Here we analyze the risk\nprofile of a liquidity provider and the so called impermanent (unrealized) loss\nin particular. We provide an improved version of the commonly denoted\nimpermanent loss function for Uniswap v2 on the semi-infinite domain. The\ndifferences between Uniswap v2 and v3 are also discussed.",
          "arxiv_id": "2106.14404v1"
        },
        {
          "title": "Optimal Fees for Liquidity Provision in Automated Market Makers",
          "year": "2025-08",
          "abstract": "Passive liquidity providers (LPs) in automated market makers (AMMs) face\nlosses due to adverse selection (LVR), which static trading fees often fail to\noffset in practice. We study the key determinants of LP profitability in a\ndynamic reduced-form model where an AMM operates in parallel with a centralized\nexchange (CEX), traders route their orders optimally to the venue offering the\nbetter price, and arbitrageurs exploit price discrepancies. Using large-scale\nsimulations and real market data, we analyze how LP profits vary with market\nconditions such as volatility and trading volume, and characterize the optimal\nAMM fee as a function of these conditions. We highlight the mechanisms driving\nthese relationships through extensive comparative statics, and confirm the\nmodel's relevance through market data calibration. A key trade-off emerges:\nfees must be low enough to attract volume, yet high enough to earn sufficient\nrevenues and mitigate arbitrage losses. We find that under normal market\nconditions, the optimal AMM fee is competitive with the trading cost on the CEX\nand remarkably stable, whereas in periods of very high volatility, a high fee\nprotects passive LPs from severe losses. These findings suggest that a\nthreshold-type dynamic fee schedule is both robust enough to market conditions\nand improves LP outcomes.",
          "arxiv_id": "2508.08152v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:43:52Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}