{
  "topics": {
    "data": {
      "0": {
        "name": "0_volatility_model_options_models",
        "keywords": [
          [
            "volatility",
            0.04548349596953154
          ],
          [
            "model",
            0.040267107618677855
          ],
          [
            "options",
            0.030433459241516997
          ],
          [
            "models",
            0.030182644386563217
          ],
          [
            "pricing",
            0.028262427503392352
          ],
          [
            "option",
            0.025524183075085145
          ],
          [
            "stochastic",
            0.02381832221449646
          ],
          [
            "process",
            0.020531481398198242
          ],
          [
            "rough",
            0.019627105789461155
          ],
          [
            "time",
            0.01927451775024423
          ]
        ],
        "count": 339
      },
      "1": {
        "name": "1_optimal_problem_time_equilibrium",
        "keywords": [
          [
            "optimal",
            0.04146127674522907
          ],
          [
            "problem",
            0.03619877899565976
          ],
          [
            "time",
            0.025956957384367485
          ],
          [
            "equilibrium",
            0.025709807838710384
          ],
          [
            "utility",
            0.023522242533964254
          ],
          [
            "consumption",
            0.022552928992713307
          ],
          [
            "market",
            0.021997333341773798
          ],
          [
            "control",
            0.020389530965630075
          ],
          [
            "stochastic",
            0.020160908920323458
          ],
          [
            "mean",
            0.01979151686177007
          ]
        ],
        "count": 257
      },
      "2": {
        "name": "2_risk_measures_risk measures_arbitrage",
        "keywords": [
          [
            "risk",
            0.05678842184149232
          ],
          [
            "measures",
            0.04708204458102298
          ],
          [
            "risk measures",
            0.036692183059044085
          ],
          [
            "arbitrage",
            0.022164103604634132
          ],
          [
            "measure",
            0.020085000218274543
          ],
          [
            "robust",
            0.018215479279559056
          ],
          [
            "model",
            0.01789777271473482
          ],
          [
            "market",
            0.017731036551968938
          ],
          [
            "price",
            0.01766052244929347
          ],
          [
            "results",
            0.01695694733296588
          ]
        ],
        "count": 190
      },
      "3": {
        "name": "3_liquidity_market_pool_arbitrage",
        "keywords": [
          [
            "liquidity",
            0.09393261579564388
          ],
          [
            "market",
            0.04628145142568761
          ],
          [
            "pool",
            0.03755722324876131
          ],
          [
            "arbitrage",
            0.03673545776585984
          ],
          [
            "AMMs",
            0.03670415028107588
          ],
          [
            "AMM",
            0.03630214832505432
          ],
          [
            "fees",
            0.03475131341616845
          ],
          [
            "Market",
            0.03206982915796009
          ],
          [
            "fee",
            0.028572560876052016
          ],
          [
            "Makers",
            0.028211157030729867
          ]
        ],
        "count": 57
      }
    },
    "correlations": [
      [
        1.0,
        -0.44646621751112037,
        -0.4365359420059426,
        -0.6439154540637023
      ],
      [
        -0.44646621751112037,
        1.0,
        -0.33384764462858346,
        -0.6246561711969107
      ],
      [
        -0.4365359420059426,
        -0.33384764462858346,
        1.0,
        -0.6230334200113875
      ],
      [
        -0.6439154540637023,
        -0.6246561711969107,
        -0.6230334200113875,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        14,
        2,
        4,
        3
      ],
      "2020-02": [
        15,
        3,
        6,
        2
      ],
      "2020-03": [
        8,
        8,
        5,
        3
      ],
      "2020-04": [
        13,
        6,
        6,
        4
      ],
      "2020-05": [
        6,
        6,
        6,
        4
      ],
      "2020-06": [
        15,
        12,
        6,
        5
      ],
      "2020-07": [
        8,
        6,
        8,
        1
      ],
      "2020-08": [
        8,
        10,
        3,
        2
      ],
      "2020-09": [
        9,
        3,
        12,
        1
      ],
      "2020-10": [
        6,
        10,
        6,
        0
      ],
      "2020-11": [
        12,
        6,
        6,
        2
      ],
      "2020-12": [
        8,
        6,
        7,
        1
      ],
      "2021-01": [
        10,
        12,
        3,
        2
      ],
      "2021-02": [
        8,
        9,
        5,
        0
      ],
      "2021-03": [
        6,
        6,
        5,
        2
      ],
      "2021-04": [
        14,
        5,
        4,
        4
      ],
      "2021-05": [
        9,
        8,
        3,
        1
      ],
      "2021-06": [
        11,
        9,
        3,
        1
      ],
      "2021-07": [
        10,
        6,
        8,
        0
      ],
      "2021-08": [
        8,
        5,
        5,
        3
      ],
      "2021-09": [
        11,
        4,
        4,
        0
      ],
      "2021-10": [
        5,
        5,
        5,
        2
      ],
      "2021-11": [
        11,
        4,
        9,
        2
      ],
      "2021-12": [
        15,
        7,
        5,
        3
      ],
      "2022-01": [
        9,
        6,
        4,
        1
      ],
      "2022-02": [
        11,
        6,
        6,
        1
      ],
      "2022-03": [
        7,
        2,
        7,
        1
      ],
      "2022-04": [
        10,
        4,
        4,
        1
      ],
      "2022-05": [
        7,
        5,
        2,
        0
      ],
      "2022-06": [
        3,
        8,
        3,
        1
      ],
      "2022-07": [
        19,
        3,
        3,
        0
      ],
      "2022-08": [
        10,
        5,
        2,
        1
      ],
      "2022-09": [
        10,
        4,
        7,
        4
      ],
      "2022-10": [
        6,
        9,
        4,
        2
      ],
      "2022-11": [
        13,
        12,
        4,
        1
      ],
      "2022-12": [
        15,
        8,
        1,
        4
      ],
      "2023-01": [
        12,
        2,
        6,
        0
      ],
      "2023-02": [
        7,
        7,
        4,
        3
      ],
      "2023-03": [
        12,
        5,
        8,
        3
      ],
      "2023-04": [
        6,
        6,
        2,
        3
      ],
      "2023-05": [
        9,
        6,
        5,
        1
      ],
      "2023-06": [
        9,
        8,
        6,
        2
      ],
      "2023-07": [
        10,
        6,
        3,
        4
      ],
      "2023-08": [
        11,
        7,
        4,
        1
      ],
      "2023-09": [
        13,
        5,
        1,
        2
      ],
      "2023-10": [
        7,
        5,
        2,
        4
      ],
      "2023-11": [
        14,
        9,
        7,
        3
      ],
      "2023-12": [
        7,
        13,
        5,
        0
      ],
      "2024-01": [
        10,
        9,
        2,
        2
      ],
      "2024-02": [
        11,
        6,
        4,
        1
      ],
      "2024-03": [
        13,
        8,
        3,
        5
      ],
      "2024-04": [
        4,
        3,
        2,
        3
      ],
      "2024-05": [
        15,
        7,
        5,
        2
      ],
      "2024-06": [
        14,
        9,
        12,
        1
      ],
      "2024-07": [
        12,
        13,
        5,
        3
      ],
      "2024-08": [
        11,
        8,
        3,
        1
      ],
      "2024-09": [
        10,
        3,
        8,
        2
      ],
      "2024-10": [
        13,
        8,
        5,
        2
      ],
      "2024-11": [
        12,
        8,
        5,
        0
      ],
      "2024-12": [
        13,
        11,
        2,
        3
      ],
      "2025-01": [
        6,
        11,
        3,
        2
      ],
      "2025-02": [
        11,
        9,
        3,
        4
      ],
      "2025-03": [
        17,
        8,
        6,
        4
      ],
      "2025-04": [
        7,
        8,
        3,
        1
      ],
      "2025-05": [
        11,
        7,
        7,
        2
      ],
      "2025-06": [
        11,
        2,
        4,
        5
      ],
      "2025-07": [
        12,
        7,
        1,
        5
      ],
      "2025-08": [
        19,
        3,
        6,
        4
      ],
      "2025-09": [
        2,
        6,
        5,
        2
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Local volatility under rough volatility",
          "year": "2022-04",
          "abstract": "Several asymptotic results for the implied volatility generated by a rough\nvolatility model have been obtained in recent years (notably in the\nsmall-maturity regime), providing a better understanding of the shapes of the\nvolatility surface induced by rough volatility models, and supporting their\ncalibration power to S&P500 option data. Rough volatility models also generate\na local volatility surface, via the so-called Markovian projection of the\nstochastic volatility. We complement the existing results on the implied\nvolatility by studying the asymptotic behavior of the local volatility surface\ngenerated by a class of rough stochastic volatility models, encompassing the\nrough Bergomi model. Notably, we observe that the celebrated \"1/2 skew rule\"\nlinking the short-term at-the-money skew of the implied volatility to the\nshort-term at-the-money skew of the local volatility, a consequence of the\ncelebrated \"harmonic mean formula\" of [Berestycki, Busca, and Florent, QF\n2002], is replaced by a new rule: the ratio of the at-the-money implied and\nlocal volatility skews tends to the constant 1/(H + 3/2) (as opposed to the\nconstant 1/2), where H is the regularity index of the underlying instantaneous\nvolatility process.",
          "arxiv_id": "2204.02376v2"
        },
        {
          "title": "Semimartingale and continuous-time Markov chain approximation for rough stochastic local volatility models",
          "year": "2021-10",
          "abstract": "Rough volatility models have recently been empirically shown to provide a\ngood fit to historical volatility time series and implied volatility smiles of\nSPX options. They are continuous-time stochastic volatility models, whose\nvolatility process is driven by a fractional Brownian motion with Hurst\nparameter less than half. Due to the challenge that it is neither a\nsemimartingale nor a Markov process, there is no unified method that not only\napplies to all rough volatility models, but also is computationally efficient.\nThis paper proposes a semimartingale and continuous-time Markov chain (CTMC)\napproximation approach for the general class of rough stochastic local\nvolatility (RSLV) models. In particular, we introduce the perturbed stochastic\nlocal volatility (PSLV) model as the semimartingale approximation for the RSLV\nmodel and establish its existence , uniqueness and Markovian representation. We\npropose a fast CTMC algorithm and prove its weak convergence. Numerical\nexperiments demonstrate the accuracy and high efficiency of the method in\npricing European, barrier and American options. Comparing with existing\nliterature, a significant reduction in the CPU time to arrive at the same level\nof accuracy is observed.",
          "arxiv_id": "2110.08320v2"
        },
        {
          "title": "Analytic estimation of parameters of stochastic volatility diffusion models with exponential-affine characteristic function for currency option pricing",
          "year": "2025-07",
          "abstract": "This dissertation develops and justifies a novel method for deriving\napproximate formulas to estimate two parameters in stochastic volatility\ndiffusion models with exponentially-affine characteristic functions and single-\nor two-factor variance. These formulas aim to improve the accuracy of option\npricing and enhance the calibration process by providing reliable initial\nvalues for local minimization algorithms. The parameters relate to the\nvolatility of the stochastic factor in instantaneous variance dynamics and the\ncorrelation between stochastic factors and asset price dynamics.\n  The study comprises five chapters. Chapter one outlines the currency option\nmarket, pricing methods, and the general structure of stochastic volatility\nmodels. Chapter two derives the replication strategy dynamics and introduces a\nnew two-factor volatility model: the OUOU model. Chapter three analyzes the\ndistribution and surface dynamics of implied volatilities using principal\ncomponent and common factor analysis. Chapter four discusses calibration\nmethods for stochastic volatility models, particularly the Heston model, and\npresents the new Implied Central Moments method to estimate parameters in the\nHeston and Sch\\\"obel-Zhu models. Extensions to two-factor models, Bates and\nOUOU, are also explored. Chapter five evaluates the performance of the proposed\nformulas on the EURUSD options market, demonstrating the superior accuracy of\nthe new method.\n  The dissertation successfully meets its research objectives, expanding tools\nfor derivative pricing and risk assessment. Key contributions include faster\nand more precise parameter estimation formulas and the introduction of the OUOU\nmodel - an extension of the Sch\\\"obel-Zhu model with a semi-analytical\nvaluation formula for European options, previously unexamined in the\nliterature.",
          "arxiv_id": "2507.11868v1"
        }
      ],
      "1": [
        {
          "title": "Strategic mean-variance investing under mean-reverting stock returns",
          "year": "2022-01",
          "abstract": "In this report we derive the strategic (deterministic) allocation to bonds\nand stocks resulting in the optimal mean-variance trade-off on a given\ninvestment horizon. The underlying capital market features a mean-reverting\nprocess for equity returns, and the primary question of interest is how\nmean-reversion effects the optimal strategy and the resulting portfolio value\nat the horizon. In particular, we are interested in knowing under which\nassumptions and on which horizons, the risk-reward trade-off is so favourable\nthat the value of the portfolio is effectively bounded from below on the\nhorizon. In this case, we might think of the portfolio as providing a\nstochastic excess return on top of a \"guarantee\" (the lower bound).\n  Deriving optimal strategies is a well-known discipline in mathematical\nfinance. The modern approach is to derive and solve the Hamilton-Jacobi-Bellman\n(HJB) differential equation characterizing the strategy leading to highest\nexpected utility, for given utility function. However, for two reasons we\napproach the problem differently in this work. First, we wish to find the\noptimal strategy depending on time only, i.e., we do not allow for dependencies\non capital market state variables, nor the value of the portfolio itself. This\nconstraint characterizes the strategic allocation of long-term investors.\nSecond, to gain insights on the role of mean-reversion, we wish to identify the\nentire family of extremal strategies, not only the optimal strategies. To\nderive the strategies we employ methods from calculus of variations, rather\nthan the usual HJB approach.",
          "arxiv_id": "2201.05375v1"
        },
        {
          "title": "Robust optimal investment and consumption strategies with portfolio constraints and stochastic environment",
          "year": "2024-07",
          "abstract": "We investigate a continuous-time investment-consumption problem with model\nuncertainty in a general diffusion-based market with random model coefficients.\nWe assume that a power utility investor is ambiguity-averse, with the\npreference to robustness captured by the homothetic multiplier robust\nspecification, and the investor's investment and consumption strategies are\nconstrained to closed convex sets. To solve this constrained robust control\nproblem, we employ the stochastic Hamilton-Jacobi-Bellman-Isaacs equations,\nbackward stochastic differential equations, and bounded mean oscillation\nmartingale theory. Furthermore, we show the investor incurs (non-negative)\nutility loss, i.e. the loss in welfare, if model uncertainty is ignored. When\nthe model coefficients are deterministic, we establish formally the\nrelationship between the investor's robustness preference and the robust\noptimal investment-consumption strategy and the value function, and the impact\nof investment and consumption constraints on the investor's robust optimal\ninvestment-consumption strategy and value function. Extensive numerical\nexperiments highlight the significant impact of ambiguity aversion, consumption\nand investment constraints, on the investor's robust optimal\ninvestment-consumption strategy, utility loss, and value function. Key findings\ninclude: 1) short-selling restriction always reduces the investor's utility\nloss when model uncertainty is ignored; 2) the effect of consumption\nconstraints on utility loss is more delicate and relies on the investor's risk\naversion level.",
          "arxiv_id": "2407.02831v1"
        },
        {
          "title": "Forward utility and market adjustments in relative investment-consumption games of many players",
          "year": "2020-12",
          "abstract": "We study a portfolio management problem featuring many-player and mean field\ncompetition, investment and consumption, and relative performance concerns\nunder the forward performance processes (FPP) framework. We focus on agents\nusing power (CRRA) type FPPs for their investment-consumption optimization\nproblem under a common noise Merton market model. We solve both the many-player\nand mean field game providing closed-form expressions for the solutions where\nthe limit of the former yields the latter. In our case, the FPP framework\nyields a continuum of solutions for the consumption component as indexed to a\nmarket parameter we coin \"market-risk relative consumption preference\". The\nparameter permits the agent to set a preference for their consumption going\nforward in time that, in the competition case, reflects a common market\nbehaviour. We show the FPP framework, under both competition and\nno-competition, allows the agent to disentangle her risk-tolerance and\nelasticity of intertemporal substitution (EIS) just like Epstein-Zin\npreferences under recursive utility framework and unlike the classical utility\ntheory one. This, in turn, allows a finer analysis on the agent's consumption\n\"income\" and \"substitution\" regimes, and, of independent interest, motivates a\nnew strand of economics research on EIS under the FPP framework. We find that\ncompetition rescales the agent's perception of consumption in a non-trivial\nmanner. We provide numerical illustrations of our results.",
          "arxiv_id": "2012.01235v2"
        }
      ],
      "2": [
        {
          "title": "Multi-asset return risk measures",
          "year": "2024-11",
          "abstract": "We revisit the recently introduced concept of return risk measures (RRMs) and\nextend it by incorporating risk management via multiple so-called eligible\nassets. The resulting new class of risk measures, termed multi-asset return\nrisk measures (MARRMs), introduces a novel economic model for multiplicative\nrisk sharing. We analyze properties of these risk measures. In particular, we\nprove that a positively homogeneous MARRM is quasi-convex if and only if it is\nconvex. Furthermore, we provide conditions to avoid inconsistent risk\nevaluations. Then, we point out the connection between MARRMs and the\nwell-known concept of multi-asset risk measures (MARMs). This is used to obtain\nvarious dual representations of MARRMs. Moreover, we conduct a series of case\nstudies, in which we use typical continuous-time financial markets and\ndifferent notions of acceptability of losses to compare RRMs, MARMs, and MARRMs\nand draw conclusions about the cost of risk mitigation.",
          "arxiv_id": "2411.08763v2"
        },
        {
          "title": "Set risk measures",
          "year": "2024-07",
          "abstract": "We introduce the concept of set risk measures (SRMs), which are real-valued\nmaps defined on the space of all non-empty, closed, and bounded sets of almost\nsurely bounded random variables. Traditional risk measures typically operate on\nspaces of random variables, but SRMs extend this framework to sets of random\nvariables. We establish an axiom scheme for SRMs, similar to classical risk\nmeasures but adapted for set operations. The main technical contribution is an\naxiomatic dual representation of convex SRMs by using regular, finitely\nadditive measures on the unit ball of the dual space of essentially bounded\nrandom variables. We explore worst-case SRMs, which evaluate risk as the\nsupremum of individual risks within a set, and provide a collection of examples\nillustrating the applicability of our framework to systemic risk, portfolio\noptimization, and decision-making under uncertainty. This work extends the\ntheory of risk measures to a more general and flexible setup, accommodating a\nbroader range of financial and mathematical applications.",
          "arxiv_id": "2407.18687v2"
        },
        {
          "title": "Factor risk measures",
          "year": "2024-04",
          "abstract": "This paper introduces and studies factor risk measures. While risk measures\nonly rely on the distribution of a loss random variable, in many cases risk\nneeds to be measured relative to some major factors. In this paper, we\nintroduce a double-argument mapping as a risk measure to assess the risk\nrelative to a vector of factors, called factor risk measure. The factor risk\nmeasure only depends on the joint distribution of the risk and the factors. A\nset of natural axioms are discussed, and particularly distortion, quantile,\nlinear and coherent factor risk measures are introduced and characterized.\nMoreover, we introduce a large set of concrete factor risk measures and many of\nthem are new to the literature, which are interpreted in the context of\nregulatory capital requirement. Finally, the distortion factor risk measures\nare applied in the risk-sharing problem and some numerical examples are\npresented to show the difference between the Value-at-Risk and the quantile\nfactor risk measures.",
          "arxiv_id": "2404.08475v1"
        }
      ],
      "3": [
        {
          "title": "Decentralised Finance and Automated Market Making: Predictable Loss and Optimal Liquidity Provision",
          "year": "2023-09",
          "abstract": "Constant product markets with concentrated liquidity (CL) are the most\npopular type of automated market makers. In this paper, we characterise the\ncontinuous-time wealth dynamics of strategic LPs who dynamically adjust their\nrange of liquidity provision in CL pools. Their wealth results from fee income,\nthe value of their holdings in the pool, and rebalancing costs. Next, we derive\na self-financing and closed-form optimal liquidity provision strategy where the\nwidth of the LP's liquidity range is determined by the profitability of the\npool (provision fees minus gas fees), the predictable losses (PL) of the LP's\nposition, and concentration risk. Concentration risk refers to the decrease in\nfee revenue if the marginal exchange rate (akin to the midprice in a limit\norder book) in the pool exits the LP's range of liquidity. When the drift in\nthe marginal rate is stochastic, we show how to optimally skew the range of\nliquidity to increase fee revenue and profit from the expected changes in the\nmarginal rate. Finally, we use Uniswap v3 data to show that, on average, LPs\nhave traded at a significant loss, and to show that the out-of-sample\nperformance of our strategy is superior to the historical performance of LPs in\nthe pool we consider.",
          "arxiv_id": "2309.08431v3"
        },
        {
          "title": "Optimal Design of Automated Market Makers on Decentralized Exchanges",
          "year": "2024-04",
          "abstract": "Automated market makers are a popular mechanism used on decentralized\nexchange, through which users trade assets with each other directly and\nautomatically through a liquidity pool and a fixed pricing function. The\nliquidity provider contributes to the liquidity pool by supplying assets to the\npool, and in return, they earn trading fees from investors who trade in the\npool. We propose a model of optimal liquidity provision in which a risk-averse\nliquidity provider decides the amount of wealth she would invest in the\ndecentralized market to provide liquidity in a two-asset pool, trade in a\ncentralized market, and consume in multiple periods. We derive the liquidity\nprovider's optimal strategy and the optimal design of the automated market\nmaker that maximizes the liquidity provider's utility. We find that the optimal\nunit trading fee increases in the volatility of the fundamental exchange rate\nof the two assets. We also find that the optimal pricing function is chosen to\nmake the asset allocation in the liquidity pool efficient for the liquidity\nprovider.",
          "arxiv_id": "2404.13291v3"
        },
        {
          "title": "Liquidity provision of utility indifference type in decentralized exchanges",
          "year": "2025-02",
          "abstract": "We present a mathematical formulation of liquidity provision in decentralized\nexchanges. We focus on constant function market makers of utility indifference\ntype, which include constant product market makers with concentrated liquidity\nas a special case. First, we examine no-arbitrage conditions for a liquidity\npool and compute an optimal arbitrage strategy when there is an external liquid\nmarket. Second, we show that liquidity provision suffers from impermanent loss\nunless a transaction fee is levied under the general framework with\nconcentrated liquidity. Third, we establish the well-definedness of\narbitrage-free reserve processes of a liquidity pool in continuous-time and\nshow that there is no loss-versus-rebalancing under a nonzero fee if the\nexternal market price is continuous. We then argue that liquidity provision by\nmultiple liquidity providers can be understood as liquidity provision by a\nrepresentative liquidity provider, meaning that the analysis boils down to that\nfor a single liquidity provider. Last, but not least, we give an answer to the\nfundamental question in which sense the very construction of constant function\nmarket makers with concentrated liquidity in the popular platform Uniswap v3 is\noptimal.",
          "arxiv_id": "2502.01931v1"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:43:49Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}