{
  "topics": {
    "data": {
      "0": {
        "name": "0_data_model_statistical_science",
        "keywords": [
          [
            "data",
            0.043973886292125335
          ],
          [
            "model",
            0.022860996359926777
          ],
          [
            "statistical",
            0.02088206212739136
          ],
          [
            "science",
            0.0197701192591147
          ],
          [
            "analysis",
            0.01964134478884526
          ],
          [
            "probability",
            0.01961859241225572
          ],
          [
            "statistics",
            0.019398682945652536
          ],
          [
            "methods",
            0.0192243915834098
          ],
          [
            "paper",
            0.01882521663405182
          ],
          [
            "models",
            0.017735801714193467
          ]
        ],
        "count": 564
      },
      "1": {
        "name": "1_population_COVID_data_climate",
        "keywords": [
          [
            "population",
            0.03867742892052406
          ],
          [
            "COVID",
            0.03147530233608717
          ],
          [
            "data",
            0.0301408607534102
          ],
          [
            "climate",
            0.02787592316502309
          ],
          [
            "model",
            0.026916317320129314
          ],
          [
            "study",
            0.02465986133109853
          ],
          [
            "models",
            0.024448903964304786
          ],
          [
            "change",
            0.023106830295208308
          ],
          [
            "time",
            0.020566361394935815
          ],
          [
            "pandemic",
            0.01860661688999849
          ]
        ],
        "count": 57
      }
    },
    "correlations": [
      [
        1.0,
        -0.2684890351495714
      ],
      [
        -0.2684890351495714,
        1.0
      ]
    ],
    "series": {
      "2020-01": [
        12,
        1
      ],
      "2020-02": [
        13,
        0
      ],
      "2020-03": [
        18,
        2
      ],
      "2020-04": [
        15,
        6
      ],
      "2020-05": [
        3,
        0
      ],
      "2020-06": [
        17,
        0
      ],
      "2020-07": [
        19,
        1
      ],
      "2020-08": [
        11,
        0
      ],
      "2020-09": [
        11,
        1
      ],
      "2020-10": [
        14,
        0
      ],
      "2020-11": [
        6,
        1
      ],
      "2020-12": [
        13,
        2
      ],
      "2021-01": [
        12,
        1
      ],
      "2021-02": [
        13,
        3
      ],
      "2021-03": [
        15,
        1
      ],
      "2021-04": [
        12,
        2
      ],
      "2021-05": [
        11,
        1
      ],
      "2021-06": [
        10,
        0
      ],
      "2021-07": [
        8,
        0
      ],
      "2021-08": [
        11,
        2
      ],
      "2021-09": [
        10,
        0
      ],
      "2021-10": [
        6,
        0
      ],
      "2021-11": [
        3,
        0
      ],
      "2021-12": [
        7,
        2
      ],
      "2022-01": [
        8,
        1
      ],
      "2022-02": [
        12,
        1
      ],
      "2022-03": [
        6,
        0
      ],
      "2022-04": [
        12,
        2
      ],
      "2022-05": [
        12,
        0
      ],
      "2022-06": [
        11,
        0
      ],
      "2022-07": [
        6,
        0
      ],
      "2022-08": [
        10,
        0
      ],
      "2022-09": [
        7,
        1
      ],
      "2022-10": [
        12,
        0
      ],
      "2022-11": [
        14,
        0
      ],
      "2022-12": [
        3,
        2
      ],
      "2023-01": [
        7,
        2
      ],
      "2023-02": [
        5,
        1
      ],
      "2023-03": [
        10,
        1
      ],
      "2023-04": [
        13,
        6
      ],
      "2023-05": [
        11,
        0
      ],
      "2023-06": [
        12,
        0
      ],
      "2023-07": [
        19,
        0
      ],
      "2023-08": [
        8,
        0
      ],
      "2023-09": [
        9,
        1
      ],
      "2023-10": [
        13,
        1
      ],
      "2023-11": [
        2,
        1
      ],
      "2023-12": [
        12,
        0
      ],
      "2024-01": [
        9,
        0
      ],
      "2024-02": [
        12,
        1
      ],
      "2024-03": [
        8,
        0
      ],
      "2024-04": [
        7,
        0
      ],
      "2024-05": [
        14,
        0
      ],
      "2024-06": [
        8,
        1
      ],
      "2024-07": [
        19,
        1
      ],
      "2024-08": [
        2,
        0
      ],
      "2024-09": [
        15,
        0
      ],
      "2024-10": [
        8,
        2
      ],
      "2024-11": [
        9,
        0
      ],
      "2024-12": [
        13,
        0
      ],
      "2025-01": [
        12,
        1
      ],
      "2025-02": [
        14,
        0
      ],
      "2025-03": [
        16,
        0
      ],
      "2025-04": [
        16,
        2
      ],
      "2025-05": [
        9,
        1
      ],
      "2025-06": [
        13,
        0
      ],
      "2025-07": [
        11,
        0
      ],
      "2025-08": [
        16,
        0
      ],
      "2025-09": [
        7,
        1
      ]
    },
    "papers": {
      "0": [
        {
          "title": "Computational Skills by Stealth in Secondary School Data Science",
          "year": "2020-10",
          "abstract": "The unprecedented growth in the availability of data of all types and\nqualities and the emergence of the field of data science has provided an\nimpetus to finally realizing the implementation of the full breadth of the\nNolan and Temple Lang proposed integration of computing concepts into\nstatistics curricula at all levels in statistics and new data science programs\nand courses. Moreover, data science, implemented carefully, opens accessible\npathways to stem for students for whom neither mathematics nor computer science\nare natural affinities, and who would traditionally be excluded. We discuss a\nproposal for the stealth development of computational skills in students' first\nexposure to data science through careful, scaffolded exposure to computation\nand its power. The intent of this approach is to support students, regardless\nof interest and self-efficacy in coding, in becoming data-driven learners, who\nare capable of asking complex questions about the world around them, and then\nanswering those questions through the use of data-driven inquiry. This\ndiscussion is presented in the context of the International Data Science in\nSchools Project which recently published computer science and statistics\nconsensus curriculum frameworks for a two-year secondary school data science\nprogram, designed to make data science accessible to all.",
          "arxiv_id": "2010.07017v1"
        },
        {
          "title": "Hierarchical Bayesian propulsion power models for marine vessels",
          "year": "2020-04",
          "abstract": "Assessing the magnitude of fuel consumption of marine traffic is a\nchallenging task. The consumption can be reduced by the ways the vessels are\noperated, to achieve both improved cost efficiency and reduced CO2 emissions.\nMathematical models for predicting ships' consumption are in a central role in\nboth of these tasks. Nowadays, many ships are equipped with data collection\nsystems, which enable data-based calibration of the consumption models.\nTypically this calibration procedure is carried out independently for each\nparticular ship, using only data collected from the ship in question. In this\npaper, we demonstrate a hierarchical Bayesian modeling approach, where we fit a\nsingle model over many vessels, with the assumption that the parameters of\nvessels of same type and similar characteristics (e.g. vessel size) are likely\nclose to each other. The benefits of such an approach are two-fold; 1) we can\nborrow information about parameters that are not well informed by the\nvessel-specific data using data from similar ships, and 2) we can use the final\nhierarchical model to predict the behavior of a vessel from which we don't have\nany data, based only on its characteristics. In this paper, we discuss the\nbasic concept and present a first simple version of the model. We apply the\nStan statistical modeling tool for the model fitting and use real data from 64\ncruise ships collected via the widely used commercial Eniram platform. By using\nBayesian statistical methods we obtain uncertainties for the model predictions,\ntoo. The prediction accuracy of the model is compared to an existing data-free\nmodeling approach.",
          "arxiv_id": "2004.11267v2"
        },
        {
          "title": "Introducing Variational Inference in Statistics and Data Science Curriculum",
          "year": "2023-01",
          "abstract": "Probabilistic models such as logistic regression, Bayesian classification,\nneural networks, and models for natural language processing, are increasingly\nmore present in both undergraduate and graduate statistics and data science\ncurricula due to their wide range of applications. In this paper, we present a\none-week course module for studnets in advanced undergraduate and applied\ngraduate courses on variational inference, a popular optimization-based\napproach for approximate inference with probabilistic models. Our proposed\nmodule is guided by active learning principles: In addition to lecture\nmaterials on variational inference, we provide an accompanying class activity,\nan \\texttt{R shiny} app, and guided labs based on real data applications of\nlogistic regression and clustering documents using Latent Dirichlet Allocation\nwith \\texttt{R} code. The main goal of our module is to expose students to a\nmethod that facilitates statistical modeling and inference with large datasets.\nUsing our proposed module as a foundation, instructors can adopt and adapt it\nto introduce more realistic case studies and applications in data science,\nBayesian statistics, multivariate analysis, and statistical machine learning\ncourses.",
          "arxiv_id": "2301.01251v2"
        }
      ],
      "1": [
        {
          "title": "A computational framework for modelling infectious disease policy based on age and household structure with applications to the COVID-19 pandemic",
          "year": "2022-01",
          "abstract": "The widespread, and in many countries unprecedented, use of\nnon-pharmaceutical interventions (NPIs) during the COVID-19 pandemic has\nhighlighted the need for mathematical models which can estimate the impact of\nthese measures while accounting for the highly heterogeneous risk profile of\nCOVID-19. Models accounting either for age structure or the household structure\nnecessary to explicitly model many NPIs are commonly used in infectious disease\nmodelling, but models incorporating both levels of structure present\nsubstantial computational and mathematical challenges due to their high\ndimensionality. Here we present a modelling framework for the spread of an\nepidemic that includes explicit representation of age structure and household\nstructure. Our model is formulated in terms of tractable systems of ordinary\ndifferential equations for which we provide an open-source Python\nimplementation. Such tractability leads to significant benefits for model\ncalibration, exhaustive evaluation of possible parameter values, and\ninterpretability of results. We demonstrate the flexibility of our model\nthrough four policy case studies, where we quantify the likely benefits of the\nfollowing measures which were either considered or implemented in the UK during\nthe current COVID-19 pandemic: control of within- and between-household mixing\nthrough NPIs; formation of support bubbles during lockdown periods;\nout-of-household isolation (OOHI); and temporary relaxation of NPIs during\nholiday periods. Our ordinary differential equation formulation and associated\nanalysis demonstrate that multiple dimensions of risk stratification and social\nstructure can be incorporated into infectious disease models without\nsacrificing mathematical tractability. This model and its software\nimplementation expand the range of tools available to infectious disease policy\nanalysts.",
          "arxiv_id": "2201.05486v2"
        },
        {
          "title": "An exploratory assessment of a multidimensional healthcare and economic data on COVID-19 in Nigeria",
          "year": "2020-11",
          "abstract": "The coronavirus disease of 2019 (COVID-19) is a pandemic that is ravaging\nNigeria and the world at large. This data article provides a dataset of daily\nupdates of COVID-19 as reported online by the Nigeria Centre for Disease\nControl (NCDC) from February 27, 2020 to September 29, 2020. The data were\nobtained through web scraping from different sources and it includes some\neconomic variables such as the Nigeria budget for each state in 2020,\npopulation estimate, healthcare facilities, and the COVID-19 laboratories in\nNigeria. The dataset has been processed using the standard of the FAIR data\nprinciple which encourages its findability, accessibility, interoperability,\nand reusability and will be relevant to researchers in different fields such as\nData Science, Epidemiology, Earth Modelling, and Health Informatics.",
          "arxiv_id": "2011.06689v1"
        },
        {
          "title": "COVIDHunter: An Accurate, Flexible, and Environment-Aware Open-Source COVID-19 Outbreak Simulation Model",
          "year": "2021-02",
          "abstract": "Background: Early detection and isolation of COVID-19 patients are essential\nfor successful implementation of mitigation strategies and eventually curbing\nthe disease spread. With a limited number of daily COVID-19 tests performed in\nevery country, simulating the COVID-19 spread along with the potential effect\nof each mitigation strategy currently remains one of the most effective ways in\nmanaging the healthcare system and guiding policy-makers. Methods: We introduce\nCOVIDHunter, a flexible and accurate COVID-19 outbreak simulation model that\nevaluates the current mitigation measures that are applied to a region and\nprovides suggestions on what strength the upcoming mitigation measure should\nbe. The key idea of COVIDHunter is to quantify the spread of COVID-19 in a\ngeographical region by simulating the average number of new infections caused\nby an infected person considering the effect of external factors, such as\nenvironmental conditions (e.g., climate, temperature, humidity) and mitigation\nmeasures. Results: Using Switzerland as a case study, COVIDHunter estimates\nthat if the policy-makers relax the mitigation measures by 50% for 30 days then\nboth the daily capacity need for hospital beds and daily number of deaths\nincrease exponentially by an average of 5.1x, who may occupy ICU beds and\nventilators for a period of time. Unlike existing models, the COVIDHunter model\naccurately monitors and predicts the daily number of cases, hospitalizations,\nand deaths due to COVID-19. Our model is flexible to configure and simple to\nmodify for modeling different scenarios under different environmental\nconditions and mitigation measures. Availability: We release the source code of\nthe COVIDHunter implementation at https://github.com/CMU- SAFARI/COVIDHunter\nand show how to flexibly configure our model for any scenario and easily extend\nit for different measures and conditions than we account for.",
          "arxiv_id": "2102.03667v2"
        }
      ]
    }
  },
  "metadata": {
    "lastUpdated": "2025-09-24T22:47:51Z",
    "dataVersion": "0.0.2",
    "period": {
      "start": "2020-01",
      "end": "2025-09"
    }
  }
}